// components/autofill/content/common/mojom/autofill_agent.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_AGENT_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_AGENT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace autofill {
namespace mojom {
namespace internal {

class ValidationContext;
class  AutofillAgent_TriggerReparse_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_TriggerReparse_Params_Data>;

  AutofillAgent_TriggerReparse_Params_Data();
  ~AutofillAgent_TriggerReparse_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_TriggerReparse_Params_Data) == 8,
              "Bad sizeof(AutofillAgent_TriggerReparse_Params_Data)");
class  AutofillAgent_FillOrPreviewForm_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t query_id;
  int32_t action;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_FillOrPreviewForm_Params_Data>;

  AutofillAgent_FillOrPreviewForm_Params_Data();
  ~AutofillAgent_FillOrPreviewForm_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_FillOrPreviewForm_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_FillOrPreviewForm_Params_Data)");
class  AutofillAgent_FieldTypePredictionsAvailable_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormDataPredictions_Data>>> forms;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_FieldTypePredictionsAvailable_Params_Data>;

  AutofillAgent_FieldTypePredictionsAvailable_Params_Data();
  ~AutofillAgent_FieldTypePredictionsAvailable_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_FieldTypePredictionsAvailable_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_FieldTypePredictionsAvailable_Params_Data)");
class  AutofillAgent_ClearSection_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_ClearSection_Params_Data>;

  AutofillAgent_ClearSection_Params_Data();
  ~AutofillAgent_ClearSection_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ClearSection_Params_Data) == 8,
              "Bad sizeof(AutofillAgent_ClearSection_Params_Data)");
class  AutofillAgent_ClearPreviewedForm_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_ClearPreviewedForm_Params_Data>;

  AutofillAgent_ClearPreviewedForm_Params_Data();
  ~AutofillAgent_ClearPreviewedForm_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ClearPreviewedForm_Params_Data) == 8,
              "Bad sizeof(AutofillAgent_ClearPreviewedForm_Params_Data)");
class  AutofillAgent_FillFieldWithValue_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_FillFieldWithValue_Params_Data>;

  AutofillAgent_FillFieldWithValue_Params_Data();
  ~AutofillAgent_FillFieldWithValue_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_FillFieldWithValue_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_FillFieldWithValue_Params_Data)");
class  AutofillAgent_PreviewFieldWithValue_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_PreviewFieldWithValue_Params_Data>;

  AutofillAgent_PreviewFieldWithValue_Params_Data();
  ~AutofillAgent_PreviewFieldWithValue_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_PreviewFieldWithValue_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_PreviewFieldWithValue_Params_Data)");
class  AutofillAgent_SetSuggestionAvailability_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
  int32_t type;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetSuggestionAvailability_Params_Data>;

  AutofillAgent_SetSuggestionAvailability_Params_Data();
  ~AutofillAgent_SetSuggestionAvailability_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetSuggestionAvailability_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_SetSuggestionAvailability_Params_Data)");
class  AutofillAgent_AcceptDataListSuggestion_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_AcceptDataListSuggestion_Params_Data>;

  AutofillAgent_AcceptDataListSuggestion_Params_Data();
  ~AutofillAgent_AcceptDataListSuggestion_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_AcceptDataListSuggestion_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_AcceptDataListSuggestion_Params_Data)");
class  AutofillAgent_FillPasswordSuggestion_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> username;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_FillPasswordSuggestion_Params_Data>;

  AutofillAgent_FillPasswordSuggestion_Params_Data();
  ~AutofillAgent_FillPasswordSuggestion_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_FillPasswordSuggestion_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_FillPasswordSuggestion_Params_Data)");
class  AutofillAgent_PreviewPasswordSuggestion_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> username;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_PreviewPasswordSuggestion_Params_Data>;

  AutofillAgent_PreviewPasswordSuggestion_Params_Data();
  ~AutofillAgent_PreviewPasswordSuggestion_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_PreviewPasswordSuggestion_Params_Data) == 24,
              "Bad sizeof(AutofillAgent_PreviewPasswordSuggestion_Params_Data)");
class  AutofillAgent_SetUserGestureRequired_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t required : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetUserGestureRequired_Params_Data>;

  AutofillAgent_SetUserGestureRequired_Params_Data();
  ~AutofillAgent_SetUserGestureRequired_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetUserGestureRequired_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_SetUserGestureRequired_Params_Data)");
class  AutofillAgent_SetSecureContextRequired_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t required : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetSecureContextRequired_Params_Data>;

  AutofillAgent_SetSecureContextRequired_Params_Data();
  ~AutofillAgent_SetSecureContextRequired_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetSecureContextRequired_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_SetSecureContextRequired_Params_Data)");
class  AutofillAgent_SetFocusRequiresScroll_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t require : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetFocusRequiresScroll_Params_Data>;

  AutofillAgent_SetFocusRequiresScroll_Params_Data();
  ~AutofillAgent_SetFocusRequiresScroll_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetFocusRequiresScroll_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_SetFocusRequiresScroll_Params_Data)");
class  AutofillAgent_SetQueryPasswordSuggestion_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t query : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetQueryPasswordSuggestion_Params_Data>;

  AutofillAgent_SetQueryPasswordSuggestion_Params_Data();
  ~AutofillAgent_SetQueryPasswordSuggestion_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetQueryPasswordSuggestion_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_SetQueryPasswordSuggestion_Params_Data)");
class  AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t backend_node_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_Params_Data>;

  AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_Params_Data();
  ~AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_Params_Data)");
class  AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_Data> field;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_ResponseParams_Data>;

  AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_ResponseParams_Data();
  ~AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_ResponseParams_Data() = delete;
};
static_assert(sizeof(AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_ResponseParams_Data) == 24,
              "Bad sizeof(AutofillAgent_GetElementFormAndFieldDataForDevToolsNodeId_ResponseParams_Data)");
class  AutofillAgent_SetAssistantKeyboardSuppressState_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t suppress : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetAssistantKeyboardSuppressState_Params_Data>;

  AutofillAgent_SetAssistantKeyboardSuppressState_Params_Data();
  ~AutofillAgent_SetAssistantKeyboardSuppressState_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetAssistantKeyboardSuppressState_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_SetAssistantKeyboardSuppressState_Params_Data)");
class  AutofillAgent_EnableHeavyFormDataScraping_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_EnableHeavyFormDataScraping_Params_Data>;

  AutofillAgent_EnableHeavyFormDataScraping_Params_Data();
  ~AutofillAgent_EnableHeavyFormDataScraping_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_EnableHeavyFormDataScraping_Params_Data) == 8,
              "Bad sizeof(AutofillAgent_EnableHeavyFormDataScraping_Params_Data)");
class  AutofillAgent_SetFieldsEligibleForManualFilling_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data>>> fields;

 private:
  friend class mojo::internal::MessageFragment<AutofillAgent_SetFieldsEligibleForManualFilling_Params_Data>;

  AutofillAgent_SetFieldsEligibleForManualFilling_Params_Data();
  ~AutofillAgent_SetFieldsEligibleForManualFilling_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetFieldsEligibleForManualFilling_Params_Data) == 16,
              "Bad sizeof(AutofillAgent_SetFieldsEligibleForManualFilling_Params_Data)");
class  PasswordAutofillAgent_FillPasswordForm_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::PasswordFormFillData_Data> form_data;

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillPasswordForm_Params_Data>;

  PasswordAutofillAgent_FillPasswordForm_Params_Data();
  ~PasswordAutofillAgent_FillPasswordForm_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_FillPasswordForm_Params_Data) == 16,
              "Bad sizeof(PasswordAutofillAgent_FillPasswordForm_Params_Data)");
class  PasswordAutofillAgent_InformNoSavedCredentials_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t should_show_popup_without_passwords : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_InformNoSavedCredentials_Params_Data>;

  PasswordAutofillAgent_InformNoSavedCredentials_Params_Data();
  ~PasswordAutofillAgent_InformNoSavedCredentials_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_InformNoSavedCredentials_Params_Data) == 16,
              "Bad sizeof(PasswordAutofillAgent_InformNoSavedCredentials_Params_Data)");
class  PasswordAutofillAgent_FillIntoFocusedField_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_password : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> credential;

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillIntoFocusedField_Params_Data>;

  PasswordAutofillAgent_FillIntoFocusedField_Params_Data();
  ~PasswordAutofillAgent_FillIntoFocusedField_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_FillIntoFocusedField_Params_Data) == 24,
              "Bad sizeof(PasswordAutofillAgent_FillIntoFocusedField_Params_Data)");
class  PasswordAutofillAgent_SetLoggingState_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t active : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_SetLoggingState_Params_Data>;

  PasswordAutofillAgent_SetLoggingState_Params_Data();
  ~PasswordAutofillAgent_SetLoggingState_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_SetLoggingState_Params_Data) == 16,
              "Bad sizeof(PasswordAutofillAgent_SetLoggingState_Params_Data)");
class  PasswordAutofillAgent_TouchToFillClosed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t show_virtual_keyboard : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_TouchToFillClosed_Params_Data>;

  PasswordAutofillAgent_TouchToFillClosed_Params_Data();
  ~PasswordAutofillAgent_TouchToFillClosed_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_TouchToFillClosed_Params_Data) == 16,
              "Bad sizeof(PasswordAutofillAgent_TouchToFillClosed_Params_Data)");
class  PasswordAutofillAgent_TriggerFormSubmission_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_TriggerFormSubmission_Params_Data>;

  PasswordAutofillAgent_TriggerFormSubmission_Params_Data();
  ~PasswordAutofillAgent_TriggerFormSubmission_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_TriggerFormSubmission_Params_Data) == 8,
              "Bad sizeof(PasswordAutofillAgent_TriggerFormSubmission_Params_Data)");
class  PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::ParsingResult_Data> parsing_result;

 private:
  friend class mojo::internal::MessageFragment<PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data>;

  PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data();
  ~PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data) == 16,
              "Bad sizeof(PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data)");
class  PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> generated_password;

 private:
  friend class mojo::internal::MessageFragment<PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data>;

  PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data();
  ~PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data) == 16,
              "Bad sizeof(PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data)");
class  PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data>;

  PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data();
  ~PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data) == 8,
              "Bad sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data)");
class  PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::PasswordGenerationUIData_Data> data;

 private:
  friend class mojo::internal::MessageFragment<PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data>;

  PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data();
  ~PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data) == 16,
              "Bad sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data)");
class  PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::PasswordFormGenerationData_Data> form;

 private:
  friend class mojo::internal::MessageFragment<PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data>;

  PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data();
  ~PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data) == 16,
              "Bad sizeof(PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data)");

}  // namespace internal


class AutofillAgent_TriggerReparse_ParamsDataView {
 public:
  AutofillAgent_TriggerReparse_ParamsDataView() = default;

  AutofillAgent_TriggerReparse_ParamsDataView(
      internal::AutofillAgent_TriggerReparse_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::AutofillAgent_TriggerReparse_Params_Data* data_ = nullptr;
};



class AutofillAgent_FillOrPreviewForm_ParamsDataView {
 public:
  AutofillAgent_FillOrPreviewForm_ParamsDataView() = default;

  AutofillAgent_FillOrPreviewForm_ParamsDataView(
      internal::AutofillAgent_FillOrPreviewForm_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
