// device/vr/public/mojom/isolated_xr_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef DEVICE_VR_PUBLIC_MOJOM_ISOLATED_XR_SERVICE_MOJOM_PARAMS_DATA_H_
#define DEVICE_VR_PUBLIC_MOJOM_ISOLATED_XR_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace device {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRSessionController_SetFrameDataRestricted_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t restricted : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<XRSessionController_SetFrameDataRestricted_Params_Data>;

  XRSessionController_SetFrameDataRestricted_Params_Data();
  ~XRSessionController_SetFrameDataRestricted_Params_Data() = delete;
};
static_assert(sizeof(XRSessionController_SetFrameDataRestricted_Params_Data) == 16,
              "Bad sizeof(XRSessionController_SetFrameDataRestricted_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntimeEventListener_OnVisibilityStateChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t visibility_state;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRRuntimeEventListener_OnVisibilityStateChanged_Params_Data>;

  XRRuntimeEventListener_OnVisibilityStateChanged_Params_Data();
  ~XRRuntimeEventListener_OnVisibilityStateChanged_Params_Data() = delete;
};
static_assert(sizeof(XRRuntimeEventListener_OnVisibilityStateChanged_Params_Data) == 16,
              "Bad sizeof(XRRuntimeEventListener_OnVisibilityStateChanged_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntimeEventListener_OnExitPresent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRRuntimeEventListener_OnExitPresent_Params_Data>;

  XRRuntimeEventListener_OnExitPresent_Params_Data();
  ~XRRuntimeEventListener_OnExitPresent_Params_Data() = delete;
};
static_assert(sizeof(XRRuntimeEventListener_OnExitPresent_Params_Data) == 8,
              "Bad sizeof(XRRuntimeEventListener_OnExitPresent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntime_RequestSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRRuntimeSessionOptions_Data> options;

 private:
  friend class mojo::internal::MessageFragment<XRRuntime_RequestSession_Params_Data>;

  XRRuntime_RequestSession_Params_Data();
  ~XRRuntime_RequestSession_Params_Data() = delete;
};
static_assert(sizeof(XRRuntime_RequestSession_Params_Data) == 16,
              "Bad sizeof(XRRuntime_RequestSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntime_RequestSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRRuntimeSessionResult_Data> session;

 private:
  friend class mojo::internal::MessageFragment<XRRuntime_RequestSession_ResponseParams_Data>;

  XRRuntime_RequestSession_ResponseParams_Data();
  ~XRRuntime_RequestSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRRuntime_RequestSession_ResponseParams_Data) == 16,
              "Bad sizeof(XRRuntime_RequestSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntime_ShutdownSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRRuntime_ShutdownSession_Params_Data>;

  XRRuntime_ShutdownSession_Params_Data();
  ~XRRuntime_ShutdownSession_Params_Data() = delete;
};
static_assert(sizeof(XRRuntime_ShutdownSession_Params_Data) == 8,
              "Bad sizeof(XRRuntime_ShutdownSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntime_ShutdownSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRRuntime_ShutdownSession_ResponseParams_Data>;

  XRRuntime_ShutdownSession_ResponseParams_Data();
  ~XRRuntime_ShutdownSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRRuntime_ShutdownSession_ResponseParams_Data) == 8,
              "Bad sizeof(XRRuntime_ShutdownSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRRuntime_ListenToDeviceChanges_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data listener;

 private:
  friend class mojo::internal::MessageFragment<XRRuntime_ListenToDeviceChanges_Params_Data>;

  XRRuntime_ListenToDeviceChanges_Params_Data();
  ~XRRuntime_ListenToDeviceChanges_Params_Data() = delete;
};
static_assert(sizeof(XRRuntime_ListenToDeviceChanges_Params_Data) == 16,
              "Bad sizeof(XRRuntime_ListenToDeviceChanges_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_RequestNextOverlayPose_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_RequestNextOverlayPose_Params_Data>;

  ImmersiveOverlay_RequestNextOverlayPose_Params_Data();
  ~ImmersiveOverlay_RequestNextOverlayPose_Params_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_RequestNextOverlayPose_Params_Data) == 8,
              "Bad sizeof(ImmersiveOverlay_RequestNextOverlayPose_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_RequestNextOverlayPose_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRRenderInfo_Data> render_info;

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_RequestNextOverlayPose_ResponseParams_Data>;

  ImmersiveOverlay_RequestNextOverlayPose_ResponseParams_Data();
  ~ImmersiveOverlay_RequestNextOverlayPose_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_RequestNextOverlayPose_ResponseParams_Data) == 16,
              "Bad sizeof(ImmersiveOverlay_RequestNextOverlayPose_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_SubmitOverlayTexture_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[2];
  mojo::internal::Handle_Data texture;
  mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> sync_token;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> left_bounds;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> right_bounds;

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_SubmitOverlayTexture_Params_Data>;

  ImmersiveOverlay_SubmitOverlayTexture_Params_Data();
  ~ImmersiveOverlay_SubmitOverlayTexture_Params_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_SubmitOverlayTexture_Params_Data) == 40,
              "Bad sizeof(ImmersiveOverlay_SubmitOverlayTexture_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_SubmitOverlayTexture_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_SubmitOverlayTexture_ResponseParams_Data>;

  ImmersiveOverlay_SubmitOverlayTexture_ResponseParams_Data();
  ~ImmersiveOverlay_SubmitOverlayTexture_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_SubmitOverlayTexture_ResponseParams_Data) == 16,
              "Bad sizeof(ImmersiveOverlay_SubmitOverlayTexture_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_SetOverlayAndWebXRVisibility_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t overlay_visible : 1;
  uint8_t webxr_visible : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_SetOverlayAndWebXRVisibility_Params_Data>;

  ImmersiveOverlay_SetOverlayAndWebXRVisibility_Params_Data();
  ~ImmersiveOverlay_SetOverlayAndWebXRVisibility_Params_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_SetOverlayAndWebXRVisibility_Params_Data) == 16,
              "Bad sizeof(ImmersiveOverlay_SetOverlayAndWebXRVisibility_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_Params_Data>;

  ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_Params_Data();
  ~ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_Params_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_Params_Data) == 8,
              "Bad sizeof(ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_ResponseParams_Data>;

  ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_ResponseParams_Data();
  ~ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_ResponseParams_Data) == 8,
              "Bad sizeof(ImmersiveOverlay_RequestNotificationOnWebXrSubmitted_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRCompositorHost_CreateImmersiveOverlay_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data overlay;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRCompositorHost_CreateImmersiveOverlay_Params_Data>;

  XRCompositorHost_CreateImmersiveOverlay_Params_Data();
  ~XRCompositorHost_CreateImmersiveOverlay_Params_Data() = delete;
};
static_assert(sizeof(XRCompositorHost_CreateImmersiveOverlay_Params_Data) == 16,
              "Bad sizeof(XRCompositorHost_CreateImmersiveOverlay_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) IsolatedXRRuntimeProviderClient_OnDeviceAdded_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data runtime;
  mojo::internal::Interface_Data compositor_host;
  mojo::internal::Pointer<internal::XRDeviceData_Data> device_data;
  int32_t device_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IsolatedXRRuntimeProviderClient_OnDeviceAdded_Params_Data>;

  IsolatedXRRuntimeProviderClient_OnDeviceAdded_Params_Data();
  ~IsolatedXRRuntimeProviderClient_OnDeviceAdded_Params_Data() = delete;
};
static_assert(sizeof(IsolatedXRRuntimeProviderClient_OnDeviceAdded_Params_Data) == 40,
              "Bad sizeof(IsolatedXRRuntimeProviderClient_OnDeviceAdded_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) IsolatedXRRuntimeProviderClient_OnDeviceRemoved_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t device_index;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IsolatedXRRuntimeProviderClient_OnDeviceRemoved_Params_Data>;

  IsolatedXRRuntimeProviderClient_OnDeviceRemoved_Params_Data();
  ~IsolatedXRRuntimeProviderClient_OnDeviceRemoved_Params_Data() = delete;
};
static_assert(sizeof(IsolatedXRRuntimeProviderClient_OnDeviceRemoved_Params_Data) == 16,
              "Bad sizeof(IsolatedXRRuntimeProviderClient_OnDeviceRemoved_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) IsolatedXRRuntimeProviderClient_OnDevicesEnumerated_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<IsolatedXRRuntimeProviderClient_OnDevicesEnumerated_Params_Data>;

  IsolatedXRRuntimeProviderClient_OnDevicesEnumerated_Params_Data();
  ~IsolatedXRRuntimeProviderClient_OnDevicesEnumerated_Params_Data() = delete;
};
static_assert(sizeof(IsolatedXRRuntimeProviderClient_OnDevicesEnumerated_Params_Data) == 8,
              "Bad sizeof(IsolatedXRRuntimeProviderClient_OnDevicesEnumerated_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) IsolatedXRRuntimeProvider_RequestDevices_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data client;

 private:
  friend class mojo::internal::MessageFragment<IsolatedXRRuntimeProvider_RequestDevices_Params_Data>;

  IsolatedXRRuntimeProvider_RequestDevices_Params_Data();
  ~IsolatedXRRuntimeProvider_RequestDevices_Params_Data() = delete;
};
static_assert(sizeof(IsolatedXRRuntimeProvider_RequestDevices_Params_Data) == 16,
              "Bad sizeof(IsolatedXRRuntimeProvider_RequestDevices_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRDeviceService_BindRuntimeProvider_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  mojo::internal::Interface_Data host;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRDeviceService_BindRuntimeProvider_Params_Data>;

  XRDeviceService_BindRuntimeProvider_Params_Data();
  ~XRDeviceService_BindRuntimeProvider_Params_Data() = delete;
};
static_assert(sizeof(XRDeviceService_BindRuntimeProvider_Params_Data) == 24,
              "Bad sizeof(XRDeviceService_BindRuntimeProvider_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRDeviceService_BindTestHook_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRDeviceService_BindTestHook_Params_Data>;

  XRDeviceService_BindTestHook_Params_Data();
  ~XRDeviceService_BindTestHook_Params_Data() = delete;
};
static_assert(sizeof(XRDeviceService_BindTestHook_Params_Data) == 16,
              "Bad sizeof(XRDeviceService_BindTestHook_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_ISOLATED_XR_SERVICE_MOJO_BINDINGS_SHARED) XRDeviceServiceHost_BindGpu_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRDeviceServiceHost_BindGpu_Params_Data>;

  XRDeviceServiceHost_BindGpu_Params_Data();
  ~XRDeviceServiceHost_BindGpu_Params_Data() = delete;
};
static_assert(sizeof(XRDeviceServiceHost_BindGpu_Params_Data) == 16,
              "Bad sizeof(XRDeviceServiceHost_BindGpu_Params_Data)");

}  // namespace internal


class XRSessionController_SetFrameDataRestricted_ParamsDataView {
 public:
  XRSessionController_SetFrameDataRestricted_ParamsDataView() = default;

  XRSessionController_SetFrameDataRestricted_ParamsDataView(
      internal::XRSessionController_SetFrameDataRestricted_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool restricted() const {
    return data_->restricted;
  }
 private:
  internal::XRSessionController_SetFrameDataRestricted_Params_Data* data_ = nullptr;
};



class XRRuntimeEventListener_OnVisibilityStateChanged_ParamsDataView {
 public:
  XRRuntimeEventListener_OnVisibilityStateChanged_ParamsDataView() = default;

  XRRuntimeEventListener_OnVisibilityStateChanged_ParamsDataView(
