// device/vr/public/mojom/vr_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef DEVICE_VR_PUBLIC_MOJOM_VR_SERVICE_MOJOM_PARAMS_DATA_H_
#define DEVICE_VR_PUBLIC_MOJOM_VR_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace device {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_SetClient_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data client;

 private:
  friend class mojo::internal::MessageFragment<VRService_SetClient_Params_Data>;

  VRService_SetClient_Params_Data();
  ~VRService_SetClient_Params_Data() = delete;
};
static_assert(sizeof(VRService_SetClient_Params_Data) == 16,
              "Bad sizeof(VRService_SetClient_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_RequestSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRSessionOptions_Data> options;

 private:
  friend class mojo::internal::MessageFragment<VRService_RequestSession_Params_Data>;

  VRService_RequestSession_Params_Data();
  ~VRService_RequestSession_Params_Data() = delete;
};
static_assert(sizeof(VRService_RequestSession_Params_Data) == 16,
              "Bad sizeof(VRService_RequestSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_RequestSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::RequestSessionResult_Data result;

 private:
  friend class mojo::internal::MessageFragment<VRService_RequestSession_ResponseParams_Data>;

  VRService_RequestSession_ResponseParams_Data();
  ~VRService_RequestSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_RequestSession_ResponseParams_Data) == 24,
              "Bad sizeof(VRService_RequestSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_SupportsSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRSessionOptions_Data> options;

 private:
  friend class mojo::internal::MessageFragment<VRService_SupportsSession_Params_Data>;

  VRService_SupportsSession_Params_Data();
  ~VRService_SupportsSession_Params_Data() = delete;
};
static_assert(sizeof(VRService_SupportsSession_Params_Data) == 16,
              "Bad sizeof(VRService_SupportsSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_SupportsSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t supports_session : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<VRService_SupportsSession_ResponseParams_Data>;

  VRService_SupportsSession_ResponseParams_Data();
  ~VRService_SupportsSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_SupportsSession_ResponseParams_Data) == 16,
              "Bad sizeof(VRService_SupportsSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_ExitPresent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VRService_ExitPresent_Params_Data>;

  VRService_ExitPresent_Params_Data();
  ~VRService_ExitPresent_Params_Data() = delete;
};
static_assert(sizeof(VRService_ExitPresent_Params_Data) == 8,
              "Bad sizeof(VRService_ExitPresent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_ExitPresent_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VRService_ExitPresent_ResponseParams_Data>;

  VRService_ExitPresent_ResponseParams_Data();
  ~VRService_ExitPresent_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_ExitPresent_ResponseParams_Data) == 8,
              "Bad sizeof(VRService_ExitPresent_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_SetFramesThrottled_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t throttled : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<VRService_SetFramesThrottled_Params_Data>;

  VRService_SetFramesThrottled_Params_Data();
  ~VRService_SetFramesThrottled_Params_Data() = delete;
};
static_assert(sizeof(VRService_SetFramesThrottled_Params_Data) == 16,
              "Bad sizeof(VRService_SetFramesThrottled_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_MakeXrCompatible_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VRService_MakeXrCompatible_Params_Data>;

  VRService_MakeXrCompatible_Params_Data();
  ~VRService_MakeXrCompatible_Params_Data() = delete;
};
static_assert(sizeof(VRService_MakeXrCompatible_Params_Data) == 8,
              "Bad sizeof(VRService_MakeXrCompatible_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRService_MakeXrCompatible_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t xr_compatible_result;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<VRService_MakeXrCompatible_ResponseParams_Data>;

  VRService_MakeXrCompatible_ResponseParams_Data();
  ~VRService_MakeXrCompatible_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_MakeXrCompatible_ResponseParams_Data) == 16,
              "Bad sizeof(VRService_MakeXrCompatible_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t feature;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data>;

  XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data();
  ~XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data() = delete;
};
static_assert(sizeof(XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data) == 16,
              "Bad sizeof(XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) VRServiceClient_OnDeviceChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VRServiceClient_OnDeviceChanged_Params_Data>;

  VRServiceClient_OnDeviceChanged_Params_Data();
  ~VRServiceClient_OnDeviceChanged_Params_Data() = delete;
};
static_assert(sizeof(VRServiceClient_OnDeviceChanged_Params_Data) == 8,
              "Bad sizeof(VRServiceClient_OnDeviceChanged_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::XRNativeOriginInformation_Data native_origin_information;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> entity_types;
  mojo::internal::Pointer<internal::XRRay_Data> ray;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data>;

  XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data) == 40,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t subscription_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data>;

  XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> profile_name;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> entity_types;
  mojo::internal::Pointer<internal::XRRay_Data> ray;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data>;

  XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data) == 32,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t subscription_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data>;

  XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint64_t subscription_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data>;

  XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data();
  ~XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreateAnchor_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::XRNativeOriginInformation_Data native_origin_information;
  mojo::internal::Pointer<internal::Pose_Data> native_origin_from_anchor;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_CreateAnchor_Params_Data>;

  XREnvironmentIntegrationProvider_CreateAnchor_Params_Data();
  ~XREnvironmentIntegrationProvider_CreateAnchor_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreateAnchor_Params_Data) == 32,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreateAnchor_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t anchor_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data>;

  XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::XRNativeOriginInformation_Data native_origin_information;
  mojo::internal::Pointer<internal::Pose_Data> native_origin_from_anchor;
  uint64_t plane_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data>;

  XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data();
  ~XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data) == 40,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t anchor_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data>;

  XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_DetachAnchor_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint64_t anchor_id;

 private:
  friend class mojo::internal::MessageFragment<XREnvironmentIntegrationProvider_DetachAnchor_Params_Data>;

  XREnvironmentIntegrationProvider_DetachAnchor_Params_Data();
  ~XREnvironmentIntegrationProvider_DetachAnchor_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_DetachAnchor_Params_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_DetachAnchor_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRInputSourceButtonListener_OnButtonEvent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRInputSourceState_Data> input_source;

 private:
  friend class mojo::internal::MessageFragment<XRInputSourceButtonListener_OnButtonEvent_Params_Data>;

  XRInputSourceButtonListener_OnButtonEvent_Params_Data();
  ~XRInputSourceButtonListener_OnButtonEvent_Params_Data() = delete;
};
static_assert(sizeof(XRInputSourceButtonListener_OnButtonEvent_Params_Data) == 16,
              "Bad sizeof(XRInputSourceButtonListener_OnButtonEvent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRFrameDataProvider_GetFrameData_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRFrameDataRequestOptions_Data> options;

 private:
  friend class mojo::internal::MessageFragment<XRFrameDataProvider_GetFrameData_Params_Data>;

  XRFrameDataProvider_GetFrameData_Params_Data();
  ~XRFrameDataProvider_GetFrameData_Params_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_GetFrameData_Params_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_GetFrameData_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRFrameDataProvider_GetFrameData_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRFrameData_Data> frame_data;

 private:
  friend class mojo::internal::MessageFragment<XRFrameDataProvider_GetFrameData_ResponseParams_Data>;

  XRFrameDataProvider_GetFrameData_ResponseParams_Data();
  ~XRFrameDataProvider_GetFrameData_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_GetFrameData_ResponseParams_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_GetFrameData_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data environment_provider;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data>;

  XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data();
  ~XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRFrameDataProvider_SetInputSourceButtonListener_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data event_listener;

 private:
  friend class mojo::internal::MessageFragment<XRFrameDataProvider_SetInputSourceButtonListener_Params_Data>;

  XRFrameDataProvider_SetInputSourceButtonListener_Params_Data();
  ~XRFrameDataProvider_SetInputSourceButtonListener_Params_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_SetInputSourceButtonListener_Params_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_SetInputSourceButtonListener_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationProvider_UpdateLayerBounds_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> left_bounds;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> right_bounds;
  mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> source_size;

 private:
  friend class mojo::internal::MessageFragment<XRPresentationProvider_UpdateLayerBounds_Params_Data>;

  XRPresentationProvider_UpdateLayerBounds_Params_Data();
  ~XRPresentationProvider_UpdateLayerBounds_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_UpdateLayerBounds_Params_Data) == 40,
              "Bad sizeof(XRPresentationProvider_UpdateLayerBounds_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrameMissing_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> sync_token;

 private:
  friend class mojo::internal::MessageFragment<XRPresentationProvider_SubmitFrameMissing_Params_Data>;

  XRPresentationProvider_SubmitFrameMissing_Params_Data();
  ~XRPresentationProvider_SubmitFrameMissing_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrameMissing_Params_Data) == 24,
              "Bad sizeof(XRPresentationProvider_SubmitFrameMissing_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrame_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gpu::mojom::internal::MailboxHolder_Data> mailbox_holder;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time_waited;

 private:
  friend class mojo::internal::MessageFragment<XRPresentationProvider_SubmitFrame_Params_Data>;

  XRPresentationProvider_SubmitFrame_Params_Data();
  ~XRPresentationProvider_SubmitFrame_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrame_Params_Data) == 32,
              "Bad sizeof(XRPresentationProvider_SubmitFrame_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frameId;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> sync_token;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time_waited;

 private:
  friend class mojo::internal::MessageFragment<XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data>;

  XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data();
  ~XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data) == 32,
              "Bad sizeof(XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationClient_OnSubmitFrameTransferred_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<XRPresentationClient_OnSubmitFrameTransferred_Params_Data>;

  XRPresentationClient_OnSubmitFrameTransferred_Params_Data();
  ~XRPresentationClient_OnSubmitFrameTransferred_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationClient_OnSubmitFrameTransferred_Params_Data) == 16,
              "Bad sizeof(XRPresentationClient_OnSubmitFrameTransferred_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationClient_OnSubmitFrameRendered_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRPresentationClient_OnSubmitFrameRendered_Params_Data>;

  XRPresentationClient_OnSubmitFrameRendered_Params_Data();
  ~XRPresentationClient_OnSubmitFrameRendered_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationClient_OnSubmitFrameRendered_Params_Data) == 8,
              "Bad sizeof(XRPresentationClient_OnSubmitFrameRendered_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRPresentationClient_OnSubmitFrameGpuFence_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gfx::mojom::internal::GpuFenceHandle_Data> gpu_fence_handle;

 private:
  friend class mojo::internal::MessageFragment<XRPresentationClient_OnSubmitFrameGpuFence_Params_Data>;

  XRPresentationClient_OnSubmitFrameGpuFence_Params_Data();
  ~XRPresentationClient_OnSubmitFrameGpuFence_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationClient_OnSubmitFrameGpuFence_Params_Data) == 16,
              "Bad sizeof(XRPresentationClient_OnSubmitFrameGpuFence_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRSessionClient_OnExitPresent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRSessionClient_OnExitPresent_Params_Data>;

  XRSessionClient_OnExitPresent_Params_Data();
  ~XRSessionClient_OnExitPresent_Params_Data() = delete;
};
static_assert(sizeof(XRSessionClient_OnExitPresent_Params_Data) == 8,
              "Bad sizeof(XRSessionClient_OnExitPresent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_SERVICE_MOJO_BINDINGS_SHARED) XRSessionClient_OnVisibilityStateChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t visibility_state;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRSessionClient_OnVisibilityStateChanged_Params_Data>;

  XRSessionClient_OnVisibilityStateChanged_Params_Data();
  ~XRSessionClient_OnVisibilityStateChanged_Params_Data() = delete;
};
static_assert(sizeof(XRSessionClient_OnVisibilityStateChanged_Params_Data) == 16,
              "Bad sizeof(XRSessionClient_OnVisibilityStateChanged_Params_Data)");

}  // namespace internal


class VRService_SetClient_ParamsDataView {
 public:
  VRService_SetClient_ParamsDataView() = default;

  VRService_SetClient_ParamsDataView(
      internal::VRService_SetClient_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeClient() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::device::mojom::VRServiceClientInterfaceBase>>(
            &data_->client, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::VRService_SetClient_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class VRService_RequestSession_ParamsDataView {
 public:
