// device/vr/public/mojom/browser_test_interfaces.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef DEVICE_VR_PUBLIC_MOJOM_BROWSER_TEST_INTERFACES_MOJOM_PARAMS_DATA_H_
#define DEVICE_VR_PUBLIC_MOJOM_BROWSER_TEST_INTERFACES_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace device_test {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_OnFrameSubmitted_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ViewData_Data>>> frame_data;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_OnFrameSubmitted_Params_Data>;

  XRTestHook_OnFrameSubmitted_Params_Data();
  ~XRTestHook_OnFrameSubmitted_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_OnFrameSubmitted_Params_Data) == 16,
              "Bad sizeof(XRTestHook_OnFrameSubmitted_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_OnFrameSubmitted_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_OnFrameSubmitted_ResponseParams_Data>;

  XRTestHook_OnFrameSubmitted_ResponseParams_Data();
  ~XRTestHook_OnFrameSubmitted_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_OnFrameSubmitted_ResponseParams_Data) == 8,
              "Bad sizeof(XRTestHook_OnFrameSubmitted_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetDeviceConfig_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetDeviceConfig_Params_Data>;

  XRTestHook_WaitGetDeviceConfig_Params_Data();
  ~XRTestHook_WaitGetDeviceConfig_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetDeviceConfig_Params_Data) == 8,
              "Bad sizeof(XRTestHook_WaitGetDeviceConfig_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetDeviceConfig_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::DeviceConfig_Data> config;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetDeviceConfig_ResponseParams_Data>;

  XRTestHook_WaitGetDeviceConfig_ResponseParams_Data();
  ~XRTestHook_WaitGetDeviceConfig_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetDeviceConfig_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetDeviceConfig_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetPresentingPose_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetPresentingPose_Params_Data>;

  XRTestHook_WaitGetPresentingPose_Params_Data();
  ~XRTestHook_WaitGetPresentingPose_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetPresentingPose_Params_Data) == 8,
              "Bad sizeof(XRTestHook_WaitGetPresentingPose_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetPresentingPose_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PoseFrameData_Data> data;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetPresentingPose_ResponseParams_Data>;

  XRTestHook_WaitGetPresentingPose_ResponseParams_Data();
  ~XRTestHook_WaitGetPresentingPose_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetPresentingPose_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetPresentingPose_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetMagicWindowPose_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetMagicWindowPose_Params_Data>;

  XRTestHook_WaitGetMagicWindowPose_Params_Data();
  ~XRTestHook_WaitGetMagicWindowPose_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetMagicWindowPose_Params_Data) == 8,
              "Bad sizeof(XRTestHook_WaitGetMagicWindowPose_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetMagicWindowPose_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PoseFrameData_Data> data;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetMagicWindowPose_ResponseParams_Data>;

  XRTestHook_WaitGetMagicWindowPose_ResponseParams_Data();
  ~XRTestHook_WaitGetMagicWindowPose_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetMagicWindowPose_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetMagicWindowPose_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t index;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_Params_Data>;

  XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_Params_Data();
  ~XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_Params_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t role;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_ResponseParams_Data>;

  XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_ResponseParams_Data();
  ~XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetControllerRoleForTrackedDeviceIndex_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetTrackedDeviceClass_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t index;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetTrackedDeviceClass_Params_Data>;

  XRTestHook_WaitGetTrackedDeviceClass_Params_Data();
  ~XRTestHook_WaitGetTrackedDeviceClass_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetTrackedDeviceClass_Params_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetTrackedDeviceClass_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetTrackedDeviceClass_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t device_class;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetTrackedDeviceClass_ResponseParams_Data>;

  XRTestHook_WaitGetTrackedDeviceClass_ResponseParams_Data();
  ~XRTestHook_WaitGetTrackedDeviceClass_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetTrackedDeviceClass_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetTrackedDeviceClass_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetControllerData_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t index;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetControllerData_Params_Data>;

  XRTestHook_WaitGetControllerData_Params_Data();
  ~XRTestHook_WaitGetControllerData_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetControllerData_Params_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetControllerData_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetControllerData_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ControllerFrameData_Data> data;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetControllerData_ResponseParams_Data>;

  XRTestHook_WaitGetControllerData_ResponseParams_Data();
  ~XRTestHook_WaitGetControllerData_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetControllerData_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetControllerData_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetEventData_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetEventData_Params_Data>;

  XRTestHook_WaitGetEventData_Params_Data();
  ~XRTestHook_WaitGetEventData_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetEventData_Params_Data) == 8,
              "Bad sizeof(XRTestHook_WaitGetEventData_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetEventData_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::EventData_Data> data;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetEventData_ResponseParams_Data>;

  XRTestHook_WaitGetEventData_ResponseParams_Data();
  ~XRTestHook_WaitGetEventData_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetEventData_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetEventData_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetCanCreateSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetCanCreateSession_Params_Data>;

  XRTestHook_WaitGetCanCreateSession_Params_Data();
  ~XRTestHook_WaitGetCanCreateSession_Params_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetCanCreateSession_Params_Data) == 8,
              "Bad sizeof(XRTestHook_WaitGetCanCreateSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRTestHook_WaitGetCanCreateSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t can_create_session : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<XRTestHook_WaitGetCanCreateSession_ResponseParams_Data>;

  XRTestHook_WaitGetCanCreateSession_ResponseParams_Data();
  ~XRTestHook_WaitGetCanCreateSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRTestHook_WaitGetCanCreateSession_ResponseParams_Data) == 16,
              "Bad sizeof(XRTestHook_WaitGetCanCreateSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRServiceTestHook_SetTestHook_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data hook;

 private:
  friend class mojo::internal::MessageFragment<XRServiceTestHook_SetTestHook_Params_Data>;

  XRServiceTestHook_SetTestHook_Params_Data();
  ~XRServiceTestHook_SetTestHook_Params_Data() = delete;
};
static_assert(sizeof(XRServiceTestHook_SetTestHook_Params_Data) == 16,
              "Bad sizeof(XRServiceTestHook_SetTestHook_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRServiceTestHook_SetTestHook_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRServiceTestHook_SetTestHook_ResponseParams_Data>;

  XRServiceTestHook_SetTestHook_ResponseParams_Data();
  ~XRServiceTestHook_SetTestHook_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRServiceTestHook_SetTestHook_ResponseParams_Data) == 8,
              "Bad sizeof(XRServiceTestHook_SetTestHook_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRServiceTestHook_TerminateDeviceServiceProcessForTesting_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRServiceTestHook_TerminateDeviceServiceProcessForTesting_Params_Data>;

  XRServiceTestHook_TerminateDeviceServiceProcessForTesting_Params_Data();
  ~XRServiceTestHook_TerminateDeviceServiceProcessForTesting_Params_Data() = delete;
};
static_assert(sizeof(XRServiceTestHook_TerminateDeviceServiceProcessForTesting_Params_Data) == 8,
              "Bad sizeof(XRServiceTestHook_TerminateDeviceServiceProcessForTesting_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_TEST_MOJO_BINDINGS_SHARED) XRServiceTestHook_TerminateDeviceServiceProcessForTesting_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<XRServiceTestHook_TerminateDeviceServiceProcessForTesting_ResponseParams_Data>;

  XRServiceTestHook_TerminateDeviceServiceProcessForTesting_ResponseParams_Data();
  ~XRServiceTestHook_TerminateDeviceServiceProcessForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRServiceTestHook_TerminateDeviceServiceProcessForTesting_ResponseParams_Data) == 8,
              "Bad sizeof(XRServiceTestHook_TerminateDeviceServiceProcessForTesting_ResponseParams_Data)");

}  // namespace internal


class XRTestHook_OnFrameSubmitted_ParamsDataView {
 public:
  XRTestHook_OnFrameSubmitted_ParamsDataView() = default;

  XRTestHook_OnFrameSubmitted_ParamsDataView(
      internal::XRTestHook_OnFrameSubmitted_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetFrameDataDataView(
      mojo::ArrayDataView<ViewDataDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadFrameData(UserType* output) {
    
    auto* pointer = data_->frame_data.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::device_test::mojom::ViewDataDataView>>(
        pointer, output, message_);
  }
 private:
