// device/bluetooth/public/mojom/adapter.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef DEVICE_BLUETOOTH_PUBLIC_MOJOM_ADAPTER_MOJOM_PARAMS_DATA_H_
#define DEVICE_BLUETOOTH_PUBLIC_MOJOM_ADAPTER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace bluetooth {
namespace mojom {
namespace internal {

class ValidationContext;
class  Advertisement_Unregister_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Advertisement_Unregister_Params_Data>;

  Advertisement_Unregister_Params_Data();
  ~Advertisement_Unregister_Params_Data() = delete;
};
static_assert(sizeof(Advertisement_Unregister_Params_Data) == 8,
              "Bad sizeof(Advertisement_Unregister_Params_Data)");
class  Advertisement_Unregister_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Advertisement_Unregister_ResponseParams_Data>;

  Advertisement_Unregister_ResponseParams_Data();
  ~Advertisement_Unregister_ResponseParams_Data() = delete;
};
static_assert(sizeof(Advertisement_Unregister_ResponseParams_Data) == 8,
              "Bad sizeof(Advertisement_Unregister_ResponseParams_Data)");
class  DiscoverySession_IsActive_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<DiscoverySession_IsActive_Params_Data>;

  DiscoverySession_IsActive_Params_Data();
  ~DiscoverySession_IsActive_Params_Data() = delete;
};
static_assert(sizeof(DiscoverySession_IsActive_Params_Data) == 8,
              "Bad sizeof(DiscoverySession_IsActive_Params_Data)");
class  DiscoverySession_IsActive_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t active : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<DiscoverySession_IsActive_ResponseParams_Data>;

  DiscoverySession_IsActive_ResponseParams_Data();
  ~DiscoverySession_IsActive_ResponseParams_Data() = delete;
};
static_assert(sizeof(DiscoverySession_IsActive_ResponseParams_Data) == 16,
              "Bad sizeof(DiscoverySession_IsActive_ResponseParams_Data)");
class  DiscoverySession_Stop_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<DiscoverySession_Stop_Params_Data>;

  DiscoverySession_Stop_Params_Data();
  ~DiscoverySession_Stop_Params_Data() = delete;
};
static_assert(sizeof(DiscoverySession_Stop_Params_Data) == 8,
              "Bad sizeof(DiscoverySession_Stop_Params_Data)");
class  DiscoverySession_Stop_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<DiscoverySession_Stop_ResponseParams_Data>;

  DiscoverySession_Stop_ResponseParams_Data();
  ~DiscoverySession_Stop_ResponseParams_Data() = delete;
};
static_assert(sizeof(DiscoverySession_Stop_ResponseParams_Data) == 16,
              "Bad sizeof(DiscoverySession_Stop_ResponseParams_Data)");
class  Socket_Disconnect_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Socket_Disconnect_Params_Data>;

  Socket_Disconnect_Params_Data();
  ~Socket_Disconnect_Params_Data() = delete;
};
static_assert(sizeof(Socket_Disconnect_Params_Data) == 8,
              "Bad sizeof(Socket_Disconnect_Params_Data)");
class  Socket_Disconnect_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Socket_Disconnect_ResponseParams_Data>;

  Socket_Disconnect_ResponseParams_Data();
  ~Socket_Disconnect_ResponseParams_Data() = delete;
};
static_assert(sizeof(Socket_Disconnect_ResponseParams_Data) == 8,
              "Bad sizeof(Socket_Disconnect_ResponseParams_Data)");
class  ServerSocket_Accept_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ServerSocket_Accept_Params_Data>;

  ServerSocket_Accept_Params_Data();
  ~ServerSocket_Accept_Params_Data() = delete;
};
static_assert(sizeof(ServerSocket_Accept_Params_Data) == 8,
              "Bad sizeof(ServerSocket_Accept_Params_Data)");
class  ServerSocket_Accept_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::AcceptConnectionResult_Data> result;

 private:
  friend class mojo::internal::MessageFragment<ServerSocket_Accept_ResponseParams_Data>;

  ServerSocket_Accept_ResponseParams_Data();
  ~ServerSocket_Accept_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServerSocket_Accept_ResponseParams_Data) == 16,
              "Bad sizeof(ServerSocket_Accept_ResponseParams_Data)");
class  ServerSocket_Disconnect_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ServerSocket_Disconnect_Params_Data>;

  ServerSocket_Disconnect_Params_Data();
  ~ServerSocket_Disconnect_Params_Data() = delete;
};
static_assert(sizeof(ServerSocket_Disconnect_Params_Data) == 8,
              "Bad sizeof(ServerSocket_Disconnect_Params_Data)");
class  ServerSocket_Disconnect_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ServerSocket_Disconnect_ResponseParams_Data>;

  ServerSocket_Disconnect_ResponseParams_Data();
  ~ServerSocket_Disconnect_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServerSocket_Disconnect_ResponseParams_Data) == 8,
              "Bad sizeof(ServerSocket_Disconnect_ResponseParams_Data)");
class  Adapter_ConnectToDevice_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> address;

 private:
  friend class mojo::internal::MessageFragment<Adapter_ConnectToDevice_Params_Data>;

  Adapter_ConnectToDevice_Params_Data();
  ~Adapter_ConnectToDevice_Params_Data() = delete;
};
static_assert(sizeof(Adapter_ConnectToDevice_Params_Data) == 16,
              "Bad sizeof(Adapter_ConnectToDevice_Params_Data)");
class  Adapter_ConnectToDevice_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  mojo::internal::Interface_Data device;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Adapter_ConnectToDevice_ResponseParams_Data>;

  Adapter_ConnectToDevice_ResponseParams_Data();
  ~Adapter_ConnectToDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_ConnectToDevice_ResponseParams_Data) == 24,
              "Bad sizeof(Adapter_ConnectToDevice_ResponseParams_Data)");
class  Adapter_GetDevices_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Adapter_GetDevices_Params_Data>;

  Adapter_GetDevices_Params_Data();
  ~Adapter_GetDevices_Params_Data() = delete;
};
static_assert(sizeof(Adapter_GetDevices_Params_Data) == 8,
              "Bad sizeof(Adapter_GetDevices_Params_Data)");
class  Adapter_GetDevices_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::bluetooth::mojom::internal::DeviceInfo_Data>>> devices;

 private:
  friend class mojo::internal::MessageFragment<Adapter_GetDevices_ResponseParams_Data>;

  Adapter_GetDevices_ResponseParams_Data();
  ~Adapter_GetDevices_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_GetDevices_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_GetDevices_ResponseParams_Data)");
class  Adapter_GetInfo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Adapter_GetInfo_Params_Data>;

  Adapter_GetInfo_Params_Data();
  ~Adapter_GetInfo_Params_Data() = delete;
};
static_assert(sizeof(Adapter_GetInfo_Params_Data) == 8,
              "Bad sizeof(Adapter_GetInfo_Params_Data)");
class  Adapter_GetInfo_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::AdapterInfo_Data> info;

 private:
  friend class mojo::internal::MessageFragment<Adapter_GetInfo_ResponseParams_Data>;

  Adapter_GetInfo_ResponseParams_Data();
  ~Adapter_GetInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_GetInfo_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_GetInfo_ResponseParams_Data)");
class  Adapter_AddObserver_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data observer;

 private:
  friend class mojo::internal::MessageFragment<Adapter_AddObserver_Params_Data>;

  Adapter_AddObserver_Params_Data();
  ~Adapter_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(Adapter_AddObserver_Params_Data) == 16,
              "Bad sizeof(Adapter_AddObserver_Params_Data)");
class  Adapter_AddObserver_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Adapter_AddObserver_ResponseParams_Data>;

  Adapter_AddObserver_ResponseParams_Data();
  ~Adapter_AddObserver_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_AddObserver_ResponseParams_Data) == 8,
              "Bad sizeof(Adapter_AddObserver_ResponseParams_Data)");
class  Adapter_RegisterAdvertisement_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::bluetooth::mojom::internal::UUID_Data> service_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> service_data;
  uint8_t use_scan_response : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<Adapter_RegisterAdvertisement_Params_Data>;

  Adapter_RegisterAdvertisement_Params_Data();
  ~Adapter_RegisterAdvertisement_Params_Data() = delete;
};
static_assert(sizeof(Adapter_RegisterAdvertisement_Params_Data) == 32,
              "Bad sizeof(Adapter_RegisterAdvertisement_Params_Data)");
class  Adapter_RegisterAdvertisement_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data advertisement;

 private:
  friend class mojo::internal::MessageFragment<Adapter_RegisterAdvertisement_ResponseParams_Data>;

  Adapter_RegisterAdvertisement_ResponseParams_Data();
  ~Adapter_RegisterAdvertisement_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_RegisterAdvertisement_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_RegisterAdvertisement_ResponseParams_Data)");
class  Adapter_SetDiscoverable_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t discoverable : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<Adapter_SetDiscoverable_Params_Data>;

  Adapter_SetDiscoverable_Params_Data();
  ~Adapter_SetDiscoverable_Params_Data() = delete;
};
static_assert(sizeof(Adapter_SetDiscoverable_Params_Data) == 16,
              "Bad sizeof(Adapter_SetDiscoverable_Params_Data)");
class  Adapter_SetDiscoverable_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<Adapter_SetDiscoverable_ResponseParams_Data>;

  Adapter_SetDiscoverable_ResponseParams_Data();
  ~Adapter_SetDiscoverable_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_SetDiscoverable_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_SetDiscoverable_ResponseParams_Data)");
class  Adapter_SetName_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;

 private:
  friend class mojo::internal::MessageFragment<Adapter_SetName_Params_Data>;

  Adapter_SetName_Params_Data();
  ~Adapter_SetName_Params_Data() = delete;
};
static_assert(sizeof(Adapter_SetName_Params_Data) == 16,
              "Bad sizeof(Adapter_SetName_Params_Data)");
class  Adapter_SetName_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<Adapter_SetName_ResponseParams_Data>;

  Adapter_SetName_ResponseParams_Data();
  ~Adapter_SetName_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_SetName_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_SetName_ResponseParams_Data)");
class  Adapter_StartDiscoverySession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> client_name;

 private:
  friend class mojo::internal::MessageFragment<Adapter_StartDiscoverySession_Params_Data>;

  Adapter_StartDiscoverySession_Params_Data();
  ~Adapter_StartDiscoverySession_Params_Data() = delete;
};
static_assert(sizeof(Adapter_StartDiscoverySession_Params_Data) == 16,
              "Bad sizeof(Adapter_StartDiscoverySession_Params_Data)");
class  Adapter_StartDiscoverySession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data session;

 private:
  friend class mojo::internal::MessageFragment<Adapter_StartDiscoverySession_ResponseParams_Data>;

  Adapter_StartDiscoverySession_ResponseParams_Data();
  ~Adapter_StartDiscoverySession_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_StartDiscoverySession_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_StartDiscoverySession_ResponseParams_Data)");
class  Adapter_ConnectToServiceInsecurely_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> address;
  mojo::internal::Pointer<::bluetooth::mojom::internal::UUID_Data> service_uuid;

 private:
  friend class mojo::internal::MessageFragment<Adapter_ConnectToServiceInsecurely_Params_Data>;

  Adapter_ConnectToServiceInsecurely_Params_Data();
  ~Adapter_ConnectToServiceInsecurely_Params_Data() = delete;
};
static_assert(sizeof(Adapter_ConnectToServiceInsecurely_Params_Data) == 24,
              "Bad sizeof(Adapter_ConnectToServiceInsecurely_Params_Data)");
class  Adapter_ConnectToServiceInsecurely_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ConnectToServiceResult_Data> result;

 private:
  friend class mojo::internal::MessageFragment<Adapter_ConnectToServiceInsecurely_ResponseParams_Data>;

  Adapter_ConnectToServiceInsecurely_ResponseParams_Data();
  ~Adapter_ConnectToServiceInsecurely_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_ConnectToServiceInsecurely_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_ConnectToServiceInsecurely_ResponseParams_Data)");
class  Adapter_CreateRfcommServiceInsecurely_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_name;
  mojo::internal::Pointer<::bluetooth::mojom::internal::UUID_Data> service_uuid;

 private:
  friend class mojo::internal::MessageFragment<Adapter_CreateRfcommServiceInsecurely_Params_Data>;

  Adapter_CreateRfcommServiceInsecurely_Params_Data();
  ~Adapter_CreateRfcommServiceInsecurely_Params_Data() = delete;
};
static_assert(sizeof(Adapter_CreateRfcommServiceInsecurely_Params_Data) == 24,
              "Bad sizeof(Adapter_CreateRfcommServiceInsecurely_Params_Data)");
class  Adapter_CreateRfcommServiceInsecurely_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data server_socket;

 private:
  friend class mojo::internal::MessageFragment<Adapter_CreateRfcommServiceInsecurely_ResponseParams_Data>;

  Adapter_CreateRfcommServiceInsecurely_ResponseParams_Data();
  ~Adapter_CreateRfcommServiceInsecurely_ResponseParams_Data() = delete;
};
static_assert(sizeof(Adapter_CreateRfcommServiceInsecurely_ResponseParams_Data) == 16,
              "Bad sizeof(Adapter_CreateRfcommServiceInsecurely_ResponseParams_Data)");
class  AdapterObserver_PresentChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t present : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_PresentChanged_Params_Data>;

  AdapterObserver_PresentChanged_Params_Data();
  ~AdapterObserver_PresentChanged_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_PresentChanged_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_PresentChanged_Params_Data)");
class  AdapterObserver_PoweredChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t powered : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_PoweredChanged_Params_Data>;

  AdapterObserver_PoweredChanged_Params_Data();
  ~AdapterObserver_PoweredChanged_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_PoweredChanged_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_PoweredChanged_Params_Data)");
class  AdapterObserver_DiscoverableChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t discoverable : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_DiscoverableChanged_Params_Data>;

  AdapterObserver_DiscoverableChanged_Params_Data();
  ~AdapterObserver_DiscoverableChanged_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_DiscoverableChanged_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_DiscoverableChanged_Params_Data)");
class  AdapterObserver_DiscoveringChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t discovering : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_DiscoveringChanged_Params_Data>;

  AdapterObserver_DiscoveringChanged_Params_Data();
  ~AdapterObserver_DiscoveringChanged_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_DiscoveringChanged_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_DiscoveringChanged_Params_Data)");
class  AdapterObserver_DeviceAdded_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::bluetooth::mojom::internal::DeviceInfo_Data> device;

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_DeviceAdded_Params_Data>;

  AdapterObserver_DeviceAdded_Params_Data();
  ~AdapterObserver_DeviceAdded_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_DeviceAdded_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_DeviceAdded_Params_Data)");
class  AdapterObserver_DeviceChanged_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::bluetooth::mojom::internal::DeviceInfo_Data> device;

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_DeviceChanged_Params_Data>;

  AdapterObserver_DeviceChanged_Params_Data();
  ~AdapterObserver_DeviceChanged_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_DeviceChanged_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_DeviceChanged_Params_Data)");
class  AdapterObserver_DeviceRemoved_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::bluetooth::mojom::internal::DeviceInfo_Data> device;

 private:
  friend class mojo::internal::MessageFragment<AdapterObserver_DeviceRemoved_Params_Data>;

  AdapterObserver_DeviceRemoved_Params_Data();
  ~AdapterObserver_DeviceRemoved_Params_Data() = delete;
};
static_assert(sizeof(AdapterObserver_DeviceRemoved_Params_Data) == 16,
              "Bad sizeof(AdapterObserver_DeviceRemoved_Params_Data)");

}  // namespace internal


class Advertisement_Unregister_ParamsDataView {
 public:
  Advertisement_Unregister_ParamsDataView() = default;

  Advertisement_Unregister_ParamsDataView(
      internal::Advertisement_Unregister_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::Advertisement_Unregister_Params_Data* data_ = nullptr;
};



class Advertisement_Unregister_ResponseParamsDataView {
 public:
  Advertisement_Unregister_ResponseParamsDataView() = default;

  Advertisement_Unregister_ResponseParamsDataView(
      internal::Advertisement_Unregister_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::Advertisement_Unregister_ResponseParams_Data* data_ = nullptr;
};



