// device/bluetooth/public/mojom/device.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef DEVICE_BLUETOOTH_PUBLIC_MOJOM_DEVICE_MOJOM_PARAMS_DATA_H_
#define DEVICE_BLUETOOTH_PUBLIC_MOJOM_DEVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace bluetooth {
namespace mojom {
namespace internal {

class ValidationContext;
class  Device_Disconnect_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Device_Disconnect_Params_Data>;

  Device_Disconnect_Params_Data();
  ~Device_Disconnect_Params_Data() = delete;
};
static_assert(sizeof(Device_Disconnect_Params_Data) == 8,
              "Bad sizeof(Device_Disconnect_Params_Data)");
class  Device_GetInfo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Device_GetInfo_Params_Data>;

  Device_GetInfo_Params_Data();
  ~Device_GetInfo_Params_Data() = delete;
};
static_assert(sizeof(Device_GetInfo_Params_Data) == 8,
              "Bad sizeof(Device_GetInfo_Params_Data)");
class  Device_GetInfo_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::DeviceInfo_Data> info;

 private:
  friend class mojo::internal::MessageFragment<Device_GetInfo_ResponseParams_Data>;

  Device_GetInfo_ResponseParams_Data();
  ~Device_GetInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_GetInfo_ResponseParams_Data) == 16,
              "Bad sizeof(Device_GetInfo_ResponseParams_Data)");
class  Device_GetServices_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Device_GetServices_Params_Data>;

  Device_GetServices_Params_Data();
  ~Device_GetServices_Params_Data() = delete;
};
static_assert(sizeof(Device_GetServices_Params_Data) == 8,
              "Bad sizeof(Device_GetServices_Params_Data)");
class  Device_GetServices_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ServiceInfo_Data>>> services;

 private:
  friend class mojo::internal::MessageFragment<Device_GetServices_ResponseParams_Data>;

  Device_GetServices_ResponseParams_Data();
  ~Device_GetServices_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_GetServices_ResponseParams_Data) == 16,
              "Bad sizeof(Device_GetServices_ResponseParams_Data)");
class  Device_GetCharacteristics_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_id;

 private:
  friend class mojo::internal::MessageFragment<Device_GetCharacteristics_Params_Data>;

  Device_GetCharacteristics_Params_Data();
  ~Device_GetCharacteristics_Params_Data() = delete;
};
static_assert(sizeof(Device_GetCharacteristics_Params_Data) == 16,
              "Bad sizeof(Device_GetCharacteristics_Params_Data)");
class  Device_GetCharacteristics_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CharacteristicInfo_Data>>> characteristics;

 private:
  friend class mojo::internal::MessageFragment<Device_GetCharacteristics_ResponseParams_Data>;

  Device_GetCharacteristics_ResponseParams_Data();
  ~Device_GetCharacteristics_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_GetCharacteristics_ResponseParams_Data) == 16,
              "Bad sizeof(Device_GetCharacteristics_ResponseParams_Data)");
class  Device_ReadValueForCharacteristic_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_id;
  mojo::internal::Pointer<mojo::internal::String_Data> characteristic_id;

 private:
  friend class mojo::internal::MessageFragment<Device_ReadValueForCharacteristic_Params_Data>;

  Device_ReadValueForCharacteristic_Params_Data();
  ~Device_ReadValueForCharacteristic_Params_Data() = delete;
};
static_assert(sizeof(Device_ReadValueForCharacteristic_Params_Data) == 24,
              "Bad sizeof(Device_ReadValueForCharacteristic_Params_Data)");
class  Device_ReadValueForCharacteristic_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;

 private:
  friend class mojo::internal::MessageFragment<Device_ReadValueForCharacteristic_ResponseParams_Data>;

  Device_ReadValueForCharacteristic_ResponseParams_Data();
  ~Device_ReadValueForCharacteristic_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_ReadValueForCharacteristic_ResponseParams_Data) == 24,
              "Bad sizeof(Device_ReadValueForCharacteristic_ResponseParams_Data)");
class  Device_WriteValueForCharacteristic_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_id;
  mojo::internal::Pointer<mojo::internal::String_Data> characteristic_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;

 private:
  friend class mojo::internal::MessageFragment<Device_WriteValueForCharacteristic_Params_Data>;

  Device_WriteValueForCharacteristic_Params_Data();
  ~Device_WriteValueForCharacteristic_Params_Data() = delete;
};
static_assert(sizeof(Device_WriteValueForCharacteristic_Params_Data) == 32,
              "Bad sizeof(Device_WriteValueForCharacteristic_Params_Data)");
class  Device_WriteValueForCharacteristic_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Device_WriteValueForCharacteristic_ResponseParams_Data>;

  Device_WriteValueForCharacteristic_ResponseParams_Data();
  ~Device_WriteValueForCharacteristic_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_WriteValueForCharacteristic_ResponseParams_Data) == 16,
              "Bad sizeof(Device_WriteValueForCharacteristic_ResponseParams_Data)");
class  Device_GetDescriptors_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_id;
  mojo::internal::Pointer<mojo::internal::String_Data> characteristic_id;

 private:
  friend class mojo::internal::MessageFragment<Device_GetDescriptors_Params_Data>;

  Device_GetDescriptors_Params_Data();
  ~Device_GetDescriptors_Params_Data() = delete;
};
static_assert(sizeof(Device_GetDescriptors_Params_Data) == 24,
              "Bad sizeof(Device_GetDescriptors_Params_Data)");
class  Device_GetDescriptors_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::DescriptorInfo_Data>>> descriptors;

 private:
  friend class mojo::internal::MessageFragment<Device_GetDescriptors_ResponseParams_Data>;

  Device_GetDescriptors_ResponseParams_Data();
  ~Device_GetDescriptors_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_GetDescriptors_ResponseParams_Data) == 16,
              "Bad sizeof(Device_GetDescriptors_ResponseParams_Data)");
class  Device_ReadValueForDescriptor_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_id;
  mojo::internal::Pointer<mojo::internal::String_Data> characteristic_id;
  mojo::internal::Pointer<mojo::internal::String_Data> descriptor_id;

 private:
  friend class mojo::internal::MessageFragment<Device_ReadValueForDescriptor_Params_Data>;

  Device_ReadValueForDescriptor_Params_Data();
  ~Device_ReadValueForDescriptor_Params_Data() = delete;
};
static_assert(sizeof(Device_ReadValueForDescriptor_Params_Data) == 32,
              "Bad sizeof(Device_ReadValueForDescriptor_Params_Data)");
class  Device_ReadValueForDescriptor_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;

 private:
  friend class mojo::internal::MessageFragment<Device_ReadValueForDescriptor_ResponseParams_Data>;

  Device_ReadValueForDescriptor_ResponseParams_Data();
  ~Device_ReadValueForDescriptor_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_ReadValueForDescriptor_ResponseParams_Data) == 24,
              "Bad sizeof(Device_ReadValueForDescriptor_ResponseParams_Data)");
class  Device_WriteValueForDescriptor_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> service_id;
  mojo::internal::Pointer<mojo::internal::String_Data> characteristic_id;
  mojo::internal::Pointer<mojo::internal::String_Data> descriptor_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;

 private:
  friend class mojo::internal::MessageFragment<Device_WriteValueForDescriptor_Params_Data>;

  Device_WriteValueForDescriptor_Params_Data();
  ~Device_WriteValueForDescriptor_Params_Data() = delete;
};
static_assert(sizeof(Device_WriteValueForDescriptor_Params_Data) == 40,
              "Bad sizeof(Device_WriteValueForDescriptor_Params_Data)");
class  Device_WriteValueForDescriptor_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Device_WriteValueForDescriptor_ResponseParams_Data>;

  Device_WriteValueForDescriptor_ResponseParams_Data();
  ~Device_WriteValueForDescriptor_ResponseParams_Data() = delete;
};
static_assert(sizeof(Device_WriteValueForDescriptor_ResponseParams_Data) == 16,
              "Bad sizeof(Device_WriteValueForDescriptor_ResponseParams_Data)");

}  // namespace internal


class Device_Disconnect_ParamsDataView {
 public:
  Device_Disconnect_ParamsDataView() = default;

  Device_Disconnect_ParamsDataView(
      internal::Device_Disconnect_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::Device_Disconnect_Params_Data* data_ = nullptr;
};



class Device_GetInfo_ParamsDataView {
 public:
  Device_GetInfo_ParamsDataView() = default;

  Device_GetInfo_ParamsDataView(
      internal::Device_GetInfo_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::Device_GetInfo_Params_Data* data_ = nullptr;
};



class Device_GetInfo_ResponseParamsDataView {
 public:
  Device_GetInfo_ResponseParamsDataView() = default;

