// services/video_capture/public/mojom/video_source_provider.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIDEO_CAPTURE_PUBLIC_MOJOM_VIDEO_SOURCE_PROVIDER_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIDEO_CAPTURE_PUBLIC_MOJOM_VIDEO_SOURCE_PROVIDER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace video_capture {
namespace mojom {
namespace internal {

class ValidationContext;
class  VideoSourceProvider_GetSourceInfos_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_GetSourceInfos_Params_Data>;

  VideoSourceProvider_GetSourceInfos_Params_Data();
  ~VideoSourceProvider_GetSourceInfos_Params_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_GetSourceInfos_Params_Data) == 8,
              "Bad sizeof(VideoSourceProvider_GetSourceInfos_Params_Data)");
class  VideoSourceProvider_GetSourceInfos_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::media::mojom::internal::VideoCaptureDeviceInfo_Data>>> source_infos;

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_GetSourceInfos_ResponseParams_Data>;

  VideoSourceProvider_GetSourceInfos_ResponseParams_Data();
  ~VideoSourceProvider_GetSourceInfos_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_GetSourceInfos_ResponseParams_Data) == 16,
              "Bad sizeof(VideoSourceProvider_GetSourceInfos_ResponseParams_Data)");
class  VideoSourceProvider_GetVideoSource_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> source_id;
  mojo::internal::Handle_Data stream;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_GetVideoSource_Params_Data>;

  VideoSourceProvider_GetVideoSource_Params_Data();
  ~VideoSourceProvider_GetVideoSource_Params_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_GetVideoSource_Params_Data) == 24,
              "Bad sizeof(VideoSourceProvider_GetVideoSource_Params_Data)");
class  VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::media::mojom::internal::VideoCaptureDeviceInfo_Data> device_info;
  mojo::internal::Interface_Data producer;
  uint8_t send_buffer_handles_to_producer_as_raw_file_descriptors : 1;
  uint8_t pad2_[3];
  mojo::internal::Handle_Data virtual_device_receiver;

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data>;

  VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data();
  ~VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data) == 32,
              "Bad sizeof(VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data)");
class  VideoSourceProvider_AddTextureVirtualDevice_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::media::mojom::internal::VideoCaptureDeviceInfo_Data> device_info;
  mojo::internal::Handle_Data virtual_device_receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_AddTextureVirtualDevice_Params_Data>;

  VideoSourceProvider_AddTextureVirtualDevice_Params_Data();
  ~VideoSourceProvider_AddTextureVirtualDevice_Params_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_AddTextureVirtualDevice_Params_Data) == 24,
              "Bad sizeof(VideoSourceProvider_AddTextureVirtualDevice_Params_Data)");
class  VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data observer;
  uint8_t raise_event_if_virtual_devices_already_present : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data>;

  VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data();
  ~VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data) == 24,
              "Bad sizeof(VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data)");
class  VideoSourceProvider_Close_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_Close_Params_Data>;

  VideoSourceProvider_Close_Params_Data();
  ~VideoSourceProvider_Close_Params_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_Close_Params_Data) == 8,
              "Bad sizeof(VideoSourceProvider_Close_Params_Data)");
class  VideoSourceProvider_Close_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<VideoSourceProvider_Close_ResponseParams_Data>;

  VideoSourceProvider_Close_ResponseParams_Data();
  ~VideoSourceProvider_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoSourceProvider_Close_ResponseParams_Data) == 8,
              "Bad sizeof(VideoSourceProvider_Close_ResponseParams_Data)");

}  // namespace internal


class VideoSourceProvider_GetSourceInfos_ParamsDataView {
 public:
  VideoSourceProvider_GetSourceInfos_ParamsDataView() = default;

  VideoSourceProvider_GetSourceInfos_ParamsDataView(
      internal::VideoSourceProvider_GetSourceInfos_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::VideoSourceProvider_GetSourceInfos_Params_Data* data_ = nullptr;
};



class VideoSourceProvider_GetSourceInfos_ResponseParamsDataView {
 public:
  VideoSourceProvider_GetSourceInfos_ResponseParamsDataView() = default;

  VideoSourceProvider_GetSourceInfos_ResponseParamsDataView(
      internal::VideoSourceProvider_GetSourceInfos_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSourceInfosDataView(
      mojo::ArrayDataView<::media::mojom::VideoCaptureDeviceInfoDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSourceInfos(UserType* output) {
    
    auto* pointer = data_->source_infos.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::media::mojom::VideoCaptureDeviceInfoDataView>>(
        pointer, output, message_);
  }
 private:
  internal::VideoSourceProvider_GetSourceInfos_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class VideoSourceProvider_GetVideoSource_ParamsDataView {
 public:
  VideoSourceProvider_GetVideoSource_ParamsDataView() = default;

  VideoSourceProvider_GetVideoSource_ParamsDataView(
      internal::VideoSourceProvider_GetVideoSource_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSourceIdDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSourceId(UserType* output) {
    
    auto* pointer = data_->source_id.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
  template <typename UserType>
  UserType TakeStream() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::video_capture::mojom::VideoSourceInterfaceBase>>(
            &data_->stream, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::VideoSourceProvider_GetVideoSource_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class VideoSourceProvider_AddSharedMemoryVirtualDevice_ParamsDataView {
 public:
  VideoSourceProvider_AddSharedMemoryVirtualDevice_ParamsDataView() = default;

  VideoSourceProvider_AddSharedMemoryVirtualDevice_ParamsDataView(
      internal::VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetDeviceInfoDataView(
      ::media::mojom::VideoCaptureDeviceInfoDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadDeviceInfo(UserType* output) {
    
    auto* pointer = data_->device_info.Get();
    return mojo::internal::Deserialize<::media::mojom::VideoCaptureDeviceInfoDataView>(
        pointer, output, message_);
  }
  template <typename UserType>
  UserType TakeProducer() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::video_capture::mojom::ProducerInterfaceBase>>(
            &data_->producer, &result, message_);
    DCHECK(ret);
    return result;
  }
  bool send_buffer_handles_to_producer_as_raw_file_descriptors() const {
    return data_->send_buffer_handles_to_producer_as_raw_file_descriptors;
  }
  template <typename UserType>
  UserType TakeVirtualDeviceReceiver() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::video_capture::mojom::SharedMemoryVirtualDeviceInterfaceBase>>(
            &data_->virtual_device_receiver, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::VideoSourceProvider_AddSharedMemoryVirtualDevice_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class VideoSourceProvider_AddTextureVirtualDevice_ParamsDataView {
 public:
  VideoSourceProvider_AddTextureVirtualDevice_ParamsDataView() = default;

  VideoSourceProvider_AddTextureVirtualDevice_ParamsDataView(
      internal::VideoSourceProvider_AddTextureVirtualDevice_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetDeviceInfoDataView(
      ::media::mojom::VideoCaptureDeviceInfoDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadDeviceInfo(UserType* output) {
    
    auto* pointer = data_->device_info.Get();
    return mojo::internal::Deserialize<::media::mojom::VideoCaptureDeviceInfoDataView>(
        pointer, output, message_);
  }
  template <typename UserType>
  UserType TakeVirtualDeviceReceiver() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::video_capture::mojom::TextureVirtualDeviceInterfaceBase>>(
            &data_->virtual_device_receiver, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::VideoSourceProvider_AddTextureVirtualDevice_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class VideoSourceProvider_RegisterVirtualDevicesChangedObserver_ParamsDataView {
 public:
  VideoSourceProvider_RegisterVirtualDevicesChangedObserver_ParamsDataView() = default;

  VideoSourceProvider_RegisterVirtualDevicesChangedObserver_ParamsDataView(
      internal::VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeObserver() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::video_capture::mojom::DevicesChangedObserverInterfaceBase>>(
            &data_->observer, &result, message_);
    DCHECK(ret);
    return result;
  }
  bool raise_event_if_virtual_devices_already_present() const {
    return data_->raise_event_if_virtual_devices_already_present;
  }
 private:
  internal::VideoSourceProvider_RegisterVirtualDevicesChangedObserver_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class VideoSourceProvider_Close_ParamsDataView {
 public:
  VideoSourceProvider_Close_ParamsDataView() = default;

  VideoSourceProvider_Close_ParamsDataView(
      internal::VideoSourceProvider_Close_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::VideoSourceProvider_Close_Params_Data* data_ = nullptr;
};



class VideoSourceProvider_Close_ResponseParamsDataView {
 public:
  VideoSourceProvider_Close_ResponseParamsDataView() = default;

  VideoSourceProvider_Close_ResponseParamsDataView(
      internal::VideoSourceProvider_Close_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::VideoSourceProvider_Close_ResponseParams_Data* data_ = nullptr;
};




inline void VideoSourceProvider_GetSourceInfos_ResponseParamsDataView::GetSourceInfosDataView(
    mojo::ArrayDataView<::media::mojom::VideoCaptureDeviceInfoDataView>* output) {
  auto pointer = data_->source_infos.Get();
  *output = mojo::ArrayDataView<::media::mojom::VideoCaptureDeviceInfoDataView>(pointer, message_);
}


inline void VideoSourceProvider_GetVideoSource_ParamsDataView::GetSourceIdDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->source_id.Get();
  *output = mojo::StringDataView(pointer, message_);
}


inline void VideoSourceProvider_AddSharedMemoryVirtualDevice_ParamsDataView::GetDeviceInfoDataView(
    ::media::mojom::VideoCaptureDeviceInfoDataView* output) {
  auto pointer = data_->device_info.Get();
  *output = ::media::mojom::VideoCaptureDeviceInfoDataView(pointer, message_);
}


inline void VideoSourceProvider_AddTextureVirtualDevice_ParamsDataView::GetDeviceInfoDataView(
    ::media::mojom::VideoCaptureDeviceInfoDataView* output) {
  auto pointer = data_->device_info.Get();
  *output = ::media::mojom::VideoCaptureDeviceInfoDataView(pointer, message_);
}







}  // namespace mojom
}  // namespace video_capture

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // SERVICES_VIDEO_CAPTURE_PUBLIC_MOJOM_VIDEO_SOURCE_PROVIDER_MOJOM_PARAMS_DATA_H_