// media/mojo/mojom/media_drm_storage.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_MEDIA_DRM_STORAGE_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_MEDIA_DRM_STORAGE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace media {
namespace mojom {
namespace internal {

class ValidationContext;
class  MediaDrmStorage_Initialize_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_Initialize_Params_Data>;

  MediaDrmStorage_Initialize_Params_Data();
  ~MediaDrmStorage_Initialize_Params_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_Initialize_Params_Data) == 8,
              "Bad sizeof(MediaDrmStorage_Initialize_Params_Data)");
class  MediaDrmStorage_Initialize_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> origin_id;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_Initialize_ResponseParams_Data>;

  MediaDrmStorage_Initialize_ResponseParams_Data();
  ~MediaDrmStorage_Initialize_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_Initialize_ResponseParams_Data) == 24,
              "Bad sizeof(MediaDrmStorage_Initialize_ResponseParams_Data)");
class  MediaDrmStorage_OnProvisioned_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_OnProvisioned_Params_Data>;

  MediaDrmStorage_OnProvisioned_Params_Data();
  ~MediaDrmStorage_OnProvisioned_Params_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_OnProvisioned_Params_Data) == 8,
              "Bad sizeof(MediaDrmStorage_OnProvisioned_Params_Data)");
class  MediaDrmStorage_OnProvisioned_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_OnProvisioned_ResponseParams_Data>;

  MediaDrmStorage_OnProvisioned_ResponseParams_Data();
  ~MediaDrmStorage_OnProvisioned_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_OnProvisioned_ResponseParams_Data) == 16,
              "Bad sizeof(MediaDrmStorage_OnProvisioned_ResponseParams_Data)");
class  MediaDrmStorage_SavePersistentSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> session_id;
  mojo::internal::Pointer<internal::SessionData_Data> session_data;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_SavePersistentSession_Params_Data>;

  MediaDrmStorage_SavePersistentSession_Params_Data();
  ~MediaDrmStorage_SavePersistentSession_Params_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_SavePersistentSession_Params_Data) == 24,
              "Bad sizeof(MediaDrmStorage_SavePersistentSession_Params_Data)");
class  MediaDrmStorage_SavePersistentSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_SavePersistentSession_ResponseParams_Data>;

  MediaDrmStorage_SavePersistentSession_ResponseParams_Data();
  ~MediaDrmStorage_SavePersistentSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_SavePersistentSession_ResponseParams_Data) == 16,
              "Bad sizeof(MediaDrmStorage_SavePersistentSession_ResponseParams_Data)");
class  MediaDrmStorage_LoadPersistentSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> session_id;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_LoadPersistentSession_Params_Data>;

  MediaDrmStorage_LoadPersistentSession_Params_Data();
  ~MediaDrmStorage_LoadPersistentSession_Params_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_LoadPersistentSession_Params_Data) == 16,
              "Bad sizeof(MediaDrmStorage_LoadPersistentSession_Params_Data)");
class  MediaDrmStorage_LoadPersistentSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SessionData_Data> session_data;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_LoadPersistentSession_ResponseParams_Data>;

  MediaDrmStorage_LoadPersistentSession_ResponseParams_Data();
  ~MediaDrmStorage_LoadPersistentSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_LoadPersistentSession_ResponseParams_Data) == 16,
              "Bad sizeof(MediaDrmStorage_LoadPersistentSession_ResponseParams_Data)");
class  MediaDrmStorage_RemovePersistentSession_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> session_id;

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_RemovePersistentSession_Params_Data>;

  MediaDrmStorage_RemovePersistentSession_Params_Data();
  ~MediaDrmStorage_RemovePersistentSession_Params_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_RemovePersistentSession_Params_Data) == 16,
              "Bad sizeof(MediaDrmStorage_RemovePersistentSession_Params_Data)");
class  MediaDrmStorage_RemovePersistentSession_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<MediaDrmStorage_RemovePersistentSession_ResponseParams_Data>;

  MediaDrmStorage_RemovePersistentSession_ResponseParams_Data();
  ~MediaDrmStorage_RemovePersistentSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDrmStorage_RemovePersistentSession_ResponseParams_Data) == 16,
              "Bad sizeof(MediaDrmStorage_RemovePersistentSession_ResponseParams_Data)");

}  // namespace internal


class MediaDrmStorage_Initialize_ParamsDataView {
 public:
  MediaDrmStorage_Initialize_ParamsDataView() = default;

  MediaDrmStorage_Initialize_ParamsDataView(
      internal::MediaDrmStorage_Initialize_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::MediaDrmStorage_Initialize_Params_Data* data_ = nullptr;
};



class MediaDrmStorage_Initialize_ResponseParamsDataView {
 public:
  MediaDrmStorage_Initialize_ResponseParamsDataView() = default;

  MediaDrmStorage_Initialize_ResponseParamsDataView(
      internal::MediaDrmStorage_Initialize_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  bool success() const {
    return data_->success;
  }
  inline void GetOriginIdDataView(
      ::mojo_base::mojom::UnguessableTokenDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadOriginId(UserType* output) {
    
static_assert(
    mojo::internal::IsValidUserTypeForOptionalValue<
        ::mojo_base::mojom::UnguessableTokenDataView, UserType>(),
    "Attempting to read the optional `origin_id` field into a type which "
    "cannot represent a null value. Either wrap the destination object "
    "with absl::optional, ensure that any corresponding "
    "{Struct/Union/Array/String}Traits define the necessary IsNull and "
    "SetToNull methods, or use `MaybeReadOriginId` instead "
    "of `ReadOriginId if you're fine with null values being "
    "silently ignored in this case.");
    auto* pointer = data_->origin_id.Get();
    return mojo::internal::Deserialize<::mojo_base::mojom::UnguessableTokenDataView>(
        pointer, output, message_);
  }
 private:
  internal::MediaDrmStorage_Initialize_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaDrmStorage_OnProvisioned_ParamsDataView {
 public:
  MediaDrmStorage_OnProvisioned_ParamsDataView() = default;

  MediaDrmStorage_OnProvisioned_ParamsDataView(
      internal::MediaDrmStorage_OnProvisioned_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::MediaDrmStorage_OnProvisioned_Params_Data* data_ = nullptr;
};



class MediaDrmStorage_OnProvisioned_ResponseParamsDataView {
 public:
  MediaDrmStorage_OnProvisioned_ResponseParamsDataView() = default;

  MediaDrmStorage_OnProvisioned_ResponseParamsDataView(
      internal::MediaDrmStorage_OnProvisioned_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool success() const {
    return data_->success;
  }
 private:
  internal::MediaDrmStorage_OnProvisioned_ResponseParams_Data* data_ = nullptr;
};



class MediaDrmStorage_SavePersistentSession_ParamsDataView {
 public:
  MediaDrmStorage_SavePersistentSession_ParamsDataView() = default;

  MediaDrmStorage_SavePersistentSession_ParamsDataView(
      internal::MediaDrmStorage_SavePersistentSession_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSessionIdDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSessionId(UserType* output) {
    
    auto* pointer = data_->session_id.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
  inline void GetSessionDataDataView(
      SessionDataDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSessionData(UserType* output) {
    
    auto* pointer = data_->session_data.Get();
    return mojo::internal::Deserialize<::media::mojom::SessionDataDataView>(
        pointer, output, message_);
  }
 private:
  internal::MediaDrmStorage_SavePersistentSession_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaDrmStorage_SavePersistentSession_ResponseParamsDataView {
 public:
  MediaDrmStorage_SavePersistentSession_ResponseParamsDataView() = default;

  MediaDrmStorage_SavePersistentSession_ResponseParamsDataView(
      internal::MediaDrmStorage_SavePersistentSession_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool success() const {
    return data_->success;
  }
 private:
  internal::MediaDrmStorage_SavePersistentSession_ResponseParams_Data* data_ = nullptr;
};



class MediaDrmStorage_LoadPersistentSession_ParamsDataView {
 public:
  MediaDrmStorage_LoadPersistentSession_ParamsDataView() = default;

  MediaDrmStorage_LoadPersistentSession_ParamsDataView(
      internal::MediaDrmStorage_LoadPersistentSession_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSessionIdDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSessionId(UserType* output) {
    
    auto* pointer = data_->session_id.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::MediaDrmStorage_LoadPersistentSession_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaDrmStorage_LoadPersistentSession_ResponseParamsDataView {
 public:
  MediaDrmStorage_LoadPersistentSession_ResponseParamsDataView() = default;

  MediaDrmStorage_LoadPersistentSession_ResponseParamsDataView(
      internal::MediaDrmStorage_LoadPersistentSession_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSessionDataDataView(
      SessionDataDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSessionData(UserType* output) {
    
static_assert(
    mojo::internal::IsValidUserTypeForOptionalValue<
        ::media::mojom::SessionDataDataView, UserType>(),
    "Attempting to read the optional `session_data` field into a type which "
    "cannot represent a null value. Either wrap the destination object "
    "with absl::optional, ensure that any corresponding "
    "{Struct/Union/Array/String}Traits define the necessary IsNull and "
    "SetToNull methods, or use `MaybeReadSessionData` instead "
    "of `ReadSessionData if you're fine with null values being "
    "silently ignored in this case.");
    auto* pointer = data_->session_data.Get();
    return mojo::internal::Deserialize<::media::mojom::SessionDataDataView>(
        pointer, output, message_);
  }
 private:
  internal::MediaDrmStorage_LoadPersistentSession_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaDrmStorage_RemovePersistentSession_ParamsDataView {
 public:
  MediaDrmStorage_RemovePersistentSession_ParamsDataView() = default;

  MediaDrmStorage_RemovePersistentSession_ParamsDataView(
      internal::MediaDrmStorage_RemovePersistentSession_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSessionIdDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadSessionId(UserType* output) {
    
    auto* pointer = data_->session_id.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::MediaDrmStorage_RemovePersistentSession_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaDrmStorage_RemovePersistentSession_ResponseParamsDataView {
 public:
  MediaDrmStorage_RemovePersistentSession_ResponseParamsDataView() = default;

  MediaDrmStorage_RemovePersistentSession_ResponseParamsDataView(
      internal::MediaDrmStorage_RemovePersistentSession_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool success() const {
    return data_->success;
  }
 private:
  internal::MediaDrmStorage_RemovePersistentSession_ResponseParams_Data* data_ = nullptr;
};




inline void MediaDrmStorage_Initialize_ResponseParamsDataView::GetOriginIdDataView(
    ::mojo_base::mojom::UnguessableTokenDataView* output) {
  auto pointer = data_->origin_id.Get();
  *output = ::mojo_base::mojom::UnguessableTokenDataView(pointer, message_);
}






inline void MediaDrmStorage_SavePersistentSession_ParamsDataView::GetSessionIdDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->session_id.Get();
  *output = mojo::StringDataView(pointer, message_);
}
inline void MediaDrmStorage_SavePersistentSession_ParamsDataView::GetSessionDataDataView(
    SessionDataDataView* output) {
  auto pointer = data_->session_data.Get();
  *output = SessionDataDataView(pointer, message_);
}




inline void MediaDrmStorage_LoadPersistentSession_ParamsDataView::GetSessionIdDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->session_id.Get();
  *output = mojo::StringDataView(pointer, message_);
}


inline void MediaDrmStorage_LoadPersistentSession_ResponseParamsDataView::GetSessionDataDataView(
    SessionDataDataView* output) {
  auto pointer = data_->session_data.Get();
  *output = SessionDataDataView(pointer, message_);
}


inline void MediaDrmStorage_RemovePersistentSession_ParamsDataView::GetSessionIdDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->session_id.Get();
  *output = mojo::StringDataView(pointer, message_);
}



}  // namespace mojom
}  // namespace media

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // MEDIA_MOJO_MOJOM_MEDIA_DRM_STORAGE_MOJOM_PARAMS_DATA_H_