// gpu/ipc/common/gpu_channel.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef GPU_IPC_COMMON_GPU_CHANNEL_MOJOM_PARAMS_DATA_H_
#define GPU_IPC_COMMON_GPU_CHANNEL_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace gpu {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_CrashForTesting_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_CrashForTesting_Params_Data>;

  GpuChannel_CrashForTesting_Params_Data();
  ~GpuChannel_CrashForTesting_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_CrashForTesting_Params_Data) == 8,
              "Bad sizeof(GpuChannel_CrashForTesting_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_TerminateForTesting_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_TerminateForTesting_Params_Data>;

  GpuChannel_TerminateForTesting_Params_Data();
  ~GpuChannel_TerminateForTesting_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_TerminateForTesting_Params_Data) == 8,
              "Bad sizeof(GpuChannel_TerminateForTesting_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_GetChannelToken_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_GetChannelToken_Params_Data>;

  GpuChannel_GetChannelToken_Params_Data();
  ~GpuChannel_GetChannelToken_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_GetChannelToken_Params_Data) == 8,
              "Bad sizeof(GpuChannel_GetChannelToken_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_GetChannelToken_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> token;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_GetChannelToken_ResponseParams_Data>;

  GpuChannel_GetChannelToken_ResponseParams_Data();
  ~GpuChannel_GetChannelToken_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_GetChannelToken_ResponseParams_Data) == 16,
              "Bad sizeof(GpuChannel_GetChannelToken_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_Flush_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_Flush_Params_Data>;

  GpuChannel_Flush_Params_Data();
  ~GpuChannel_Flush_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_Flush_Params_Data) == 8,
              "Bad sizeof(GpuChannel_Flush_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_Flush_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_Flush_ResponseParams_Data>;

  GpuChannel_Flush_ResponseParams_Data();
  ~GpuChannel_Flush_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_Flush_ResponseParams_Data) == 8,
              "Bad sizeof(GpuChannel_Flush_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_CreateCommandBuffer_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CreateCommandBufferParams_Data> params;
  int32_t routing_id;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnsafeSharedMemoryRegion_Data> shared_state;
  mojo::internal::AssociatedInterface_Data client;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_CreateCommandBuffer_Params_Data>;

  GpuChannel_CreateCommandBuffer_Params_Data();
  ~GpuChannel_CreateCommandBuffer_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_CreateCommandBuffer_Params_Data) == 40,
              "Bad sizeof(GpuChannel_CreateCommandBuffer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_CreateCommandBuffer_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::gpu::mojom::internal::Capabilities_Data> capabilties;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_CreateCommandBuffer_ResponseParams_Data>;

  GpuChannel_CreateCommandBuffer_ResponseParams_Data();
  ~GpuChannel_CreateCommandBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_CreateCommandBuffer_ResponseParams_Data) == 24,
              "Bad sizeof(GpuChannel_CreateCommandBuffer_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_DestroyCommandBuffer_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t routing_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_DestroyCommandBuffer_Params_Data>;

  GpuChannel_DestroyCommandBuffer_Params_Data();
  ~GpuChannel_DestroyCommandBuffer_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_DestroyCommandBuffer_Params_Data) == 16,
              "Bad sizeof(GpuChannel_DestroyCommandBuffer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_DestroyCommandBuffer_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_DestroyCommandBuffer_ResponseParams_Data>;

  GpuChannel_DestroyCommandBuffer_ResponseParams_Data();
  ~GpuChannel_DestroyCommandBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_DestroyCommandBuffer_ResponseParams_Data) == 8,
              "Bad sizeof(GpuChannel_DestroyCommandBuffer_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_ScheduleImageDecode_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ScheduleImageDecodeParams_Data> params;
  uint64_t decode_release_count;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_ScheduleImageDecode_Params_Data>;

  GpuChannel_ScheduleImageDecode_Params_Data();
  ~GpuChannel_ScheduleImageDecode_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_ScheduleImageDecode_Params_Data) == 24,
              "Bad sizeof(GpuChannel_ScheduleImageDecode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_FlushDeferredRequests_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::DeferredRequest_Data>>> requests;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_FlushDeferredRequests_Params_Data>;

  GpuChannel_FlushDeferredRequests_Params_Data();
  ~GpuChannel_FlushDeferredRequests_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_FlushDeferredRequests_Params_Data) == 16,
              "Bad sizeof(GpuChannel_FlushDeferredRequests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_CreateStreamTexture_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t stream_id;
  mojo::internal::AssociatedEndpointHandle_Data receiver;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_CreateStreamTexture_Params_Data>;

  GpuChannel_CreateStreamTexture_Params_Data();
  ~GpuChannel_CreateStreamTexture_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_CreateStreamTexture_Params_Data) == 16,
              "Bad sizeof(GpuChannel_CreateStreamTexture_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_CreateStreamTexture_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_CreateStreamTexture_ResponseParams_Data>;

  GpuChannel_CreateStreamTexture_ResponseParams_Data();
  ~GpuChannel_CreateStreamTexture_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_CreateStreamTexture_ResponseParams_Data) == 16,
              "Bad sizeof(GpuChannel_CreateStreamTexture_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_WaitForTokenInRange_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t routing_id;
  int32_t start;
  int32_t end;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_WaitForTokenInRange_Params_Data>;

  GpuChannel_WaitForTokenInRange_Params_Data();
  ~GpuChannel_WaitForTokenInRange_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_WaitForTokenInRange_Params_Data) == 24,
              "Bad sizeof(GpuChannel_WaitForTokenInRange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_WaitForTokenInRange_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CommandBufferState_Data> state;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_WaitForTokenInRange_ResponseParams_Data>;

  GpuChannel_WaitForTokenInRange_ResponseParams_Data();
  ~GpuChannel_WaitForTokenInRange_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_WaitForTokenInRange_ResponseParams_Data) == 16,
              "Bad sizeof(GpuChannel_WaitForTokenInRange_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_WaitForGetOffsetInRange_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t routing_id;
  uint32_t set_get_buffer_count;
  int32_t start;
  int32_t end;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_WaitForGetOffsetInRange_Params_Data>;

  GpuChannel_WaitForGetOffsetInRange_Params_Data();
  ~GpuChannel_WaitForGetOffsetInRange_Params_Data() = delete;
};
static_assert(sizeof(GpuChannel_WaitForGetOffsetInRange_Params_Data) == 24,
              "Bad sizeof(GpuChannel_WaitForGetOffsetInRange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) GpuChannel_WaitForGetOffsetInRange_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CommandBufferState_Data> state;

 private:
  friend class mojo::internal::MessageFragment<GpuChannel_WaitForGetOffsetInRange_ResponseParams_Data>;

  GpuChannel_WaitForGetOffsetInRange_ResponseParams_Data();
  ~GpuChannel_WaitForGetOffsetInRange_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuChannel_WaitForGetOffsetInRange_ResponseParams_Data) == 16,
              "Bad sizeof(GpuChannel_WaitForGetOffsetInRange_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_SetGetBuffer_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t shm_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_SetGetBuffer_Params_Data>;

  CommandBuffer_SetGetBuffer_Params_Data();
  ~CommandBuffer_SetGetBuffer_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_SetGetBuffer_Params_Data) == 16,
              "Bad sizeof(CommandBuffer_SetGetBuffer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_RegisterTransferBuffer_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnsafeSharedMemoryRegion_Data> buffer;

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_RegisterTransferBuffer_Params_Data>;

  CommandBuffer_RegisterTransferBuffer_Params_Data();
  ~CommandBuffer_RegisterTransferBuffer_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_RegisterTransferBuffer_Params_Data) == 24,
              "Bad sizeof(CommandBuffer_RegisterTransferBuffer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_CreateGpuFenceFromHandle_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t gpu_fence_id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::gfx::mojom::internal::GpuFenceHandle_Data> fence_handle;

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_CreateGpuFenceFromHandle_Params_Data>;

  CommandBuffer_CreateGpuFenceFromHandle_Params_Data();
  ~CommandBuffer_CreateGpuFenceFromHandle_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_CreateGpuFenceFromHandle_Params_Data) == 24,
              "Bad sizeof(CommandBuffer_CreateGpuFenceFromHandle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_GetGpuFenceHandle_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_GetGpuFenceHandle_Params_Data>;

  CommandBuffer_GetGpuFenceHandle_Params_Data();
  ~CommandBuffer_GetGpuFenceHandle_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_GetGpuFenceHandle_Params_Data) == 16,
              "Bad sizeof(CommandBuffer_GetGpuFenceHandle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_GetGpuFenceHandle_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gfx::mojom::internal::GpuFenceHandle_Data> fence_handle;

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_GetGpuFenceHandle_ResponseParams_Data>;

  CommandBuffer_GetGpuFenceHandle_ResponseParams_Data();
  ~CommandBuffer_GetGpuFenceHandle_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommandBuffer_GetGpuFenceHandle_ResponseParams_Data) == 16,
              "Bad sizeof(CommandBuffer_GetGpuFenceHandle_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_SignalSyncToken_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> sync_token;
  uint32_t signal_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_SignalSyncToken_Params_Data>;

  CommandBuffer_SignalSyncToken_Params_Data();
  ~CommandBuffer_SignalSyncToken_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_SignalSyncToken_Params_Data) == 24,
              "Bad sizeof(CommandBuffer_SignalSyncToken_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_SignalQuery_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t query;
  uint32_t signal_id;

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_SignalQuery_Params_Data>;

  CommandBuffer_SignalQuery_Params_Data();
  ~CommandBuffer_SignalQuery_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_SignalQuery_Params_Data) == 16,
              "Bad sizeof(CommandBuffer_SignalQuery_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_BindMediaReceiver_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::GenericPendingAssociatedReceiver_Data> receiver;

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_BindMediaReceiver_Params_Data>;

  CommandBuffer_BindMediaReceiver_Params_Data();
  ~CommandBuffer_BindMediaReceiver_Params_Data() = delete;
};
static_assert(sizeof(CommandBuffer_BindMediaReceiver_Params_Data) == 16,
              "Bad sizeof(CommandBuffer_BindMediaReceiver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBuffer_BindMediaReceiver_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CommandBuffer_BindMediaReceiver_ResponseParams_Data>;

  CommandBuffer_BindMediaReceiver_ResponseParams_Data();
  ~CommandBuffer_BindMediaReceiver_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommandBuffer_BindMediaReceiver_ResponseParams_Data) == 8,
              "Bad sizeof(CommandBuffer_BindMediaReceiver_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBufferClient_OnConsoleMessage_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> message;

 private:
  friend class mojo::internal::MessageFragment<CommandBufferClient_OnConsoleMessage_Params_Data>;

  CommandBufferClient_OnConsoleMessage_Params_Data();
  ~CommandBufferClient_OnConsoleMessage_Params_Data() = delete;
};
static_assert(sizeof(CommandBufferClient_OnConsoleMessage_Params_Data) == 16,
              "Bad sizeof(CommandBufferClient_OnConsoleMessage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBufferClient_OnGpuSwitched_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t active_gpu_heuristic;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<CommandBufferClient_OnGpuSwitched_Params_Data>;

  CommandBufferClient_OnGpuSwitched_Params_Data();
  ~CommandBufferClient_OnGpuSwitched_Params_Data() = delete;
};
static_assert(sizeof(CommandBufferClient_OnGpuSwitched_Params_Data) == 16,
              "Bad sizeof(CommandBufferClient_OnGpuSwitched_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBufferClient_OnDestroyed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t reason;
  int32_t error;

 private:
  friend class mojo::internal::MessageFragment<CommandBufferClient_OnDestroyed_Params_Data>;

  CommandBufferClient_OnDestroyed_Params_Data();
  ~CommandBufferClient_OnDestroyed_Params_Data() = delete;
};
static_assert(sizeof(CommandBufferClient_OnDestroyed_Params_Data) == 16,
              "Bad sizeof(CommandBufferClient_OnDestroyed_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBufferClient_OnReturnData_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

 private:
  friend class mojo::internal::MessageFragment<CommandBufferClient_OnReturnData_Params_Data>;

  CommandBufferClient_OnReturnData_Params_Data();
  ~CommandBufferClient_OnReturnData_Params_Data() = delete;
};
static_assert(sizeof(CommandBufferClient_OnReturnData_Params_Data) == 16,
              "Bad sizeof(CommandBufferClient_OnReturnData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) CommandBufferClient_OnSignalAck_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t signal_id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<internal::CommandBufferState_Data> state;

 private:
  friend class mojo::internal::MessageFragment<CommandBufferClient_OnSignalAck_Params_Data>;

  CommandBufferClient_OnSignalAck_Params_Data();
  ~CommandBufferClient_OnSignalAck_Params_Data() = delete;
};
static_assert(sizeof(CommandBufferClient_OnSignalAck_Params_Data) == 24,
              "Bad sizeof(CommandBufferClient_OnSignalAck_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) StreamTexture_ForwardForSurfaceRequest_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> token;

 private:
  friend class mojo::internal::MessageFragment<StreamTexture_ForwardForSurfaceRequest_Params_Data>;

  StreamTexture_ForwardForSurfaceRequest_Params_Data();
  ~StreamTexture_ForwardForSurfaceRequest_Params_Data() = delete;
};
static_assert(sizeof(StreamTexture_ForwardForSurfaceRequest_Params_Data) == 16,
              "Bad sizeof(StreamTexture_ForwardForSurfaceRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) StreamTexture_StartListening_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data client;

 private:
  friend class mojo::internal::MessageFragment<StreamTexture_StartListening_Params_Data>;

  StreamTexture_StartListening_Params_Data();
  ~StreamTexture_StartListening_Params_Data() = delete;
};
static_assert(sizeof(StreamTexture_StartListening_Params_Data) == 16,
              "Bad sizeof(StreamTexture_StartListening_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) StreamTexture_UpdateRotatedVisibleSize_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> rotated_visible_size;

 private:
  friend class mojo::internal::MessageFragment<StreamTexture_UpdateRotatedVisibleSize_Params_Data>;

  StreamTexture_UpdateRotatedVisibleSize_Params_Data();
  ~StreamTexture_UpdateRotatedVisibleSize_Params_Data() = delete;
};
static_assert(sizeof(StreamTexture_UpdateRotatedVisibleSize_Params_Data) == 16,
              "Bad sizeof(StreamTexture_UpdateRotatedVisibleSize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) StreamTextureClient_OnFrameAvailable_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<StreamTextureClient_OnFrameAvailable_Params_Data>;

  StreamTextureClient_OnFrameAvailable_Params_Data();
  ~StreamTextureClient_OnFrameAvailable_Params_Data() = delete;
};
static_assert(sizeof(StreamTextureClient_OnFrameAvailable_Params_Data) == 8,
              "Bad sizeof(StreamTextureClient_OnFrameAvailable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_GPU_EXPORT) StreamTextureClient_OnFrameWithInfoAvailable_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gpu::mojom::internal::Mailbox_Data> mailbox;
  mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> coded_size;
  mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> visible_rect;
  mojo::internal::Pointer<::gpu::mojom::internal::VulkanYCbCrInfo_Data> info;

 private:
  friend class mojo::internal::MessageFragment<StreamTextureClient_OnFrameWithInfoAvailable_Params_Data>;

  StreamTextureClient_OnFrameWithInfoAvailable_Params_Data();
  ~StreamTextureClient_OnFrameWithInfoAvailable_Params_Data() = delete;
};
static_assert(sizeof(StreamTextureClient_OnFrameWithInfoAvailable_Params_Data) == 40,
              "Bad sizeof(StreamTextureClient_OnFrameWithInfoAvailable_Params_Data)");

}  // namespace internal


class GpuChannel_CrashForTesting_ParamsDataView {
 public:
  GpuChannel_CrashForTesting_ParamsDataView() = default;

  GpuChannel_CrashForTesting_ParamsDataView(
      internal::GpuChannel_CrashForTesting_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::GpuChannel_CrashForTesting_Params_Data* data_ = nullptr;
};



class GpuChannel_TerminateForTesting_ParamsDataView {
 public:
  GpuChannel_TerminateForTesting_ParamsDataView() = default;

  GpuChannel_TerminateForTesting_ParamsDataView(
      internal::GpuChannel_TerminateForTesting_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
