// third_party/blink/public/mojom/remote_objects/remote_objects.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_REMOTE_OBJECTS_REMOTE_OBJECTS_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_REMOTE_OBJECTS_REMOTE_OBJECTS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace blink {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObjectHost_GetObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t object_id;
  mojo::internal::Handle_Data receiver;

 private:
  friend class mojo::internal::MessageFragment<RemoteObjectHost_GetObject_Params_Data>;

  RemoteObjectHost_GetObject_Params_Data();
  ~RemoteObjectHost_GetObject_Params_Data() = delete;
};
static_assert(sizeof(RemoteObjectHost_GetObject_Params_Data) == 16,
              "Bad sizeof(RemoteObjectHost_GetObject_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObjectHost_AcquireObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t object_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<RemoteObjectHost_AcquireObject_Params_Data>;

  RemoteObjectHost_AcquireObject_Params_Data();
  ~RemoteObjectHost_AcquireObject_Params_Data() = delete;
};
static_assert(sizeof(RemoteObjectHost_AcquireObject_Params_Data) == 16,
              "Bad sizeof(RemoteObjectHost_AcquireObject_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObjectHost_ReleaseObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t object_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<RemoteObjectHost_ReleaseObject_Params_Data>;

  RemoteObjectHost_ReleaseObject_Params_Data();
  ~RemoteObjectHost_ReleaseObject_Params_Data() = delete;
};
static_assert(sizeof(RemoteObjectHost_ReleaseObject_Params_Data) == 16,
              "Bad sizeof(RemoteObjectHost_ReleaseObject_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_HasMethod_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_HasMethod_Params_Data>;

  RemoteObject_HasMethod_Params_Data();
  ~RemoteObject_HasMethod_Params_Data() = delete;
};
static_assert(sizeof(RemoteObject_HasMethod_Params_Data) == 16,
              "Bad sizeof(RemoteObject_HasMethod_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_HasMethod_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t method_exists : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_HasMethod_ResponseParams_Data>;

  RemoteObject_HasMethod_ResponseParams_Data();
  ~RemoteObject_HasMethod_ResponseParams_Data() = delete;
};
static_assert(sizeof(RemoteObject_HasMethod_ResponseParams_Data) == 16,
              "Bad sizeof(RemoteObject_HasMethod_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_GetMethods_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_GetMethods_Params_Data>;

  RemoteObject_GetMethods_Params_Data();
  ~RemoteObject_GetMethods_Params_Data() = delete;
};
static_assert(sizeof(RemoteObject_GetMethods_Params_Data) == 8,
              "Bad sizeof(RemoteObject_GetMethods_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_GetMethods_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> method_names;

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_GetMethods_ResponseParams_Data>;

  RemoteObject_GetMethods_ResponseParams_Data();
  ~RemoteObject_GetMethods_ResponseParams_Data() = delete;
};
static_assert(sizeof(RemoteObject_GetMethods_ResponseParams_Data) == 16,
              "Bad sizeof(RemoteObject_GetMethods_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_InvokeMethod_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;
  mojo::internal::Pointer<mojo::internal::Array_Data<internal::RemoteInvocationArgument_Data>> arguments;

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_InvokeMethod_Params_Data>;

  RemoteObject_InvokeMethod_Params_Data();
  ~RemoteObject_InvokeMethod_Params_Data() = delete;
};
static_assert(sizeof(RemoteObject_InvokeMethod_Params_Data) == 24,
              "Bad sizeof(RemoteObject_InvokeMethod_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_InvokeMethod_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::RemoteInvocationResult_Data> result;

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_InvokeMethod_ResponseParams_Data>;

  RemoteObject_InvokeMethod_ResponseParams_Data();
  ~RemoteObject_InvokeMethod_ResponseParams_Data() = delete;
};
static_assert(sizeof(RemoteObject_InvokeMethod_ResponseParams_Data) == 16,
              "Bad sizeof(RemoteObject_InvokeMethod_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObject_NotifyReleasedObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<RemoteObject_NotifyReleasedObject_Params_Data>;

  RemoteObject_NotifyReleasedObject_Params_Data();
  ~RemoteObject_NotifyReleasedObject_Params_Data() = delete;
};
static_assert(sizeof(RemoteObject_NotifyReleasedObject_Params_Data) == 8,
              "Bad sizeof(RemoteObject_NotifyReleasedObject_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data host;
  mojo::internal::Handle_Data gateway;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data>;

  RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data();
  ~RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data() = delete;
};
static_assert(sizeof(RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data) == 24,
              "Bad sizeof(RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObjectGateway_AddNamedObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;
  int32_t object_id;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<RemoteObjectGateway_AddNamedObject_Params_Data>;

  RemoteObjectGateway_AddNamedObject_Params_Data();
  ~RemoteObjectGateway_AddNamedObject_Params_Data() = delete;
};
static_assert(sizeof(RemoteObjectGateway_AddNamedObject_Params_Data) == 24,
              "Bad sizeof(RemoteObjectGateway_AddNamedObject_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteObjectGateway_RemoveNamedObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;

 private:
  friend class mojo::internal::MessageFragment<RemoteObjectGateway_RemoveNamedObject_Params_Data>;

  RemoteObjectGateway_RemoveNamedObject_Params_Data();
  ~RemoteObjectGateway_RemoveNamedObject_Params_Data() = delete;
};
static_assert(sizeof(RemoteObjectGateway_RemoveNamedObject_Params_Data) == 16,
              "Bad sizeof(RemoteObjectGateway_RemoveNamedObject_Params_Data)");

}  // namespace internal


class RemoteObjectHost_GetObject_ParamsDataView {
 public:
  RemoteObjectHost_GetObject_ParamsDataView() = default;

  RemoteObjectHost_GetObject_ParamsDataView(
      internal::RemoteObjectHost_GetObject_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  int32_t object_id() const {
    return data_->object_id;
  }
  template <typename UserType>
  UserType TakeReceiver() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::RemoteObjectInterfaceBase>>(
            &data_->receiver, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::RemoteObjectHost_GetObject_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObjectHost_AcquireObject_ParamsDataView {
 public:
  RemoteObjectHost_AcquireObject_ParamsDataView() = default;

  RemoteObjectHost_AcquireObject_ParamsDataView(
      internal::RemoteObjectHost_AcquireObject_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  int32_t object_id() const {
    return data_->object_id;
  }
 private:
  internal::RemoteObjectHost_AcquireObject_Params_Data* data_ = nullptr;
};



class RemoteObjectHost_ReleaseObject_ParamsDataView {
 public:
  RemoteObjectHost_ReleaseObject_ParamsDataView() = default;

  RemoteObjectHost_ReleaseObject_ParamsDataView(
      internal::RemoteObjectHost_ReleaseObject_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  int32_t object_id() const {
    return data_->object_id;
  }
 private:
  internal::RemoteObjectHost_ReleaseObject_Params_Data* data_ = nullptr;
};



class RemoteObject_HasMethod_ParamsDataView {
 public:
  RemoteObject_HasMethod_ParamsDataView() = default;

  RemoteObject_HasMethod_ParamsDataView(
      internal::RemoteObject_HasMethod_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetNameDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadName(UserType* output) {
    
    auto* pointer = data_->name.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::RemoteObject_HasMethod_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObject_HasMethod_ResponseParamsDataView {
 public:
  RemoteObject_HasMethod_ResponseParamsDataView() = default;

  RemoteObject_HasMethod_ResponseParamsDataView(
      internal::RemoteObject_HasMethod_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool method_exists() const {
    return data_->method_exists;
  }
 private:
  internal::RemoteObject_HasMethod_ResponseParams_Data* data_ = nullptr;
};



class RemoteObject_GetMethods_ParamsDataView {
 public:
  RemoteObject_GetMethods_ParamsDataView() = default;

  RemoteObject_GetMethods_ParamsDataView(
      internal::RemoteObject_GetMethods_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::RemoteObject_GetMethods_Params_Data* data_ = nullptr;
};



class RemoteObject_GetMethods_ResponseParamsDataView {
 public:
  RemoteObject_GetMethods_ResponseParamsDataView() = default;

  RemoteObject_GetMethods_ResponseParamsDataView(
      internal::RemoteObject_GetMethods_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetMethodNamesDataView(
      mojo::ArrayDataView<mojo::StringDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadMethodNames(UserType* output) {
    
    auto* pointer = data_->method_names.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<mojo::StringDataView>>(
        pointer, output, message_);
  }
 private:
  internal::RemoteObject_GetMethods_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObject_InvokeMethod_ParamsDataView {
 public:
  RemoteObject_InvokeMethod_ParamsDataView() = default;

  RemoteObject_InvokeMethod_ParamsDataView(
      internal::RemoteObject_InvokeMethod_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetNameDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadName(UserType* output) {
    
    auto* pointer = data_->name.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
  inline void GetArgumentsDataView(
      mojo::ArrayDataView<RemoteInvocationArgumentDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadArguments(UserType* output) {
    
    auto* pointer = data_->arguments.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::RemoteInvocationArgumentDataView>>(
        pointer, output, message_);
  }
 private:
  internal::RemoteObject_InvokeMethod_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObject_InvokeMethod_ResponseParamsDataView {
 public:
  RemoteObject_InvokeMethod_ResponseParamsDataView() = default;

  RemoteObject_InvokeMethod_ResponseParamsDataView(
      internal::RemoteObject_InvokeMethod_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetResultDataView(
      RemoteInvocationResultDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadResult(UserType* output) {
    
    auto* pointer = data_->result.Get();
    return mojo::internal::Deserialize<::blink::mojom::RemoteInvocationResultDataView>(
        pointer, output, message_);
  }
 private:
  internal::RemoteObject_InvokeMethod_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObject_NotifyReleasedObject_ParamsDataView {
 public:
  RemoteObject_NotifyReleasedObject_ParamsDataView() = default;

  RemoteObject_NotifyReleasedObject_ParamsDataView(
      internal::RemoteObject_NotifyReleasedObject_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::RemoteObject_NotifyReleasedObject_Params_Data* data_ = nullptr;
};



class RemoteObjectGatewayFactory_CreateRemoteObjectGateway_ParamsDataView {
 public:
  RemoteObjectGatewayFactory_CreateRemoteObjectGateway_ParamsDataView() = default;

  RemoteObjectGatewayFactory_CreateRemoteObjectGateway_ParamsDataView(
      internal::RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeHost() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::RemoteObjectHostInterfaceBase>>(
            &data_->host, &result, message_);
    DCHECK(ret);
    return result;
  }
  template <typename UserType>
  UserType TakeGateway() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::RemoteObjectGatewayInterfaceBase>>(
            &data_->gateway, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::RemoteObjectGatewayFactory_CreateRemoteObjectGateway_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObjectGateway_AddNamedObject_ParamsDataView {
 public:
  RemoteObjectGateway_AddNamedObject_ParamsDataView() = default;

  RemoteObjectGateway_AddNamedObject_ParamsDataView(
      internal::RemoteObjectGateway_AddNamedObject_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetNameDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadName(UserType* output) {
    
    auto* pointer = data_->name.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
  int32_t object_id() const {
    return data_->object_id;
  }
 private:
  internal::RemoteObjectGateway_AddNamedObject_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class RemoteObjectGateway_RemoveNamedObject_ParamsDataView {
 public:
  RemoteObjectGateway_RemoveNamedObject_ParamsDataView() = default;

  RemoteObjectGateway_RemoveNamedObject_ParamsDataView(
      internal::RemoteObjectGateway_RemoveNamedObject_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetNameDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadName(UserType* output) {
    
    auto* pointer = data_->name.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::RemoteObjectGateway_RemoveNamedObject_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};








inline void RemoteObject_HasMethod_ParamsDataView::GetNameDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->name.Get();
  *output = mojo::StringDataView(pointer, message_);
}






inline void RemoteObject_GetMethods_ResponseParamsDataView::GetMethodNamesDataView(
    mojo::ArrayDataView<mojo::StringDataView>* output) {
  auto pointer = data_->method_names.Get();
  *output = mojo::ArrayDataView<mojo::StringDataView>(pointer, message_);
}


inline void RemoteObject_InvokeMethod_ParamsDataView::GetNameDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->name.Get();
  *output = mojo::StringDataView(pointer, message_);
}
inline void RemoteObject_InvokeMethod_ParamsDataView::GetArgumentsDataView(
    mojo::ArrayDataView<RemoteInvocationArgumentDataView>* output) {
  auto pointer = data_->arguments.Get();
  *output = mojo::ArrayDataView<RemoteInvocationArgumentDataView>(pointer, message_);
}


inline void RemoteObject_InvokeMethod_ResponseParamsDataView::GetResultDataView(
    RemoteInvocationResultDataView* output) {
  auto pointer = data_->result.Get();
  *output = RemoteInvocationResultDataView(pointer, message_);
}






inline void RemoteObjectGateway_AddNamedObject_ParamsDataView::GetNameDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->name.Get();
  *output = mojo::StringDataView(pointer, message_);
}


inline void RemoteObjectGateway_RemoveNamedObject_ParamsDataView::GetNameDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->name.Get();
  *output = mojo::StringDataView(pointer, message_);
}

}  // namespace mojom
}  // namespace blink

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // THIRD_PARTY_BLINK_PUBLIC_MOJOM_REMOTE_OBJECTS_REMOTE_OBJECTS_MOJOM_PARAMS_DATA_H_