// chrome/browser/ui/webui/feed_internals/feed_internals.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CHROME_BROWSER_UI_WEBUI_FEED_INTERNALS_FEED_INTERNALS_MOJOM_PARAMS_DATA_H_
#define CHROME_BROWSER_UI_WEBUI_FEED_INTERNALS_FEED_INTERNALS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace feed_internals {
namespace mojom {
namespace internal {

class ValidationContext;
class  PageHandler_GetGeneralProperties_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetGeneralProperties_Params_Data>;

  PageHandler_GetGeneralProperties_Params_Data();
  ~PageHandler_GetGeneralProperties_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetGeneralProperties_Params_Data) == 8,
              "Bad sizeof(PageHandler_GetGeneralProperties_Params_Data)");
class  PageHandler_GetGeneralProperties_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::Properties_Data> properties;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetGeneralProperties_ResponseParams_Data>;

  PageHandler_GetGeneralProperties_ResponseParams_Data();
  ~PageHandler_GetGeneralProperties_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetGeneralProperties_ResponseParams_Data) == 16,
              "Bad sizeof(PageHandler_GetGeneralProperties_ResponseParams_Data)");
class  PageHandler_GetLastFetchProperties_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetLastFetchProperties_Params_Data>;

  PageHandler_GetLastFetchProperties_Params_Data();
  ~PageHandler_GetLastFetchProperties_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetLastFetchProperties_Params_Data) == 8,
              "Bad sizeof(PageHandler_GetLastFetchProperties_Params_Data)");
class  PageHandler_GetLastFetchProperties_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::LastFetchProperties_Data> properties;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetLastFetchProperties_ResponseParams_Data>;

  PageHandler_GetLastFetchProperties_ResponseParams_Data();
  ~PageHandler_GetLastFetchProperties_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetLastFetchProperties_ResponseParams_Data) == 16,
              "Bad sizeof(PageHandler_GetLastFetchProperties_ResponseParams_Data)");
class  PageHandler_RefreshForYouFeed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_RefreshForYouFeed_Params_Data>;

  PageHandler_RefreshForYouFeed_Params_Data();
  ~PageHandler_RefreshForYouFeed_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RefreshForYouFeed_Params_Data) == 8,
              "Bad sizeof(PageHandler_RefreshForYouFeed_Params_Data)");
class  PageHandler_RefreshFollowingFeed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_RefreshFollowingFeed_Params_Data>;

  PageHandler_RefreshFollowingFeed_Params_Data();
  ~PageHandler_RefreshFollowingFeed_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RefreshFollowingFeed_Params_Data) == 8,
              "Bad sizeof(PageHandler_RefreshFollowingFeed_Params_Data)");
class  PageHandler_RefreshWebFeedSuggestions_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_RefreshWebFeedSuggestions_Params_Data>;

  PageHandler_RefreshWebFeedSuggestions_Params_Data();
  ~PageHandler_RefreshWebFeedSuggestions_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RefreshWebFeedSuggestions_Params_Data) == 8,
              "Bad sizeof(PageHandler_RefreshWebFeedSuggestions_Params_Data)");
class  PageHandler_GetFeedProcessScopeDump_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetFeedProcessScopeDump_Params_Data>;

  PageHandler_GetFeedProcessScopeDump_Params_Data();
  ~PageHandler_GetFeedProcessScopeDump_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetFeedProcessScopeDump_Params_Data) == 8,
              "Bad sizeof(PageHandler_GetFeedProcessScopeDump_Params_Data)");
class  PageHandler_GetFeedProcessScopeDump_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> dump;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetFeedProcessScopeDump_ResponseParams_Data>;

  PageHandler_GetFeedProcessScopeDump_ResponseParams_Data();
  ~PageHandler_GetFeedProcessScopeDump_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetFeedProcessScopeDump_ResponseParams_Data) == 16,
              "Bad sizeof(PageHandler_GetFeedProcessScopeDump_ResponseParams_Data)");
class  PageHandler_GetFeedHistograms_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetFeedHistograms_Params_Data>;

  PageHandler_GetFeedHistograms_Params_Data();
  ~PageHandler_GetFeedHistograms_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetFeedHistograms_Params_Data) == 8,
              "Bad sizeof(PageHandler_GetFeedHistograms_Params_Data)");
class  PageHandler_GetFeedHistograms_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> log;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_GetFeedHistograms_ResponseParams_Data>;

  PageHandler_GetFeedHistograms_ResponseParams_Data();
  ~PageHandler_GetFeedHistograms_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetFeedHistograms_ResponseParams_Data) == 16,
              "Bad sizeof(PageHandler_GetFeedHistograms_ResponseParams_Data)");
class  PageHandler_OverrideFeedHost_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> host;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_OverrideFeedHost_Params_Data>;

  PageHandler_OverrideFeedHost_Params_Data();
  ~PageHandler_OverrideFeedHost_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OverrideFeedHost_Params_Data) == 16,
              "Bad sizeof(PageHandler_OverrideFeedHost_Params_Data)");
class  PageHandler_OverrideDiscoverApiEndpoint_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> endpoint_url;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_OverrideDiscoverApiEndpoint_Params_Data>;

  PageHandler_OverrideDiscoverApiEndpoint_Params_Data();
  ~PageHandler_OverrideDiscoverApiEndpoint_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OverrideDiscoverApiEndpoint_Params_Data) == 16,
              "Bad sizeof(PageHandler_OverrideDiscoverApiEndpoint_Params_Data)");
class  PageHandler_OverrideFeedStreamData_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

 private:
  friend class mojo::internal::MessageFragment<PageHandler_OverrideFeedStreamData_Params_Data>;

  PageHandler_OverrideFeedStreamData_Params_Data();
  ~PageHandler_OverrideFeedStreamData_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OverrideFeedStreamData_Params_Data) == 16,
              "Bad sizeof(PageHandler_OverrideFeedStreamData_Params_Data)");
class  PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t enabled : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data>;

  PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data();
  ~PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data) == 16,
              "Bad sizeof(PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data)");
class  PageHandler_SetUseFeedQueryRequests_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t use_legacy : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PageHandler_SetUseFeedQueryRequests_Params_Data>;

  PageHandler_SetUseFeedQueryRequests_Params_Data();
  ~PageHandler_SetUseFeedQueryRequests_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetUseFeedQueryRequests_Params_Data) == 16,
              "Bad sizeof(PageHandler_SetUseFeedQueryRequests_Params_Data)");
class  PageHandler_SetFollowingFeedOrder_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t order;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<PageHandler_SetFollowingFeedOrder_Params_Data>;

  PageHandler_SetFollowingFeedOrder_Params_Data();
  ~PageHandler_SetFollowingFeedOrder_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetFollowingFeedOrder_Params_Data) == 16,
              "Bad sizeof(PageHandler_SetFollowingFeedOrder_Params_Data)");

}  // namespace internal


class PageHandler_GetGeneralProperties_ParamsDataView {
 public:
  PageHandler_GetGeneralProperties_ParamsDataView() = default;

  PageHandler_GetGeneralProperties_ParamsDataView(
      internal::PageHandler_GetGeneralProperties_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_GetGeneralProperties_Params_Data* data_ = nullptr;
};



class PageHandler_GetGeneralProperties_ResponseParamsDataView {
 public:
  PageHandler_GetGeneralProperties_ResponseParamsDataView() = default;

  PageHandler_GetGeneralProperties_ResponseParamsDataView(
      internal::PageHandler_GetGeneralProperties_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetPropertiesDataView(
      PropertiesDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadProperties(UserType* output) {
    
    auto* pointer = data_->properties.Get();
    return mojo::internal::Deserialize<::feed_internals::mojom::PropertiesDataView>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_GetGeneralProperties_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_GetLastFetchProperties_ParamsDataView {
 public:
  PageHandler_GetLastFetchProperties_ParamsDataView() = default;

  PageHandler_GetLastFetchProperties_ParamsDataView(
      internal::PageHandler_GetLastFetchProperties_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_GetLastFetchProperties_Params_Data* data_ = nullptr;
};



class PageHandler_GetLastFetchProperties_ResponseParamsDataView {
 public:
  PageHandler_GetLastFetchProperties_ResponseParamsDataView() = default;

  PageHandler_GetLastFetchProperties_ResponseParamsDataView(
      internal::PageHandler_GetLastFetchProperties_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetPropertiesDataView(
      LastFetchPropertiesDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadProperties(UserType* output) {
    
    auto* pointer = data_->properties.Get();
    return mojo::internal::Deserialize<::feed_internals::mojom::LastFetchPropertiesDataView>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_GetLastFetchProperties_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_RefreshForYouFeed_ParamsDataView {
 public:
  PageHandler_RefreshForYouFeed_ParamsDataView() = default;

  PageHandler_RefreshForYouFeed_ParamsDataView(
      internal::PageHandler_RefreshForYouFeed_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_RefreshForYouFeed_Params_Data* data_ = nullptr;
};



class PageHandler_RefreshFollowingFeed_ParamsDataView {
 public:
  PageHandler_RefreshFollowingFeed_ParamsDataView() = default;

  PageHandler_RefreshFollowingFeed_ParamsDataView(
      internal::PageHandler_RefreshFollowingFeed_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_RefreshFollowingFeed_Params_Data* data_ = nullptr;
};



class PageHandler_RefreshWebFeedSuggestions_ParamsDataView {
 public:
  PageHandler_RefreshWebFeedSuggestions_ParamsDataView() = default;

  PageHandler_RefreshWebFeedSuggestions_ParamsDataView(
      internal::PageHandler_RefreshWebFeedSuggestions_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_RefreshWebFeedSuggestions_Params_Data* data_ = nullptr;
};



class PageHandler_GetFeedProcessScopeDump_ParamsDataView {
 public:
  PageHandler_GetFeedProcessScopeDump_ParamsDataView() = default;

  PageHandler_GetFeedProcessScopeDump_ParamsDataView(
      internal::PageHandler_GetFeedProcessScopeDump_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_GetFeedProcessScopeDump_Params_Data* data_ = nullptr;
};



class PageHandler_GetFeedProcessScopeDump_ResponseParamsDataView {
 public:
  PageHandler_GetFeedProcessScopeDump_ResponseParamsDataView() = default;

  PageHandler_GetFeedProcessScopeDump_ResponseParamsDataView(
      internal::PageHandler_GetFeedProcessScopeDump_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetDumpDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadDump(UserType* output) {
    
    auto* pointer = data_->dump.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_GetFeedProcessScopeDump_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_GetFeedHistograms_ParamsDataView {
 public:
  PageHandler_GetFeedHistograms_ParamsDataView() = default;

  PageHandler_GetFeedHistograms_ParamsDataView(
      internal::PageHandler_GetFeedHistograms_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::PageHandler_GetFeedHistograms_Params_Data* data_ = nullptr;
};



class PageHandler_GetFeedHistograms_ResponseParamsDataView {
 public:
  PageHandler_GetFeedHistograms_ResponseParamsDataView() = default;

  PageHandler_GetFeedHistograms_ResponseParamsDataView(
      internal::PageHandler_GetFeedHistograms_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetLogDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadLog(UserType* output) {
    
    auto* pointer = data_->log.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_GetFeedHistograms_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_OverrideFeedHost_ParamsDataView {
 public:
  PageHandler_OverrideFeedHost_ParamsDataView() = default;

  PageHandler_OverrideFeedHost_ParamsDataView(
      internal::PageHandler_OverrideFeedHost_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetHostDataView(
      ::url::mojom::UrlDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadHost(UserType* output) {
    
    auto* pointer = data_->host.Get();
    return mojo::internal::Deserialize<::url::mojom::UrlDataView>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_OverrideFeedHost_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_OverrideDiscoverApiEndpoint_ParamsDataView {
 public:
  PageHandler_OverrideDiscoverApiEndpoint_ParamsDataView() = default;

  PageHandler_OverrideDiscoverApiEndpoint_ParamsDataView(
      internal::PageHandler_OverrideDiscoverApiEndpoint_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetEndpointUrlDataView(
      ::url::mojom::UrlDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadEndpointUrl(UserType* output) {
    
    auto* pointer = data_->endpoint_url.Get();
    return mojo::internal::Deserialize<::url::mojom::UrlDataView>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_OverrideDiscoverApiEndpoint_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_OverrideFeedStreamData_ParamsDataView {
 public:
  PageHandler_OverrideFeedStreamData_ParamsDataView() = default;

  PageHandler_OverrideFeedStreamData_ParamsDataView(
      internal::PageHandler_OverrideFeedStreamData_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetDataDataView(
      mojo::ArrayDataView<uint8_t>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadData(UserType* output) {
    
    auto* pointer = data_->data.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<uint8_t>>(
        pointer, output, message_);
  }
 private:
  internal::PageHandler_OverrideFeedStreamData_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class PageHandler_SetWebFeedFollowIntroDebugEnabled_ParamsDataView {
 public:
  PageHandler_SetWebFeedFollowIntroDebugEnabled_ParamsDataView() = default;

  PageHandler_SetWebFeedFollowIntroDebugEnabled_ParamsDataView(
      internal::PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool enabled() const {
    return data_->enabled;
  }
 private:
  internal::PageHandler_SetWebFeedFollowIntroDebugEnabled_Params_Data* data_ = nullptr;
};



class PageHandler_SetUseFeedQueryRequests_ParamsDataView {
 public:
  PageHandler_SetUseFeedQueryRequests_ParamsDataView() = default;

  PageHandler_SetUseFeedQueryRequests_ParamsDataView(
      internal::PageHandler_SetUseFeedQueryRequests_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool use_legacy() const {
    return data_->use_legacy;
  }
 private:
  internal::PageHandler_SetUseFeedQueryRequests_Params_Data* data_ = nullptr;
};



class PageHandler_SetFollowingFeedOrder_ParamsDataView {
 public:
  PageHandler_SetFollowingFeedOrder_ParamsDataView() = default;

  PageHandler_SetFollowingFeedOrder_ParamsDataView(
      internal::PageHandler_SetFollowingFeedOrder_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  [[nodiscard]] bool ReadOrder(UserType* output) const {
    auto data_value = data_->order;
    return mojo::internal::Deserialize<::feed_internals::mojom::FeedOrder>(
        data_value, output);
  }
  FeedOrder order() const {
    return ::mojo::internal::ToKnownEnumValueHelper(
          static_cast<::feed_internals::mojom::FeedOrder>(data_->order));
  }
 private:
  internal::PageHandler_SetFollowingFeedOrder_Params_Data* data_ = nullptr;
};




inline void PageHandler_GetGeneralProperties_ResponseParamsDataView::GetPropertiesDataView(
    PropertiesDataView* output) {
  auto pointer = data_->properties.Get();
  *output = PropertiesDataView(pointer, message_);
}




inline void PageHandler_GetLastFetchProperties_ResponseParamsDataView::GetPropertiesDataView(
    LastFetchPropertiesDataView* output) {
  auto pointer = data_->properties.Get();
  *output = LastFetchPropertiesDataView(pointer, message_);
}










inline void PageHandler_GetFeedProcessScopeDump_ResponseParamsDataView::GetDumpDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->dump.Get();
  *output = mojo::StringDataView(pointer, message_);
}




inline void PageHandler_GetFeedHistograms_ResponseParamsDataView::GetLogDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->log.Get();
  *output = mojo::StringDataView(pointer, message_);
}


inline void PageHandler_OverrideFeedHost_ParamsDataView::GetHostDataView(
    ::url::mojom::UrlDataView* output) {
  auto pointer = data_->host.Get();
  *output = ::url::mojom::UrlDataView(pointer, message_);
}


inline void PageHandler_OverrideDiscoverApiEndpoint_ParamsDataView::GetEndpointUrlDataView(
    ::url::mojom::UrlDataView* output) {
  auto pointer = data_->endpoint_url.Get();
  *output = ::url::mojom::UrlDataView(pointer, message_);
}


inline void PageHandler_OverrideFeedStreamData_ParamsDataView::GetDataDataView(
    mojo::ArrayDataView<uint8_t>* output) {
  auto pointer = data_->data.Get();
  *output = mojo::ArrayDataView<uint8_t>(pointer, message_);
}







}  // namespace mojom
}  // namespace feed_internals

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // CHROME_BROWSER_UI_WEBUI_FEED_INTERNALS_FEED_INTERNALS_MOJOM_PARAMS_DATA_H_