// content/services/auction_worklet/public/mojom/bidder_worklet.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CONTENT_SERVICES_AUCTION_WORKLET_PUBLIC_MOJOM_BIDDER_WORKLET_MOJOM_PARAMS_DATA_H_
#define CONTENT_SERVICES_AUCTION_WORKLET_PUBLIC_MOJOM_BIDDER_WORKLET_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace auction_worklet {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) BidderWorklet_GenerateBid_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::BidderWorkletNonSharedParams_Data> bidder_worklet_non_shared_params;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> interest_group_join_origin;
  mojo::internal::Pointer<mojo::internal::String_Data> auction_signals_json;
  mojo::internal::Pointer<mojo::internal::String_Data> per_buyer_signals_json;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> per_buyer_timeout;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> browser_signal_seller_origin;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> browser_signal_top_level_seller_origin;
  mojo::internal::Pointer<internal::BiddingBrowserSignals_Data> bidding_browser_signals;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> auction_start_time;
  uint64_t trace_id;

 private:
  friend class mojo::internal::MessageFragment<BidderWorklet_GenerateBid_Params_Data>;

  BidderWorklet_GenerateBid_Params_Data();
  ~BidderWorklet_GenerateBid_Params_Data() = delete;
};
static_assert(sizeof(BidderWorklet_GenerateBid_Params_Data) == 88,
              "Bad sizeof(BidderWorklet_GenerateBid_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) BidderWorklet_GenerateBid_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::BidderWorkletBid_Data> bid;
  uint32_t bidding_signals_data_version;
  uint8_t has_bidding_signals_data_version : 1;
  uint8_t has_set_priority : 1;
  uint8_t pad3_[3];
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> debug_loss_report_url;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> debug_win_report_url;
  double set_priority;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::auction_worklet::mojom::internal::PrivateAggregationRequest_Data>>> pa_requests;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> errors;

 private:
  friend class mojo::internal::MessageFragment<BidderWorklet_GenerateBid_ResponseParams_Data>;

  BidderWorklet_GenerateBid_ResponseParams_Data();
  ~BidderWorklet_GenerateBid_ResponseParams_Data() = delete;
};
static_assert(sizeof(BidderWorklet_GenerateBid_ResponseParams_Data) == 64,
              "Bad sizeof(BidderWorklet_GenerateBid_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) BidderWorklet_SendPendingSignalsRequests_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<BidderWorklet_SendPendingSignalsRequests_Params_Data>;

  BidderWorklet_SendPendingSignalsRequests_Params_Data();
  ~BidderWorklet_SendPendingSignalsRequests_Params_Data() = delete;
};
static_assert(sizeof(BidderWorklet_SendPendingSignalsRequests_Params_Data) == 8,
              "Bad sizeof(BidderWorklet_SendPendingSignalsRequests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) BidderWorklet_ReportWin_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> interest_group_name;
  mojo::internal::Pointer<mojo::internal::String_Data> auction_signals_json;
  mojo::internal::Pointer<mojo::internal::String_Data> per_buyer_signals_json;
  mojo::internal::Pointer<mojo::internal::String_Data> seller_signals_json;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> browser_signal_render_url;
  double browser_signal_bid;
  double browser_signal_highest_scoring_other_bid;
  uint8_t browser_signal_made_highest_scoring_other_bid : 1;
  uint8_t has_bidding_signals_data_version : 1;
  uint8_t pad8_[3];
  uint32_t bidding_signals_data_version;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> browser_signal_seller_origin;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> browser_signal_top_level_seller_origin;
  uint64_t trace_id;

 private:
  friend class mojo::internal::MessageFragment<BidderWorklet_ReportWin_Params_Data>;

  BidderWorklet_ReportWin_Params_Data();
  ~BidderWorklet_ReportWin_Params_Data() = delete;
};
static_assert(sizeof(BidderWorklet_ReportWin_Params_Data) == 96,
              "Bad sizeof(BidderWorklet_ReportWin_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) BidderWorklet_ReportWin_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> report_url;
  mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> ad_beacon_map;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::auction_worklet::mojom::internal::PrivateAggregationRequest_Data>>> pa_requests;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> errors;

 private:
  friend class mojo::internal::MessageFragment<BidderWorklet_ReportWin_ResponseParams_Data>;

  BidderWorklet_ReportWin_ResponseParams_Data();
  ~BidderWorklet_ReportWin_ResponseParams_Data() = delete;
};
static_assert(sizeof(BidderWorklet_ReportWin_ResponseParams_Data) == 40,
              "Bad sizeof(BidderWorklet_ReportWin_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) BidderWorklet_ConnectDevToolsAgent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data agent;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<BidderWorklet_ConnectDevToolsAgent_Params_Data>;

  BidderWorklet_ConnectDevToolsAgent_Params_Data();
  ~BidderWorklet_ConnectDevToolsAgent_Params_Data() = delete;
};
static_assert(sizeof(BidderWorklet_ConnectDevToolsAgent_Params_Data) == 16,
              "Bad sizeof(BidderWorklet_ConnectDevToolsAgent_Params_Data)");

}  // namespace internal


class BidderWorklet_GenerateBid_ParamsDataView {
 public:
  BidderWorklet_GenerateBid_ParamsDataView() = default;

  BidderWorklet_GenerateBid_ParamsDataView(
      internal::BidderWorklet_GenerateBid_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetBidderWorkletNonSharedParamsDataView(
      BidderWorkletNonSharedParamsDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadBidderWorkletNonSharedParams(UserType* output) {
    
    auto* pointer = data_->bidder_worklet_non_shared_params.Get();
    return mojo::internal::Deserialize<::auction_worklet::mojom::BidderWorkletNonSharedParamsDataView>(
        pointer, output, message_);
  }
  inline void GetInterestGroupJoinOriginDataView(
