// content/services/auction_worklet/public/mojom/seller_worklet.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CONTENT_SERVICES_AUCTION_WORKLET_PUBLIC_MOJOM_SELLER_WORKLET_MOJOM_PARAMS_DATA_H_
#define CONTENT_SERVICES_AUCTION_WORKLET_PUBLIC_MOJOM_SELLER_WORKLET_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace auction_worklet {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SellerWorklet_ScoreAd_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> ad_metadata_json;
  double bid;
  mojo::internal::Pointer<::blink::mojom::internal::AuctionAdConfigNonSharedParams_Data> auction_ad_config_non_shared_params;
  internal::ComponentAuctionOtherSeller_Data browser_signals_other_seller;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> browser_signal_interest_group_owner;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> browser_signal_render_url;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> browser_signal_ad_component_render_urls;
  uint32_t browser_signal_bidding_duration_msecs;
  uint8_t pad7_[4];
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seller_timeout;
  uint64_t trace_id;

 private:
  friend class mojo::internal::MessageFragment<SellerWorklet_ScoreAd_Params_Data>;

  SellerWorklet_ScoreAd_Params_Data();
  ~SellerWorklet_ScoreAd_Params_Data() = delete;
};
static_assert(sizeof(SellerWorklet_ScoreAd_Params_Data) == 96,
              "Bad sizeof(SellerWorklet_ScoreAd_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SellerWorklet_ScoreAd_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  double score;
  mojo::internal::Pointer<internal::ComponentAuctionModifiedBidParams_Data> component_auction_modified_bid_params;
  uint32_t scoring_signals_data_version;
  uint8_t has_scoring_signals_data_version : 1;
  uint8_t pad3_[3];
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> debug_loss_report_url;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> debug_win_report_url;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::auction_worklet::mojom::internal::PrivateAggregationRequest_Data>>> pa_requests;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> errors;

 private:
  friend class mojo::internal::MessageFragment<SellerWorklet_ScoreAd_ResponseParams_Data>;

  SellerWorklet_ScoreAd_ResponseParams_Data();
  ~SellerWorklet_ScoreAd_ResponseParams_Data() = delete;
};
static_assert(sizeof(SellerWorklet_ScoreAd_ResponseParams_Data) == 64,
              "Bad sizeof(SellerWorklet_ScoreAd_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SellerWorklet_SendPendingSignalsRequests_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SellerWorklet_SendPendingSignalsRequests_Params_Data>;

  SellerWorklet_SendPendingSignalsRequests_Params_Data();
  ~SellerWorklet_SendPendingSignalsRequests_Params_Data() = delete;
};
static_assert(sizeof(SellerWorklet_SendPendingSignalsRequests_Params_Data) == 8,
              "Bad sizeof(SellerWorklet_SendPendingSignalsRequests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SellerWorklet_ReportResult_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::AuctionAdConfigNonSharedParams_Data> auction_ad_config_non_shared_params;
  internal::ComponentAuctionOtherSeller_Data browser_signals_other_seller;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> browser_signal_interest_group_owner;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> browser_signal_render_url;
  double browser_signal_bid;
  double browser_signal_desirability;
  double browser_signal_highest_scoring_other_bid;
  mojo::internal::Pointer<internal::ComponentAuctionReportResultParams_Data> browser_signals_component_auction_report_result_params;
  uint32_t scoring_signals_data_version;
  uint8_t has_scoring_signals_data_version : 1;
  uint8_t pad9_[3];
  uint64_t trace_id;

 private:
  friend class mojo::internal::MessageFragment<SellerWorklet_ReportResult_Params_Data>;

  SellerWorklet_ReportResult_Params_Data();
  ~SellerWorklet_ReportResult_Params_Data() = delete;
};
static_assert(sizeof(SellerWorklet_ReportResult_Params_Data) == 96,
              "Bad sizeof(SellerWorklet_ReportResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SellerWorklet_ReportResult_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> signals_for_winner;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> report_url;
  mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> ad_beacon_map;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::auction_worklet::mojom::internal::PrivateAggregationRequest_Data>>> pa_requests;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> error_msgs;

 private:
  friend class mojo::internal::MessageFragment<SellerWorklet_ReportResult_ResponseParams_Data>;

  SellerWorklet_ReportResult_ResponseParams_Data();
  ~SellerWorklet_ReportResult_ResponseParams_Data() = delete;
};
static_assert(sizeof(SellerWorklet_ReportResult_ResponseParams_Data) == 48,
              "Bad sizeof(SellerWorklet_ReportResult_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SellerWorklet_ConnectDevToolsAgent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data agent;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<SellerWorklet_ConnectDevToolsAgent_Params_Data>;

  SellerWorklet_ConnectDevToolsAgent_Params_Data();
  ~SellerWorklet_ConnectDevToolsAgent_Params_Data() = delete;
};
static_assert(sizeof(SellerWorklet_ConnectDevToolsAgent_Params_Data) == 16,
              "Bad sizeof(SellerWorklet_ConnectDevToolsAgent_Params_Data)");

}  // namespace internal


class SellerWorklet_ScoreAd_ParamsDataView {
 public:
  SellerWorklet_ScoreAd_ParamsDataView() = default;

  SellerWorklet_ScoreAd_ParamsDataView(
      internal::SellerWorklet_ScoreAd_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetAdMetadataJsonDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadAdMetadataJson(UserType* output) {
    
    auto* pointer = data_->ad_metadata_json.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
  double bid() const {
    return data_->bid;
  }
  inline void GetAuctionAdConfigNonSharedParamsDataView(
      ::blink::mojom::AuctionAdConfigNonSharedParamsDataView* output);

