// chrome/common/supervised_user_commands.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CHROME_COMMON_SUPERVISED_USER_COMMANDS_MOJOM_PARAMS_DATA_H_
#define CHROME_COMMON_SUPERVISED_USER_COMMANDS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace supervised_user {
namespace mojom {
namespace internal {

class ValidationContext;
class  SupervisedUserCommands_GoBack_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SupervisedUserCommands_GoBack_Params_Data>;

  SupervisedUserCommands_GoBack_Params_Data();
  ~SupervisedUserCommands_GoBack_Params_Data() = delete;
};
static_assert(sizeof(SupervisedUserCommands_GoBack_Params_Data) == 8,
              "Bad sizeof(SupervisedUserCommands_GoBack_Params_Data)");
class  SupervisedUserCommands_RequestUrlAccessRemote_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SupervisedUserCommands_RequestUrlAccessRemote_Params_Data>;

  SupervisedUserCommands_RequestUrlAccessRemote_Params_Data();
  ~SupervisedUserCommands_RequestUrlAccessRemote_Params_Data() = delete;
};
static_assert(sizeof(SupervisedUserCommands_RequestUrlAccessRemote_Params_Data) == 8,
              "Bad sizeof(SupervisedUserCommands_RequestUrlAccessRemote_Params_Data)");
class  SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t request_issued : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data>;

  SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data();
  ~SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data() = delete;
};
static_assert(sizeof(SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data) == 16,
              "Bad sizeof(SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data)");
class  SupervisedUserCommands_RequestUrlAccessLocal_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SupervisedUserCommands_RequestUrlAccessLocal_Params_Data>;

  SupervisedUserCommands_RequestUrlAccessLocal_Params_Data();
  ~SupervisedUserCommands_RequestUrlAccessLocal_Params_Data() = delete;
};
static_assert(sizeof(SupervisedUserCommands_RequestUrlAccessLocal_Params_Data) == 8,
              "Bad sizeof(SupervisedUserCommands_RequestUrlAccessLocal_Params_Data)");
class  SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t request_issued : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data>;

  SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data();
  ~SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data() = delete;
};
static_assert(sizeof(SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data) == 16,
              "Bad sizeof(SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data)");
class  SupervisedUserCommands_Feedback_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SupervisedUserCommands_Feedback_Params_Data>;

  SupervisedUserCommands_Feedback_Params_Data();
  ~SupervisedUserCommands_Feedback_Params_Data() = delete;
};
static_assert(sizeof(SupervisedUserCommands_Feedback_Params_Data) == 8,
              "Bad sizeof(SupervisedUserCommands_Feedback_Params_Data)");

}  // namespace internal


class SupervisedUserCommands_GoBack_ParamsDataView {
 public:
  SupervisedUserCommands_GoBack_ParamsDataView() = default;

  SupervisedUserCommands_GoBack_ParamsDataView(
      internal::SupervisedUserCommands_GoBack_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::SupervisedUserCommands_GoBack_Params_Data* data_ = nullptr;
};



class SupervisedUserCommands_RequestUrlAccessRemote_ParamsDataView {
 public:
  SupervisedUserCommands_RequestUrlAccessRemote_ParamsDataView() = default;

  SupervisedUserCommands_RequestUrlAccessRemote_ParamsDataView(
      internal::SupervisedUserCommands_RequestUrlAccessRemote_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::SupervisedUserCommands_RequestUrlAccessRemote_Params_Data* data_ = nullptr;
};



class SupervisedUserCommands_RequestUrlAccessRemote_ResponseParamsDataView {
 public:
  SupervisedUserCommands_RequestUrlAccessRemote_ResponseParamsDataView() = default;

  SupervisedUserCommands_RequestUrlAccessRemote_ResponseParamsDataView(
      internal::SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool request_issued() const {
    return data_->request_issued;
  }
 private:
  internal::SupervisedUserCommands_RequestUrlAccessRemote_ResponseParams_Data* data_ = nullptr;
};



class SupervisedUserCommands_RequestUrlAccessLocal_ParamsDataView {
 public:
  SupervisedUserCommands_RequestUrlAccessLocal_ParamsDataView() = default;

  SupervisedUserCommands_RequestUrlAccessLocal_ParamsDataView(
      internal::SupervisedUserCommands_RequestUrlAccessLocal_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::SupervisedUserCommands_RequestUrlAccessLocal_Params_Data* data_ = nullptr;
};



class SupervisedUserCommands_RequestUrlAccessLocal_ResponseParamsDataView {
 public:
  SupervisedUserCommands_RequestUrlAccessLocal_ResponseParamsDataView() = default;

  SupervisedUserCommands_RequestUrlAccessLocal_ResponseParamsDataView(
      internal::SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool request_issued() const {
    return data_->request_issued;
  }
 private:
  internal::SupervisedUserCommands_RequestUrlAccessLocal_ResponseParams_Data* data_ = nullptr;
};



class SupervisedUserCommands_Feedback_ParamsDataView {
 public:
  SupervisedUserCommands_Feedback_ParamsDataView() = default;

  SupervisedUserCommands_Feedback_ParamsDataView(
      internal::SupervisedUserCommands_Feedback_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::SupervisedUserCommands_Feedback_Params_Data* data_ = nullptr;
};













}  // namespace mojom
}  // namespace supervised_user

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // CHROME_COMMON_SUPERVISED_USER_COMMANDS_MOJOM_PARAMS_DATA_H_