// content/browser/process_internals/process_internals.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CONTENT_BROWSER_PROCESS_INTERNALS_PROCESS_INTERNALS_MOJOM_PARAMS_DATA_H_
#define CONTENT_BROWSER_PROCESS_INTERNALS_PROCESS_INTERNALS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace mojom {
namespace internal {

class ValidationContext;
class  ProcessInternalsHandler_GetIsolationMode_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetIsolationMode_Params_Data>;

  ProcessInternalsHandler_GetIsolationMode_Params_Data();
  ~ProcessInternalsHandler_GetIsolationMode_Params_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetIsolationMode_Params_Data) == 8,
              "Bad sizeof(ProcessInternalsHandler_GetIsolationMode_Params_Data)");
class  ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> mode;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data>;

  ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data();
  ~ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data) == 16,
              "Bad sizeof(ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data)");
class  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data>;

  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data();
  ~ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data) == 8,
              "Bad sizeof(ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data)");
class  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> isolated_origins;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data>;

  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data();
  ~ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data) == 16,
              "Bad sizeof(ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data)");
class  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data>;

  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data();
  ~ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data) == 8,
              "Bad sizeof(ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data)");
class  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> isolated_origins;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data>;

  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data();
  ~ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data) == 16,
              "Bad sizeof(ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data)");
class  ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data>;

  ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data();
  ~ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data) == 8,
              "Bad sizeof(ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data)");
class  ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IsolatedOriginInfo_Data>>> isolated_origins;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data>;

  ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data();
  ~ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data) == 16,
              "Bad sizeof(ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data)");
class  ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data>;

  ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data();
  ~ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data) == 8,
              "Bad sizeof(ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data)");
class  ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::WebContentsInfo_Data>>> infos;

 private:
  friend class mojo::internal::MessageFragment<ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data>;

  ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data();
  ~ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data) == 16,
              "Bad sizeof(ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data)");

}  // namespace internal


class ProcessInternalsHandler_GetIsolationMode_ParamsDataView {
 public:
  ProcessInternalsHandler_GetIsolationMode_ParamsDataView() = default;

  ProcessInternalsHandler_GetIsolationMode_ParamsDataView(
      internal::ProcessInternalsHandler_GetIsolationMode_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::ProcessInternalsHandler_GetIsolationMode_Params_Data* data_ = nullptr;
};



class ProcessInternalsHandler_GetIsolationMode_ResponseParamsDataView {
 public:
  ProcessInternalsHandler_GetIsolationMode_ResponseParamsDataView() = default;

  ProcessInternalsHandler_GetIsolationMode_ResponseParamsDataView(
      internal::ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetModeDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadMode(UserType* output) {
    
    auto* pointer = data_->mode.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::ProcessInternalsHandler_GetIsolationMode_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ParamsDataView {
 public:
  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ParamsDataView() = default;

  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ParamsDataView(
      internal::ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_Params_Data* data_ = nullptr;
};



class ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParamsDataView {
 public:
  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParamsDataView() = default;

  ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParamsDataView(
      internal::ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetIsolatedOriginsDataView(
      mojo::ArrayDataView<mojo::StringDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadIsolatedOrigins(UserType* output) {
    
    auto* pointer = data_->isolated_origins.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<mojo::StringDataView>>(
        pointer, output, message_);
  }
 private:
  internal::ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ParamsDataView {
 public:
  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ParamsDataView() = default;

  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ParamsDataView(
      internal::ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_Params_Data* data_ = nullptr;
};



class ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParamsDataView {
 public:
  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParamsDataView() = default;

  ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParamsDataView(
      internal::ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetIsolatedOriginsDataView(
      mojo::ArrayDataView<mojo::StringDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadIsolatedOrigins(UserType* output) {
    
    auto* pointer = data_->isolated_origins.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<mojo::StringDataView>>(
        pointer, output, message_);
  }
 private:
  internal::ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class ProcessInternalsHandler_GetGloballyIsolatedOrigins_ParamsDataView {
 public:
  ProcessInternalsHandler_GetGloballyIsolatedOrigins_ParamsDataView() = default;

  ProcessInternalsHandler_GetGloballyIsolatedOrigins_ParamsDataView(
      internal::ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::ProcessInternalsHandler_GetGloballyIsolatedOrigins_Params_Data* data_ = nullptr;
};



class ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParamsDataView {
 public:
  ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParamsDataView() = default;

  ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParamsDataView(
      internal::ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetIsolatedOriginsDataView(
      mojo::ArrayDataView<IsolatedOriginInfoDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadIsolatedOrigins(UserType* output) {
    
    auto* pointer = data_->isolated_origins.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::mojom::IsolatedOriginInfoDataView>>(
        pointer, output, message_);
  }
 private:
  internal::ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class ProcessInternalsHandler_GetAllWebContentsInfo_ParamsDataView {
 public:
  ProcessInternalsHandler_GetAllWebContentsInfo_ParamsDataView() = default;

  ProcessInternalsHandler_GetAllWebContentsInfo_ParamsDataView(
      internal::ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::ProcessInternalsHandler_GetAllWebContentsInfo_Params_Data* data_ = nullptr;
};



class ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParamsDataView {
 public:
  ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParamsDataView() = default;

  ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParamsDataView(
      internal::ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetInfosDataView(
      mojo::ArrayDataView<WebContentsInfoDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadInfos(UserType* output) {
    
    auto* pointer = data_->infos.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::mojom::WebContentsInfoDataView>>(
        pointer, output, message_);
  }
 private:
  internal::ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};




inline void ProcessInternalsHandler_GetIsolationMode_ResponseParamsDataView::GetModeDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->mode.Get();
  *output = mojo::StringDataView(pointer, message_);
}




inline void ProcessInternalsHandler_GetUserTriggeredIsolatedOrigins_ResponseParamsDataView::GetIsolatedOriginsDataView(
    mojo::ArrayDataView<mojo::StringDataView>* output) {
  auto pointer = data_->isolated_origins.Get();
  *output = mojo::ArrayDataView<mojo::StringDataView>(pointer, message_);
}




inline void ProcessInternalsHandler_GetWebTriggeredIsolatedOrigins_ResponseParamsDataView::GetIsolatedOriginsDataView(
    mojo::ArrayDataView<mojo::StringDataView>* output) {
  auto pointer = data_->isolated_origins.Get();
  *output = mojo::ArrayDataView<mojo::StringDataView>(pointer, message_);
}




inline void ProcessInternalsHandler_GetGloballyIsolatedOrigins_ResponseParamsDataView::GetIsolatedOriginsDataView(
    mojo::ArrayDataView<IsolatedOriginInfoDataView>* output) {
  auto pointer = data_->isolated_origins.Get();
  *output = mojo::ArrayDataView<IsolatedOriginInfoDataView>(pointer, message_);
}




inline void ProcessInternalsHandler_GetAllWebContentsInfo_ResponseParamsDataView::GetInfosDataView(
    mojo::ArrayDataView<WebContentsInfoDataView>* output) {
  auto pointer = data_->infos.Get();
  *output = mojo::ArrayDataView<WebContentsInfoDataView>(pointer, message_);
}

}  // namespace mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // CONTENT_BROWSER_PROCESS_INTERNALS_PROCESS_INTERNALS_MOJOM_PARAMS_DATA_H_