// third_party/blink/public/mojom/input/synchronous_compositor.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_INPUT_SYNCHRONOUS_COMPOSITOR_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_INPUT_SYNCHRONOUS_COMPOSITOR_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace blink {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_DemandDrawHwAsync_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorDemandDrawHwParams_Data> draw_params;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_DemandDrawHwAsync_Params_Data>;

  SynchronousCompositor_DemandDrawHwAsync_Params_Data();
  ~SynchronousCompositor_DemandDrawHwAsync_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_DemandDrawHwAsync_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_DemandDrawHwAsync_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_DemandDrawHw_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorDemandDrawHwParams_Data> draw_params;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_DemandDrawHw_Params_Data>;

  SynchronousCompositor_DemandDrawHw_Params_Data();
  ~SynchronousCompositor_DemandDrawHw_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_DemandDrawHw_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_DemandDrawHw_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_DemandDrawHw_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorCommonRendererParams_Data> result;
  uint32_t layer_tree_frame_sink_id;
  uint32_t metadata_version;
  mojo::internal::Pointer<::viz::mojom::internal::LocalSurfaceId_Data> local_surface_id;
  mojo::internal::Pointer<::viz::mojom::internal::CompositorFrame_Data> frame;
  mojo::internal::Pointer<::viz::mojom::internal::HitTestRegionList_Data> hit_test_region_list;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_DemandDrawHw_ResponseParams_Data>;

  SynchronousCompositor_DemandDrawHw_ResponseParams_Data();
  ~SynchronousCompositor_DemandDrawHw_ResponseParams_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_DemandDrawHw_ResponseParams_Data) == 48,
              "Bad sizeof(SynchronousCompositor_DemandDrawHw_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_SetSharedMemory_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::WritableSharedMemoryRegion_Data> shm_region;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_SetSharedMemory_Params_Data>;

  SynchronousCompositor_SetSharedMemory_Params_Data();
  ~SynchronousCompositor_SetSharedMemory_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_SetSharedMemory_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_SetSharedMemory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_SetSharedMemory_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<internal::SyncCompositorCommonRendererParams_Data> result;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_SetSharedMemory_ResponseParams_Data>;

  SynchronousCompositor_SetSharedMemory_ResponseParams_Data();
  ~SynchronousCompositor_SetSharedMemory_ResponseParams_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_SetSharedMemory_ResponseParams_Data) == 24,
              "Bad sizeof(SynchronousCompositor_SetSharedMemory_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_DemandDrawSw_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorDemandDrawSwParams_Data> draw_params;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_DemandDrawSw_Params_Data>;

  SynchronousCompositor_DemandDrawSw_Params_Data();
  ~SynchronousCompositor_DemandDrawSw_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_DemandDrawSw_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_DemandDrawSw_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_DemandDrawSw_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorCommonRendererParams_Data> result;
  uint32_t metadata_version;
  uint8_t pad1_[4];
  mojo::internal::Pointer<::viz::mojom::internal::CompositorFrameMetadata_Data> meta_data;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_DemandDrawSw_ResponseParams_Data>;

  SynchronousCompositor_DemandDrawSw_ResponseParams_Data();
  ~SynchronousCompositor_DemandDrawSw_ResponseParams_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_DemandDrawSw_ResponseParams_Data) == 32,
              "Bad sizeof(SynchronousCompositor_DemandDrawSw_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_WillSkipDraw_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_WillSkipDraw_Params_Data>;

  SynchronousCompositor_WillSkipDraw_Params_Data();
  ~SynchronousCompositor_WillSkipDraw_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_WillSkipDraw_Params_Data) == 8,
              "Bad sizeof(SynchronousCompositor_WillSkipDraw_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_ZeroSharedMemory_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_ZeroSharedMemory_Params_Data>;

  SynchronousCompositor_ZeroSharedMemory_Params_Data();
  ~SynchronousCompositor_ZeroSharedMemory_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_ZeroSharedMemory_Params_Data) == 8,
              "Bad sizeof(SynchronousCompositor_ZeroSharedMemory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_ZoomBy_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  float delta;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> anchor;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_ZoomBy_Params_Data>;

  SynchronousCompositor_ZoomBy_Params_Data();
  ~SynchronousCompositor_ZoomBy_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_ZoomBy_Params_Data) == 24,
              "Bad sizeof(SynchronousCompositor_ZoomBy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_ZoomBy_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorCommonRendererParams_Data> result;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_ZoomBy_ResponseParams_Data>;

  SynchronousCompositor_ZoomBy_ResponseParams_Data();
  ~SynchronousCompositor_ZoomBy_ResponseParams_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_ZoomBy_ResponseParams_Data) == 16,
              "Bad sizeof(SynchronousCompositor_ZoomBy_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_SetMemoryPolicy_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t bytes_limit;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_SetMemoryPolicy_Params_Data>;

  SynchronousCompositor_SetMemoryPolicy_Params_Data();
  ~SynchronousCompositor_SetMemoryPolicy_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_SetMemoryPolicy_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_SetMemoryPolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_ReclaimResources_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t layer_tree_frame_sink_id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::ReturnedResource_Data>>> resources;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_ReclaimResources_Params_Data>;

  SynchronousCompositor_ReclaimResources_Params_Data();
  ~SynchronousCompositor_ReclaimResources_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_ReclaimResources_Params_Data) == 24,
              "Bad sizeof(SynchronousCompositor_ReclaimResources_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_OnCompositorFrameTransitionDirectiveProcessed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t layer_tree_frame_sink_id;
  uint32_t sequence_id;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_OnCompositorFrameTransitionDirectiveProcessed_Params_Data>;

  SynchronousCompositor_OnCompositorFrameTransitionDirectiveProcessed_Params_Data();
  ~SynchronousCompositor_OnCompositorFrameTransitionDirectiveProcessed_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_OnCompositorFrameTransitionDirectiveProcessed_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_OnCompositorFrameTransitionDirectiveProcessed_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_SetScroll_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> offset;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_SetScroll_Params_Data>;

  SynchronousCompositor_SetScroll_Params_Data();
  ~SynchronousCompositor_SetScroll_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_SetScroll_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_SetScroll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_BeginFrame_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::BeginFrameArgs_Data> args;
  mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, mojo::internal::Pointer<::viz::mojom::internal::FrameTimingDetails_Data>>> timing_details;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_BeginFrame_Params_Data>;

  SynchronousCompositor_BeginFrame_Params_Data();
  ~SynchronousCompositor_BeginFrame_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_BeginFrame_Params_Data) == 24,
              "Bad sizeof(SynchronousCompositor_BeginFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositor_SetBeginFrameSourcePaused_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t paused : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositor_SetBeginFrameSourcePaused_Params_Data>;

  SynchronousCompositor_SetBeginFrameSourcePaused_Params_Data();
  ~SynchronousCompositor_SetBeginFrameSourcePaused_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositor_SetBeginFrameSourcePaused_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositor_SetBeginFrameSourcePaused_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositorHost_LayerTreeFrameSinkCreated_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositorHost_LayerTreeFrameSinkCreated_Params_Data>;

  SynchronousCompositorHost_LayerTreeFrameSinkCreated_Params_Data();
  ~SynchronousCompositorHost_LayerTreeFrameSinkCreated_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositorHost_LayerTreeFrameSinkCreated_Params_Data) == 8,
              "Bad sizeof(SynchronousCompositorHost_LayerTreeFrameSinkCreated_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositorHost_UpdateState_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorCommonRendererParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositorHost_UpdateState_Params_Data>;

  SynchronousCompositorHost_UpdateState_Params_Data();
  ~SynchronousCompositorHost_UpdateState_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositorHost_UpdateState_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositorHost_UpdateState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositorHost_SetNeedsBeginFrames_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t needs_begin_frames : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositorHost_SetNeedsBeginFrames_Params_Data>;

  SynchronousCompositorHost_SetNeedsBeginFrames_Params_Data();
  ~SynchronousCompositorHost_SetNeedsBeginFrames_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositorHost_SetNeedsBeginFrames_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositorHost_SetNeedsBeginFrames_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositorControlHost_ReturnFrame_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t layer_tree_frame_sink_id;
  uint32_t metadata_version;
  mojo::internal::Pointer<::viz::mojom::internal::LocalSurfaceId_Data> local_surface_id;
  mojo::internal::Pointer<::viz::mojom::internal::CompositorFrame_Data> frame;
  mojo::internal::Pointer<::viz::mojom::internal::HitTestRegionList_Data> hit_test_region_list;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositorControlHost_ReturnFrame_Params_Data>;

  SynchronousCompositorControlHost_ReturnFrame_Params_Data();
  ~SynchronousCompositorControlHost_ReturnFrame_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositorControlHost_ReturnFrame_Params_Data) == 40,
              "Bad sizeof(SynchronousCompositorControlHost_ReturnFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SynchronousCompositorControlHost_BeginFrameResponse_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncCompositorCommonRendererParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<SynchronousCompositorControlHost_BeginFrameResponse_Params_Data>;

  SynchronousCompositorControlHost_BeginFrameResponse_Params_Data();
  ~SynchronousCompositorControlHost_BeginFrameResponse_Params_Data() = delete;
};
static_assert(sizeof(SynchronousCompositorControlHost_BeginFrameResponse_Params_Data) == 16,
              "Bad sizeof(SynchronousCompositorControlHost_BeginFrameResponse_Params_Data)");

}  // namespace internal


class SynchronousCompositor_DemandDrawHwAsync_ParamsDataView {
 public:
  SynchronousCompositor_DemandDrawHwAsync_ParamsDataView() = default;

  SynchronousCompositor_DemandDrawHwAsync_ParamsDataView(
      internal::SynchronousCompositor_DemandDrawHwAsync_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetDrawParamsDataView(
      SyncCompositorDemandDrawHwParamsDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadDrawParams(UserType* output) {
    
    auto* pointer = data_->draw_params.Get();
    return mojo::internal::Deserialize<::blink::mojom::SyncCompositorDemandDrawHwParamsDataView>(
        pointer, output, message_);
  }
 private:
