// content/common/shared_storage_worklet_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CONTENT_COMMON_SHARED_STORAGE_WORKLET_SERVICE_MOJOM_PARAMS_DATA_H_
#define CONTENT_COMMON_SHARED_STORAGE_WORKLET_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace shared_storage_worklet {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::SharedStorageKeyArgument_Data> key;
  mojo::internal::Pointer<::blink::mojom::internal::SharedStorageValueArgument_Data> value;
  uint8_t ignore_if_present : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data) == 32,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageSet_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageSet_ResponseParams_Data>;

  SharedStorageWorkletServiceClient_SharedStorageSet_ResponseParams_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageSet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageSet_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageSet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageAppend_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::SharedStorageKeyArgument_Data> key;
  mojo::internal::Pointer<::blink::mojom::internal::SharedStorageValueArgument_Data> value;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageAppend_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageAppend_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageAppend_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageAppend_Params_Data) == 24,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageAppend_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageAppend_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageAppend_ResponseParams_Data>;

  SharedStorageWorkletServiceClient_SharedStorageAppend_ResponseParams_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageAppend_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageAppend_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageAppend_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageDelete_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::SharedStorageKeyArgument_Data> key;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageDelete_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageDelete_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageDelete_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageDelete_Params_Data) == 16,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageDelete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageDelete_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageDelete_ResponseParams_Data>;

  SharedStorageWorkletServiceClient_SharedStorageDelete_ResponseParams_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageDelete_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageDelete_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageDelete_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageClear_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageClear_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageClear_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageClear_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageClear_Params_Data) == 8,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageClear_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageClear_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageClear_ResponseParams_Data>;

  SharedStorageWorkletServiceClient_SharedStorageClear_ResponseParams_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageClear_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageClear_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageClear_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::SharedStorageKeyArgument_Data> key;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data) == 16,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t status;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data>;

  SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data) == 32,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data listener;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data) == 16,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data listener;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data) == 16,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data>;

  SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data) == 8,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[3];
  uint32_t length;
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data>;

  SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data();
  ~SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletServiceClient_ConsoleLog_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_ConsoleLog_Params_Data>;

  SharedStorageWorkletServiceClient_ConsoleLog_Params_Data();
  ~SharedStorageWorkletServiceClient_ConsoleLog_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_ConsoleLog_Params_Data) == 16,
              "Bad sizeof(SharedStorageWorkletServiceClient_ConsoleLog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_BindSharedStorageWorkletServiceClient_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data client;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_BindSharedStorageWorkletServiceClient_Params_Data>;

  SharedStorageWorkletService_BindSharedStorageWorkletServiceClient_Params_Data();
  ~SharedStorageWorkletService_BindSharedStorageWorkletServiceClient_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_BindSharedStorageWorkletServiceClient_Params_Data) == 16,
              "Bad sizeof(SharedStorageWorkletService_BindSharedStorageWorkletServiceClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_AddModule_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data url_loader_factory;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> script_source_url;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_AddModule_Params_Data>;

  SharedStorageWorkletService_AddModule_Params_Data();
  ~SharedStorageWorkletService_AddModule_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_AddModule_Params_Data) == 24,
              "Bad sizeof(SharedStorageWorkletService_AddModule_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_AddModule_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_AddModule_ResponseParams_Data>;

  SharedStorageWorkletService_AddModule_ResponseParams_Data();
  ~SharedStorageWorkletService_AddModule_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_AddModule_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletService_AddModule_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_RunURLSelectionOperation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> serialized_data;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunURLSelectionOperation_Params_Data>;

  SharedStorageWorkletService_RunURLSelectionOperation_Params_Data();
  ~SharedStorageWorkletService_RunURLSelectionOperation_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunURLSelectionOperation_Params_Data) == 32,
              "Bad sizeof(SharedStorageWorkletService_RunURLSelectionOperation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[3];
  uint32_t index;
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data>;

  SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data();
  ~SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_RunOperation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> serialized_data;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunOperation_Params_Data>;

  SharedStorageWorkletService_RunOperation_Params_Data();
  ~SharedStorageWorkletService_RunOperation_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunOperation_Params_Data) == 24,
              "Bad sizeof(SharedStorageWorkletService_RunOperation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) SharedStorageWorkletService_RunOperation_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> error_message;

 private:
  friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunOperation_ResponseParams_Data>;

  SharedStorageWorkletService_RunOperation_ResponseParams_Data();
  ~SharedStorageWorkletService_RunOperation_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunOperation_ResponseParams_Data) == 24,
              "Bad sizeof(SharedStorageWorkletService_RunOperation_ResponseParams_Data)");

}  // namespace internal


class SharedStorageWorkletServiceClient_SharedStorageSet_ParamsDataView {
 public:
  SharedStorageWorkletServiceClient_SharedStorageSet_ParamsDataView() = default;

  SharedStorageWorkletServiceClient_SharedStorageSet_ParamsDataView(
      internal::SharedStorageWorkletServiceClient_SharedStorageSet_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetKeyDataView(
      ::blink::mojom::SharedStorageKeyArgumentDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadKey(UserType* output) {
    
    auto* pointer = data_->key.Get();
    return mojo::internal::Deserialize<::blink::mojom::SharedStorageKeyArgumentDataView>(
        pointer, output, message_);
  }
