// content/common/frame.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CONTENT_COMMON_FRAME_MOJOM_PARAMS_DATA_H_
#define CONTENT_COMMON_FRAME_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace content {
namespace mojom {
namespace internal {

class ValidationContext;
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHTMLSerializerHandler_DidReceiveData_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> data_buffer;

 private:
  friend class mojo::internal::MessageFragment<FrameHTMLSerializerHandler_DidReceiveData_Params_Data>;

  FrameHTMLSerializerHandler_DidReceiveData_Params_Data();
  ~FrameHTMLSerializerHandler_DidReceiveData_Params_Data() = delete;
};
static_assert(sizeof(FrameHTMLSerializerHandler_DidReceiveData_Params_Data) == 16,
              "Bad sizeof(FrameHTMLSerializerHandler_DidReceiveData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHTMLSerializerHandler_Done_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<FrameHTMLSerializerHandler_Done_Params_Data>;

  FrameHTMLSerializerHandler_Done_Params_Data();
  ~FrameHTMLSerializerHandler_Done_Params_Data() = delete;
};
static_assert(sizeof(FrameHTMLSerializerHandler_Done_Params_Data) == 8,
              "Bad sizeof(FrameHTMLSerializerHandler_Done_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_CommitSameDocumentNavigation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::CommonNavigationParams_Data> common_params;
  mojo::internal::Pointer<::blink::mojom::internal::CommitNavigationParams_Data> request_params;

 private:
  friend class mojo::internal::MessageFragment<Frame_CommitSameDocumentNavigation_Params_Data>;

  Frame_CommitSameDocumentNavigation_Params_Data();
  ~Frame_CommitSameDocumentNavigation_Params_Data() = delete;
};
static_assert(sizeof(Frame_CommitSameDocumentNavigation_Params_Data) == 24,
              "Bad sizeof(Frame_CommitSameDocumentNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_CommitSameDocumentNavigation_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t commit_result;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Frame_CommitSameDocumentNavigation_ResponseParams_Data>;

  Frame_CommitSameDocumentNavigation_ResponseParams_Data();
  ~Frame_CommitSameDocumentNavigation_ResponseParams_Data() = delete;
};
static_assert(sizeof(Frame_CommitSameDocumentNavigation_ResponseParams_Data) == 16,
              "Bad sizeof(Frame_CommitSameDocumentNavigation_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_UpdateSubresourceLoaderFactories_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::URLLoaderFactoryBundle_Data> subresource_loader_factories;

 private:
  friend class mojo::internal::MessageFragment<Frame_UpdateSubresourceLoaderFactories_Params_Data>;

  Frame_UpdateSubresourceLoaderFactories_Params_Data();
  ~Frame_UpdateSubresourceLoaderFactories_Params_Data() = delete;
};
static_assert(sizeof(Frame_UpdateSubresourceLoaderFactories_Params_Data) == 16,
              "Bad sizeof(Frame_UpdateSubresourceLoaderFactories_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_SetWantErrorMessageStackTrace_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Frame_SetWantErrorMessageStackTrace_Params_Data>;

  Frame_SetWantErrorMessageStackTrace_Params_Data();
  ~Frame_SetWantErrorMessageStackTrace_Params_Data() = delete;
};
static_assert(sizeof(Frame_SetWantErrorMessageStackTrace_Params_Data) == 8,
              "Bad sizeof(Frame_SetWantErrorMessageStackTrace_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_Unload_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_loading : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<::blink::mojom::internal::FrameReplicationState_Data> new_remote_frame_replication_state;
  mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> new_remote_frame_token;
  mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameInterfacesFromBrowser_Data> new_remote_frame_interfaces;
  mojo::internal::Pointer<::blink::mojom::internal::RemoteMainFrameInterfaces_Data> new_remote_main_frame_interfaces;

 private:
  friend class mojo::internal::MessageFragment<Frame_Unload_Params_Data>;

  Frame_Unload_Params_Data();
  ~Frame_Unload_Params_Data() = delete;
};
static_assert(sizeof(Frame_Unload_Params_Data) == 48,
              "Bad sizeof(Frame_Unload_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_Delete_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t intention;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Frame_Delete_Params_Data>;

  Frame_Delete_Params_Data();
  ~Frame_Delete_Params_Data() = delete;
};
static_assert(sizeof(Frame_Delete_Params_Data) == 16,
              "Bad sizeof(Frame_Delete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_UndoCommitNavigation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_loading : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<::blink::mojom::internal::FrameReplicationState_Data> new_remote_frame_replication_state;
  mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> new_remote_frame_token;
  mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameInterfacesFromBrowser_Data> new_remote_frame_interfaces;
  mojo::internal::Pointer<::blink::mojom::internal::RemoteMainFrameInterfaces_Data> new_remote_main_frame_interfaces;

 private:
  friend class mojo::internal::MessageFragment<Frame_UndoCommitNavigation_Params_Data>;

  Frame_UndoCommitNavigation_Params_Data();
  ~Frame_UndoCommitNavigation_Params_Data() = delete;
};
static_assert(sizeof(Frame_UndoCommitNavigation_Params_Data) == 48,
              "Bad sizeof(Frame_UndoCommitNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_BlockRequests_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Frame_BlockRequests_Params_Data>;

  Frame_BlockRequests_Params_Data();
  ~Frame_BlockRequests_Params_Data() = delete;
};
static_assert(sizeof(Frame_BlockRequests_Params_Data) == 8,
              "Bad sizeof(Frame_BlockRequests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_ResumeBlockedRequests_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Frame_ResumeBlockedRequests_Params_Data>;

  Frame_ResumeBlockedRequests_Params_Data();
  ~Frame_ResumeBlockedRequests_Params_Data() = delete;
};
static_assert(sizeof(Frame_ResumeBlockedRequests_Params_Data) == 8,
              "Bad sizeof(Frame_ResumeBlockedRequests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_GetInterfaceProvider_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data interfaces;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Frame_GetInterfaceProvider_Params_Data>;

  Frame_GetInterfaceProvider_Params_Data();
  ~Frame_GetInterfaceProvider_Params_Data() = delete;
};
static_assert(sizeof(Frame_GetInterfaceProvider_Params_Data) == 16,
              "Bad sizeof(Frame_GetInterfaceProvider_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_SnapshotAccessibilityTree_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SnapshotAccessibilityTreeParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<Frame_SnapshotAccessibilityTree_Params_Data>;

  Frame_SnapshotAccessibilityTree_Params_Data();
  ~Frame_SnapshotAccessibilityTree_Params_Data() = delete;
};
static_assert(sizeof(Frame_SnapshotAccessibilityTree_Params_Data) == 16,
              "Bad sizeof(Frame_SnapshotAccessibilityTree_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_SnapshotAccessibilityTree_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::ax::mojom::internal::AXTreeUpdate_Data> snapshot;

 private:
  friend class mojo::internal::MessageFragment<Frame_SnapshotAccessibilityTree_ResponseParams_Data>;

  Frame_SnapshotAccessibilityTree_ResponseParams_Data();
  ~Frame_SnapshotAccessibilityTree_ResponseParams_Data() = delete;
};
static_assert(sizeof(Frame_SnapshotAccessibilityTree_ResponseParams_Data) == 16,
              "Bad sizeof(Frame_SnapshotAccessibilityTree_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_SnapshotAndDistillAXTree_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Frame_SnapshotAndDistillAXTree_Params_Data>;

  Frame_SnapshotAndDistillAXTree_Params_Data();
  ~Frame_SnapshotAndDistillAXTree_Params_Data() = delete;
};
static_assert(sizeof(Frame_SnapshotAndDistillAXTree_Params_Data) == 8,
              "Bad sizeof(Frame_SnapshotAndDistillAXTree_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_SnapshotAndDistillAXTree_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::ax::mojom::internal::AXTreeUpdate_Data> snapshot;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> content_node_ids;

 private:
  friend class mojo::internal::MessageFragment<Frame_SnapshotAndDistillAXTree_ResponseParams_Data>;

  Frame_SnapshotAndDistillAXTree_ResponseParams_Data();
  ~Frame_SnapshotAndDistillAXTree_ResponseParams_Data() = delete;
};
static_assert(sizeof(Frame_SnapshotAndDistillAXTree_ResponseParams_Data) == 24,
              "Bad sizeof(Frame_SnapshotAndDistillAXTree_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) Frame_GetSerializedHtmlWithLocalLinks_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>, mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data>>> url_map;
  mojo::internal::Pointer<mojo::internal::Map_Data<::blink::mojom::internal::FrameToken_Data, mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data>>> frame_token_map;
  uint8_t save_with_empty_url : 1;
  uint8_t pad2_[3];
  mojo::internal::Interface_Data handler_remote;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Frame_GetSerializedHtmlWithLocalLinks_Params_Data>;

  Frame_GetSerializedHtmlWithLocalLinks_Params_Data();
  ~Frame_GetSerializedHtmlWithLocalLinks_Params_Data() = delete;
};
static_assert(sizeof(Frame_GetSerializedHtmlWithLocalLinks_Params_Data) == 40,
              "Bad sizeof(Frame_GetSerializedHtmlWithLocalLinks_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameBindingsControl_AllowBindings_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t enabled_bindings_flags;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<FrameBindingsControl_AllowBindings_Params_Data>;

  FrameBindingsControl_AllowBindings_Params_Data();
  ~FrameBindingsControl_AllowBindings_Params_Data() = delete;
};
static_assert(sizeof(FrameBindingsControl_AllowBindings_Params_Data) == 16,
              "Bad sizeof(FrameBindingsControl_AllowBindings_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameBindingsControl_EnableMojoJsBindings_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::content::mojom::internal::ExtraMojoJsFeatures_Data> features;

 private:
  friend class mojo::internal::MessageFragment<FrameBindingsControl_EnableMojoJsBindings_Params_Data>;

  FrameBindingsControl_EnableMojoJsBindings_Params_Data();
  ~FrameBindingsControl_EnableMojoJsBindings_Params_Data() = delete;
};
static_assert(sizeof(FrameBindingsControl_EnableMojoJsBindings_Params_Data) == 16,
              "Bad sizeof(FrameBindingsControl_EnableMojoJsBindings_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameBindingsControl_EnableMojoJsBindingsWithBroker_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data broker;

 private:
  friend class mojo::internal::MessageFragment<FrameBindingsControl_EnableMojoJsBindingsWithBroker_Params_Data>;

  FrameBindingsControl_EnableMojoJsBindingsWithBroker_Params_Data();
  ~FrameBindingsControl_EnableMojoJsBindingsWithBroker_Params_Data() = delete;
};
static_assert(sizeof(FrameBindingsControl_EnableMojoJsBindingsWithBroker_Params_Data) == 16,
              "Bad sizeof(FrameBindingsControl_EnableMojoJsBindingsWithBroker_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameBindingsControl_BindWebUI_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  mojo::internal::AssociatedInterface_Data remote;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<FrameBindingsControl_BindWebUI_Params_Data>;

  FrameBindingsControl_BindWebUI_Params_Data();
  ~FrameBindingsControl_BindWebUI_Params_Data() = delete;
};
static_assert(sizeof(FrameBindingsControl_BindWebUI_Params_Data) == 24,
              "Bad sizeof(FrameBindingsControl_BindWebUI_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) NavigationRendererCancellationListener_RendererCancellationWindowEnded_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<NavigationRendererCancellationListener_RendererCancellationWindowEnded_Params_Data>;

  NavigationRendererCancellationListener_RendererCancellationWindowEnded_Params_Data();
  ~NavigationRendererCancellationListener_RendererCancellationWindowEnded_Params_Data() = delete;
};
static_assert(sizeof(NavigationRendererCancellationListener_RendererCancellationWindowEnded_Params_Data) == 8,
              "Bad sizeof(NavigationRendererCancellationListener_RendererCancellationWindowEnded_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_CreateNewWindow_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CreateNewWindowParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_CreateNewWindow_Params_Data>;

  FrameHost_CreateNewWindow_Params_Data();
  ~FrameHost_CreateNewWindow_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_CreateNewWindow_Params_Data) == 16,
              "Bad sizeof(FrameHost_CreateNewWindow_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_CreateNewWindow_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t status;
  uint8_t pad0_[4];
  mojo::internal::Pointer<internal::CreateNewWindowReply_Data> reply;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_CreateNewWindow_ResponseParams_Data>;

  FrameHost_CreateNewWindow_ResponseParams_Data();
  ~FrameHost_CreateNewWindow_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameHost_CreateNewWindow_ResponseParams_Data) == 24,
              "Bad sizeof(FrameHost_CreateNewWindow_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_CreateChildFrame_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t child_routing_id;
  mojo::internal::AssociatedInterface_Data frame;
  mojo::internal::Handle_Data browser_interface_broker;
  mojo::internal::Pointer<::blink::mojom::internal::PolicyContainerBindParams_Data> policy_container_bind_params;
  mojo::internal::AssociatedEndpointHandle_Data associated_interface_provider;
  int32_t scope;
  mojo::internal::Pointer<mojo::internal::String_Data> frame_name;
  mojo::internal::Pointer<mojo::internal::String_Data> frame_unique_name;
  uint8_t is_created_by_script : 1;
  uint8_t pad8_[3];
  int32_t child_frame_owner_element_type;
  mojo::internal::Pointer<::blink::mojom::internal::FramePolicy_Data> frame_policy;
  mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> frame_owner_properties;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_CreateChildFrame_Params_Data>;

  FrameHost_CreateChildFrame_Params_Data();
  ~FrameHost_CreateChildFrame_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_CreateChildFrame_Params_Data) == 80,
              "Bad sizeof(FrameHost_CreateChildFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_DidCommitProvisionalLoad_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::content::mojom::internal::DidCommitProvisionalLoadParams_Data> params;
  mojo::internal::Pointer<::content::mojom::internal::DidCommitProvisionalLoadInterfaceParams_Data> interface_params;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_DidCommitProvisionalLoad_Params_Data>;

  FrameHost_DidCommitProvisionalLoad_Params_Data();
  ~FrameHost_DidCommitProvisionalLoad_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_DidCommitProvisionalLoad_Params_Data) == 24,
              "Bad sizeof(FrameHost_DidCommitProvisionalLoad_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_DidCommitSameDocumentNavigation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::content::mojom::internal::DidCommitProvisionalLoadParams_Data> params;
  mojo::internal::Pointer<::content::mojom::internal::DidCommitSameDocumentNavigationParams_Data> same_document_params;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_DidCommitSameDocumentNavigation_Params_Data>;

  FrameHost_DidCommitSameDocumentNavigation_Params_Data();
  ~FrameHost_DidCommitSameDocumentNavigation_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_DidCommitSameDocumentNavigation_Params_Data) == 24,
              "Bad sizeof(FrameHost_DidCommitSameDocumentNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_DidOpenDocumentInputStream_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_DidOpenDocumentInputStream_Params_Data>;

  FrameHost_DidOpenDocumentInputStream_Params_Data();
  ~FrameHost_DidOpenDocumentInputStream_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_DidOpenDocumentInputStream_Params_Data) == 16,
              "Bad sizeof(FrameHost_DidOpenDocumentInputStream_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_BeginNavigation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::CommonNavigationParams_Data> common_params;
  mojo::internal::Pointer<::blink::mojom::internal::BeginNavigationParams_Data> begin_params;
  mojo::internal::Interface_Data blob_url_token;
  mojo::internal::AssociatedInterface_Data navigation_client;
  mojo::internal::Interface_Data initiator_policy_container_keep_alive_handle;
  mojo::internal::Handle_Data renderer_cancellation_listener;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<FrameHost_BeginNavigation_Params_Data>;

  FrameHost_BeginNavigation_Params_Data();
  ~FrameHost_BeginNavigation_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_BeginNavigation_Params_Data) == 56,
              "Bad sizeof(FrameHost_BeginNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_SubresourceResponseStarted_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::SchemeHostPort_Data> final_response_url;
  uint32_t cert_status;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<FrameHost_SubresourceResponseStarted_Params_Data>;

  FrameHost_SubresourceResponseStarted_Params_Data();
  ~FrameHost_SubresourceResponseStarted_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_SubresourceResponseStarted_Params_Data) == 24,
              "Bad sizeof(FrameHost_SubresourceResponseStarted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_ResourceLoadComplete_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::ResourceLoadInfo_Data> url_load_info;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_ResourceLoadComplete_Params_Data>;

  FrameHost_ResourceLoadComplete_Params_Data();
  ~FrameHost_ResourceLoadComplete_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_ResourceLoadComplete_Params_Data) == 16,
              "Bad sizeof(FrameHost_ResourceLoadComplete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_DidChangeName_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;
  mojo::internal::Pointer<mojo::internal::String_Data> unique_name;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_DidChangeName_Params_Data>;

  FrameHost_DidChangeName_Params_Data();
  ~FrameHost_DidChangeName_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_DidChangeName_Params_Data) == 24,
              "Bad sizeof(FrameHost_DidChangeName_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_CancelInitialHistoryLoad_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_CancelInitialHistoryLoad_Params_Data>;

  FrameHost_CancelInitialHistoryLoad_Params_Data();
  ~FrameHost_CancelInitialHistoryLoad_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_CancelInitialHistoryLoad_Params_Data) == 8,
              "Bad sizeof(FrameHost_CancelInitialHistoryLoad_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_UpdateEncoding_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> encoding_name;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_UpdateEncoding_Params_Data>;

  FrameHost_UpdateEncoding_Params_Data();
  ~FrameHost_UpdateEncoding_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_UpdateEncoding_Params_Data) == 16,
              "Bad sizeof(FrameHost_UpdateEncoding_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_UpdateUserGestureCarryoverInfo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_UpdateUserGestureCarryoverInfo_Params_Data>;

  FrameHost_UpdateUserGestureCarryoverInfo_Params_Data();
  ~FrameHost_UpdateUserGestureCarryoverInfo_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_UpdateUserGestureCarryoverInfo_Params_Data) == 8,
              "Bad sizeof(FrameHost_UpdateUserGestureCarryoverInfo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_UpdateState_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::content::mojom::internal::PageState_Data> state;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_UpdateState_Params_Data>;

  FrameHost_UpdateState_Params_Data();
  ~FrameHost_UpdateState_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_UpdateState_Params_Data) == 16,
              "Bad sizeof(FrameHost_UpdateState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_OpenURL_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::OpenURLParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_OpenURL_Params_Data>;

  FrameHost_OpenURL_Params_Data();
  ~FrameHost_OpenURL_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_OpenURL_Params_Data) == 16,
              "Bad sizeof(FrameHost_OpenURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_CONTENT_EXPORT) FrameHost_DidStopLoading_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<FrameHost_DidStopLoading_Params_Data>;

  FrameHost_DidStopLoading_Params_Data();
  ~FrameHost_DidStopLoading_Params_Data() = delete;
};
static_assert(sizeof(FrameHost_DidStopLoading_Params_Data) == 8,
              "Bad sizeof(FrameHost_DidStopLoading_Params_Data)");

}  // namespace internal


class FrameHTMLSerializerHandler_DidReceiveData_ParamsDataView {
 public:
  FrameHTMLSerializerHandler_DidReceiveData_ParamsDataView() = default;

  FrameHTMLSerializerHandler_DidReceiveData_ParamsDataView(
      internal::FrameHTMLSerializerHandler_DidReceiveData_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetDataBufferDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadDataBuffer(UserType* output) {
    
    auto* pointer = data_->data_buffer.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::FrameHTMLSerializerHandler_DidReceiveData_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
