// components/printing/common/print.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_PRINTING_COMMON_PRINT_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_PRINTING_COMMON_PRINT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace printing {
namespace mojom {
namespace internal {

class ValidationContext;
class  PrintRenderer_CreatePreviewDocument_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> job_settings;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderer_CreatePreviewDocument_Params_Data>;

  PrintRenderer_CreatePreviewDocument_Params_Data();
  ~PrintRenderer_CreatePreviewDocument_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderer_CreatePreviewDocument_Params_Data) == 16,
              "Bad sizeof(PrintRenderer_CreatePreviewDocument_Params_Data)");
class  PrintRenderer_CreatePreviewDocument_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> preview_document_region;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderer_CreatePreviewDocument_ResponseParams_Data>;

  PrintRenderer_CreatePreviewDocument_ResponseParams_Data();
  ~PrintRenderer_CreatePreviewDocument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintRenderer_CreatePreviewDocument_ResponseParams_Data) == 16,
              "Bad sizeof(PrintRenderer_CreatePreviewDocument_ResponseParams_Data)");
class  PrintRenderFrame_PrintRequestedPages_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintRequestedPages_Params_Data>;

  PrintRenderFrame_PrintRequestedPages_Params_Data();
  ~PrintRenderFrame_PrintRequestedPages_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintRequestedPages_Params_Data) == 8,
              "Bad sizeof(PrintRenderFrame_PrintRequestedPages_Params_Data)");
class  PrintRenderFrame_PrintWithParams_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PrintPagesParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintWithParams_Params_Data>;

  PrintRenderFrame_PrintWithParams_Params_Data();
  ~PrintRenderFrame_PrintWithParams_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintWithParams_Params_Data) == 16,
              "Bad sizeof(PrintRenderFrame_PrintWithParams_Params_Data)");
class  PrintRenderFrame_PrintWithParams_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::PrintWithParamsResult_Data result;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintWithParams_ResponseParams_Data>;

  PrintRenderFrame_PrintWithParams_ResponseParams_Data();
  ~PrintRenderFrame_PrintWithParams_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintWithParams_ResponseParams_Data) == 24,
              "Bad sizeof(PrintRenderFrame_PrintWithParams_ResponseParams_Data)");
class  PrintRenderFrame_PrintFrameContent_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PrintFrameContentParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintFrameContent_Params_Data>;

  PrintRenderFrame_PrintFrameContent_Params_Data();
  ~PrintRenderFrame_PrintFrameContent_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintFrameContent_Params_Data) == 16,
              "Bad sizeof(PrintRenderFrame_PrintFrameContent_Params_Data)");
class  PrintRenderFrame_PrintFrameContent_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t document_cookie;
  uint8_t pad0_[4];
  mojo::internal::Pointer<internal::DidPrintContentParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintFrameContent_ResponseParams_Data>;

  PrintRenderFrame_PrintFrameContent_ResponseParams_Data();
  ~PrintRenderFrame_PrintFrameContent_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintFrameContent_ResponseParams_Data) == 24,
              "Bad sizeof(PrintRenderFrame_PrintFrameContent_ResponseParams_Data)");
class  PrintRenderFrame_SetPrintingEnabled_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t enabled : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_SetPrintingEnabled_Params_Data>;

  PrintRenderFrame_SetPrintingEnabled_Params_Data();
  ~PrintRenderFrame_SetPrintingEnabled_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_SetPrintingEnabled_Params_Data) == 16,
              "Bad sizeof(PrintRenderFrame_SetPrintingEnabled_Params_Data)");
class  PrintRenderFrame_PrintingDone_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintingDone_Params_Data>;

  PrintRenderFrame_PrintingDone_Params_Data();
  ~PrintRenderFrame_PrintingDone_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintingDone_Params_Data) == 16,
              "Bad sizeof(PrintRenderFrame_PrintingDone_Params_Data)");
class  PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data>;

  PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data();
  ~PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data) == 8,
              "Bad sizeof(PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data)");
class  PrintManagerHost_DidGetPrintedPagesCount_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t cookie;
  uint32_t number_pages;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_DidGetPrintedPagesCount_Params_Data>;

  PrintManagerHost_DidGetPrintedPagesCount_Params_Data();
  ~PrintManagerHost_DidGetPrintedPagesCount_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidGetPrintedPagesCount_Params_Data) == 16,
              "Bad sizeof(PrintManagerHost_DidGetPrintedPagesCount_Params_Data)");
class  PrintManagerHost_GetDefaultPrintSettings_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_GetDefaultPrintSettings_Params_Data>;

  PrintManagerHost_GetDefaultPrintSettings_Params_Data();
  ~PrintManagerHost_GetDefaultPrintSettings_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_GetDefaultPrintSettings_Params_Data) == 8,
              "Bad sizeof(PrintManagerHost_GetDefaultPrintSettings_Params_Data)");
class  PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PrintParams_Data> default_settings;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data>;

  PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data();
  ~PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data) == 16,
              "Bad sizeof(PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data)");
class  PrintManagerHost_DidShowPrintDialog_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_DidShowPrintDialog_Params_Data>;

  PrintManagerHost_DidShowPrintDialog_Params_Data();
  ~PrintManagerHost_DidShowPrintDialog_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidShowPrintDialog_Params_Data) == 8,
              "Bad sizeof(PrintManagerHost_DidShowPrintDialog_Params_Data)");
class  PrintManagerHost_DidPrintDocument_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::DidPrintDocumentParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_DidPrintDocument_Params_Data>;

  PrintManagerHost_DidPrintDocument_Params_Data();
  ~PrintManagerHost_DidPrintDocument_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidPrintDocument_Params_Data) == 16,
              "Bad sizeof(PrintManagerHost_DidPrintDocument_Params_Data)");
class  PrintManagerHost_DidPrintDocument_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t completed : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_DidPrintDocument_ResponseParams_Data>;

  PrintManagerHost_DidPrintDocument_ResponseParams_Data();
  ~PrintManagerHost_DidPrintDocument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidPrintDocument_ResponseParams_Data) == 16,
              "Bad sizeof(PrintManagerHost_DidPrintDocument_ResponseParams_Data)");
class  PrintManagerHost_ScriptedPrint_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ScriptedPrintParams_Data> params;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_ScriptedPrint_Params_Data>;

  PrintManagerHost_ScriptedPrint_Params_Data();
  ~PrintManagerHost_ScriptedPrint_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_ScriptedPrint_Params_Data) == 16,
              "Bad sizeof(PrintManagerHost_ScriptedPrint_Params_Data)");
class  PrintManagerHost_ScriptedPrint_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PrintPagesParams_Data> settings;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_ScriptedPrint_ResponseParams_Data>;

  PrintManagerHost_ScriptedPrint_ResponseParams_Data();
  ~PrintManagerHost_ScriptedPrint_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_ScriptedPrint_ResponseParams_Data) == 16,
              "Bad sizeof(PrintManagerHost_ScriptedPrint_ResponseParams_Data)");
class  PrintManagerHost_ShowInvalidPrinterSettingsError_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_ShowInvalidPrinterSettingsError_Params_Data>;

  PrintManagerHost_ShowInvalidPrinterSettingsError_Params_Data();
  ~PrintManagerHost_ShowInvalidPrinterSettingsError_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_ShowInvalidPrinterSettingsError_Params_Data) == 8,
              "Bad sizeof(PrintManagerHost_ShowInvalidPrinterSettingsError_Params_Data)");
class  PrintManagerHost_PrintingFailed_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t cookie;
  int32_t reason;

 private:
  friend class mojo::internal::MessageFragment<PrintManagerHost_PrintingFailed_Params_Data>;

  PrintManagerHost_PrintingFailed_Params_Data();
  ~PrintManagerHost_PrintingFailed_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_PrintingFailed_Params_Data) == 16,
              "Bad sizeof(PrintManagerHost_PrintingFailed_Params_Data)");

}  // namespace internal


class PrintRenderer_CreatePreviewDocument_ParamsDataView {
 public:
  PrintRenderer_CreatePreviewDocument_ParamsDataView() = default;

  PrintRenderer_CreatePreviewDocument_ParamsDataView(
      internal::PrintRenderer_CreatePreviewDocument_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetJobSettingsDataView(
      ::mojo_base::mojom::DictionaryValueDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadJobSettings(UserType* output) {
    
    auto* pointer = data_->job_settings.Get();
    return mojo::internal::Deserialize<::mojo_base::mojom::DictionaryValueDataView>(
        pointer, output, message_);
  }
 private:
  internal::PrintRenderer_CreatePreviewDocument_Params_Data* data_ = nullptr;
