// chrome/common/cart/commerce_hints.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CHROME_COMMON_CART_COMMERCE_HINTS_MOJOM_PARAMS_DATA_H_
#define CHROME_COMMON_CART_COMMERCE_HINTS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace cart {
namespace mojom {
namespace internal {

class ValidationContext;
class  CommerceHintObserver_OnAddToCart_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> cart_url;
  mojo::internal::Pointer<mojo::internal::String_Data> product_id;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnAddToCart_Params_Data>;

  CommerceHintObserver_OnAddToCart_Params_Data();
  ~CommerceHintObserver_OnAddToCart_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnAddToCart_Params_Data) == 24,
              "Bad sizeof(CommerceHintObserver_OnAddToCart_Params_Data)");
class  CommerceHintObserver_OnVisitCart_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnVisitCart_Params_Data>;

  CommerceHintObserver_OnVisitCart_Params_Data();
  ~CommerceHintObserver_OnVisitCart_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnVisitCart_Params_Data) == 8,
              "Bad sizeof(CommerceHintObserver_OnVisitCart_Params_Data)");
class  CommerceHintObserver_OnCartProductUpdated_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::Product_Data>>> products;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnCartProductUpdated_Params_Data>;

  CommerceHintObserver_OnCartProductUpdated_Params_Data();
  ~CommerceHintObserver_OnCartProductUpdated_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnCartProductUpdated_Params_Data) == 16,
              "Bad sizeof(CommerceHintObserver_OnCartProductUpdated_Params_Data)");
class  CommerceHintObserver_OnVisitCheckout_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnVisitCheckout_Params_Data>;

  CommerceHintObserver_OnVisitCheckout_Params_Data();
  ~CommerceHintObserver_OnVisitCheckout_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnVisitCheckout_Params_Data) == 8,
              "Bad sizeof(CommerceHintObserver_OnVisitCheckout_Params_Data)");
class  CommerceHintObserver_OnPurchase_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnPurchase_Params_Data>;

  CommerceHintObserver_OnPurchase_Params_Data();
  ~CommerceHintObserver_OnPurchase_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnPurchase_Params_Data) == 8,
              "Bad sizeof(CommerceHintObserver_OnPurchase_Params_Data)");
class  CommerceHintObserver_OnFormSubmit_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_purchase : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnFormSubmit_Params_Data>;

  CommerceHintObserver_OnFormSubmit_Params_Data();
  ~CommerceHintObserver_OnFormSubmit_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnFormSubmit_Params_Data) == 16,
              "Bad sizeof(CommerceHintObserver_OnFormSubmit_Params_Data)");
class  CommerceHintObserver_OnWillSendRequest_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_addtocart : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnWillSendRequest_Params_Data>;

  CommerceHintObserver_OnWillSendRequest_Params_Data();
  ~CommerceHintObserver_OnWillSendRequest_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnWillSendRequest_Params_Data) == 16,
              "Bad sizeof(CommerceHintObserver_OnWillSendRequest_Params_Data)");
class  CommerceHintObserver_OnNavigation_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<mojo::internal::String_Data> version_number;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnNavigation_Params_Data>;

  CommerceHintObserver_OnNavigation_Params_Data();
  ~CommerceHintObserver_OnNavigation_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnNavigation_Params_Data) == 24,
              "Bad sizeof(CommerceHintObserver_OnNavigation_Params_Data)");
class  CommerceHintObserver_OnNavigation_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t should_skip : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<internal::Heuristics_Data> heuristics;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnNavigation_ResponseParams_Data>;

  CommerceHintObserver_OnNavigation_ResponseParams_Data();
  ~CommerceHintObserver_OnNavigation_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnNavigation_ResponseParams_Data) == 24,
              "Bad sizeof(CommerceHintObserver_OnNavigation_ResponseParams_Data)");
class  CommerceHintObserver_OnCartExtraction_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnCartExtraction_Params_Data>;

  CommerceHintObserver_OnCartExtraction_Params_Data();
  ~CommerceHintObserver_OnCartExtraction_Params_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnCartExtraction_Params_Data) == 8,
              "Bad sizeof(CommerceHintObserver_OnCartExtraction_Params_Data)");
class  CommerceHintObserver_OnCartExtraction_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> product_id_json;
  mojo::internal::Pointer<mojo::internal::String_Data> cart_extraction_script;

 private:
  friend class mojo::internal::MessageFragment<CommerceHintObserver_OnCartExtraction_ResponseParams_Data>;

  CommerceHintObserver_OnCartExtraction_ResponseParams_Data();
  ~CommerceHintObserver_OnCartExtraction_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceHintObserver_OnCartExtraction_ResponseParams_Data) == 24,
              "Bad sizeof(CommerceHintObserver_OnCartExtraction_ResponseParams_Data)");

}  // namespace internal


class CommerceHintObserver_OnAddToCart_ParamsDataView {
 public:
  CommerceHintObserver_OnAddToCart_ParamsDataView() = default;

  CommerceHintObserver_OnAddToCart_ParamsDataView(
      internal::CommerceHintObserver_OnAddToCart_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetCartUrlDataView(
      ::url::mojom::UrlDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadCartUrl(UserType* output) {
    
static_assert(
    mojo::internal::IsValidUserTypeForOptionalValue<
        ::url::mojom::UrlDataView, UserType>(),
    "Attempting to read the optional `cart_url` field into a type which "
    "cannot represent a null value. Either wrap the destination object "
    "with absl::optional, ensure that any corresponding "
    "{Struct/Union/Array/String}Traits define the necessary IsNull and "
    "SetToNull methods, or use `MaybeReadCartUrl` instead "
    "of `ReadCartUrl if you're fine with null values being "
    "silently ignored in this case.");
    auto* pointer = data_->cart_url.Get();
    return mojo::internal::Deserialize<::url::mojom::UrlDataView>(
        pointer, output, message_);
  }
  inline void GetProductIdDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadProductId(UserType* output) {
    
    auto* pointer = data_->product_id.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::CommerceHintObserver_OnAddToCart_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class CommerceHintObserver_OnVisitCart_ParamsDataView {
 public:
  CommerceHintObserver_OnVisitCart_ParamsDataView() = default;

  CommerceHintObserver_OnVisitCart_ParamsDataView(
      internal::CommerceHintObserver_OnVisitCart_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CommerceHintObserver_OnVisitCart_Params_Data* data_ = nullptr;
};



class CommerceHintObserver_OnCartProductUpdated_ParamsDataView {
 public:
  CommerceHintObserver_OnCartProductUpdated_ParamsDataView() = default;

  CommerceHintObserver_OnCartProductUpdated_ParamsDataView(
      internal::CommerceHintObserver_OnCartProductUpdated_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetProductsDataView(
      mojo::ArrayDataView<ProductDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadProducts(UserType* output) {
    
    auto* pointer = data_->products.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::cart::mojom::ProductDataView>>(
        pointer, output, message_);
  }
 private:
  internal::CommerceHintObserver_OnCartProductUpdated_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class CommerceHintObserver_OnVisitCheckout_ParamsDataView {
 public:
  CommerceHintObserver_OnVisitCheckout_ParamsDataView() = default;

  CommerceHintObserver_OnVisitCheckout_ParamsDataView(
      internal::CommerceHintObserver_OnVisitCheckout_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CommerceHintObserver_OnVisitCheckout_Params_Data* data_ = nullptr;
};



class CommerceHintObserver_OnPurchase_ParamsDataView {
 public:
  CommerceHintObserver_OnPurchase_ParamsDataView() = default;

  CommerceHintObserver_OnPurchase_ParamsDataView(
      internal::CommerceHintObserver_OnPurchase_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CommerceHintObserver_OnPurchase_Params_Data* data_ = nullptr;
};



class CommerceHintObserver_OnFormSubmit_ParamsDataView {
 public:
  CommerceHintObserver_OnFormSubmit_ParamsDataView() = default;

  CommerceHintObserver_OnFormSubmit_ParamsDataView(
      internal::CommerceHintObserver_OnFormSubmit_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool is_purchase() const {
    return data_->is_purchase;
  }
 private:
  internal::CommerceHintObserver_OnFormSubmit_Params_Data* data_ = nullptr;
};



class CommerceHintObserver_OnWillSendRequest_ParamsDataView {
 public:
  CommerceHintObserver_OnWillSendRequest_ParamsDataView() = default;

  CommerceHintObserver_OnWillSendRequest_ParamsDataView(
      internal::CommerceHintObserver_OnWillSendRequest_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool is_addtocart() const {
    return data_->is_addtocart;
  }
 private:
  internal::CommerceHintObserver_OnWillSendRequest_Params_Data* data_ = nullptr;
};



class CommerceHintObserver_OnNavigation_ParamsDataView {
 public:
  CommerceHintObserver_OnNavigation_ParamsDataView() = default;

  CommerceHintObserver_OnNavigation_ParamsDataView(
      internal::CommerceHintObserver_OnNavigation_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetUrlDataView(
      ::url::mojom::UrlDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadUrl(UserType* output) {
    
    auto* pointer = data_->url.Get();
    return mojo::internal::Deserialize<::url::mojom::UrlDataView>(
        pointer, output, message_);
  }
  inline void GetVersionNumberDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadVersionNumber(UserType* output) {
    
    auto* pointer = data_->version_number.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::CommerceHintObserver_OnNavigation_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class CommerceHintObserver_OnNavigation_ResponseParamsDataView {
 public:
  CommerceHintObserver_OnNavigation_ResponseParamsDataView() = default;

  CommerceHintObserver_OnNavigation_ResponseParamsDataView(
      internal::CommerceHintObserver_OnNavigation_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  bool should_skip() const {
    return data_->should_skip;
  }
  inline void GetHeuristicsDataView(
      HeuristicsDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadHeuristics(UserType* output) {
    
    auto* pointer = data_->heuristics.Get();
    return mojo::internal::Deserialize<::cart::mojom::HeuristicsDataView>(
        pointer, output, message_);
  }
 private:
  internal::CommerceHintObserver_OnNavigation_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class CommerceHintObserver_OnCartExtraction_ParamsDataView {
 public:
  CommerceHintObserver_OnCartExtraction_ParamsDataView() = default;

  CommerceHintObserver_OnCartExtraction_ParamsDataView(
      internal::CommerceHintObserver_OnCartExtraction_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CommerceHintObserver_OnCartExtraction_Params_Data* data_ = nullptr;
};



class CommerceHintObserver_OnCartExtraction_ResponseParamsDataView {
 public:
  CommerceHintObserver_OnCartExtraction_ResponseParamsDataView() = default;

  CommerceHintObserver_OnCartExtraction_ResponseParamsDataView(
      internal::CommerceHintObserver_OnCartExtraction_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetProductIdJsonDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadProductIdJson(UserType* output) {
    
    auto* pointer = data_->product_id_json.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
  inline void GetCartExtractionScriptDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadCartExtractionScript(UserType* output) {
    
    auto* pointer = data_->cart_extraction_script.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::CommerceHintObserver_OnCartExtraction_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};


inline void CommerceHintObserver_OnAddToCart_ParamsDataView::GetCartUrlDataView(
    ::url::mojom::UrlDataView* output) {
  auto pointer = data_->cart_url.Get();
  *output = ::url::mojom::UrlDataView(pointer, message_);
}
inline void CommerceHintObserver_OnAddToCart_ParamsDataView::GetProductIdDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->product_id.Get();
  *output = mojo::StringDataView(pointer, message_);
}




inline void CommerceHintObserver_OnCartProductUpdated_ParamsDataView::GetProductsDataView(
    mojo::ArrayDataView<ProductDataView>* output) {
  auto pointer = data_->products.Get();
  *output = mojo::ArrayDataView<ProductDataView>(pointer, message_);
}










inline void CommerceHintObserver_OnNavigation_ParamsDataView::GetUrlDataView(
    ::url::mojom::UrlDataView* output) {
  auto pointer = data_->url.Get();
  *output = ::url::mojom::UrlDataView(pointer, message_);
}
inline void CommerceHintObserver_OnNavigation_ParamsDataView::GetVersionNumberDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->version_number.Get();
  *output = mojo::StringDataView(pointer, message_);
}


inline void CommerceHintObserver_OnNavigation_ResponseParamsDataView::GetHeuristicsDataView(
    HeuristicsDataView* output) {
  auto pointer = data_->heuristics.Get();
  *output = HeuristicsDataView(pointer, message_);
}




inline void CommerceHintObserver_OnCartExtraction_ResponseParamsDataView::GetProductIdJsonDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->product_id_json.Get();
  *output = mojo::StringDataView(pointer, message_);
}
inline void CommerceHintObserver_OnCartExtraction_ResponseParamsDataView::GetCartExtractionScriptDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->cart_extraction_script.Get();
  *output = mojo::StringDataView(pointer, message_);
}

}  // namespace mojom
}  // namespace cart

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // CHROME_COMMON_CART_COMMERCE_HINTS_MOJOM_PARAMS_DATA_H_