// chrome/browser/media/history/media_history_store.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef CHROME_BROWSER_MEDIA_HISTORY_MEDIA_HISTORY_STORE_MOJOM_PARAMS_DATA_H_
#define CHROME_BROWSER_MEDIA_HISTORY_MEDIA_HISTORY_STORE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace media_history {
namespace mojom {
namespace internal {

class ValidationContext;
class  MediaHistoryStore_GetMediaHistoryStats_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryStats_Params_Data>;

  MediaHistoryStore_GetMediaHistoryStats_Params_Data();
  ~MediaHistoryStore_GetMediaHistoryStats_Params_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryStats_Params_Data) == 8,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryStats_Params_Data)");
class  MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::MediaHistoryStats_Data> stats;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data>;

  MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data();
  ~MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data) == 16,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data)");
class  MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data>;

  MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data();
  ~MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data) == 8,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data)");
class  MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaHistoryOriginRow_Data>>> rows;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data>;

  MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data();
  ~MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data) == 16,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data)");
class  MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data>;

  MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data();
  ~MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data) == 8,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data)");
class  MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaHistoryPlaybackRow_Data>>> rows;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data>;

  MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data();
  ~MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data) == 16,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data)");
class  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data>;

  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data();
  ~MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data) == 8,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data)");
class  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaHistoryPlaybackSessionRow_Data>>> rows;

 private:
  friend class mojo::internal::MessageFragment<MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data>;

  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data();
  ~MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data) == 16,
              "Bad sizeof(MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data)");

}  // namespace internal


class MediaHistoryStore_GetMediaHistoryStats_ParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryStats_ParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryStats_ParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryStats_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::MediaHistoryStore_GetMediaHistoryStats_Params_Data* data_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryStats_ResponseParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryStats_ResponseParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryStats_ResponseParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetStatsDataView(
      MediaHistoryStatsDataView* output);

  template <typename UserType>
  [[nodiscard]] bool ReadStats(UserType* output) {
    
    auto* pointer = data_->stats.Get();
    return mojo::internal::Deserialize<::media_history::mojom::MediaHistoryStatsDataView>(
        pointer, output, message_);
  }
 private:
  internal::MediaHistoryStore_GetMediaHistoryStats_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryOriginRows_ParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryOriginRows_ParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryOriginRows_ParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::MediaHistoryStore_GetMediaHistoryOriginRows_Params_Data* data_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetRowsDataView(
      mojo::ArrayDataView<MediaHistoryOriginRowDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadRows(UserType* output) {
    
    auto* pointer = data_->rows.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::media_history::mojom::MediaHistoryOriginRowDataView>>(
        pointer, output, message_);
  }
 private:
  internal::MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryPlaybackRows_ParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryPlaybackRows_ParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryPlaybackRows_ParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::MediaHistoryStore_GetMediaHistoryPlaybackRows_Params_Data* data_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetRowsDataView(
      mojo::ArrayDataView<MediaHistoryPlaybackRowDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadRows(UserType* output) {
    
    auto* pointer = data_->rows.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::media_history::mojom::MediaHistoryPlaybackRowDataView>>(
        pointer, output, message_);
  }
 private:
  internal::MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_Params_Data* data_ = nullptr;
};



class MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParamsDataView {
 public:
  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParamsDataView() = default;

  MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParamsDataView(
      internal::MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetRowsDataView(
      mojo::ArrayDataView<MediaHistoryPlaybackSessionRowDataView>* output);

  template <typename UserType>
  [[nodiscard]] bool ReadRows(UserType* output) {
    
    auto* pointer = data_->rows.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::media_history::mojom::MediaHistoryPlaybackSessionRowDataView>>(
        pointer, output, message_);
  }
 private:
  internal::MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};




inline void MediaHistoryStore_GetMediaHistoryStats_ResponseParamsDataView::GetStatsDataView(
    MediaHistoryStatsDataView* output) {
  auto pointer = data_->stats.Get();
  *output = MediaHistoryStatsDataView(pointer, message_);
}




inline void MediaHistoryStore_GetMediaHistoryOriginRows_ResponseParamsDataView::GetRowsDataView(
    mojo::ArrayDataView<MediaHistoryOriginRowDataView>* output) {
  auto pointer = data_->rows.Get();
  *output = mojo::ArrayDataView<MediaHistoryOriginRowDataView>(pointer, message_);
}




inline void MediaHistoryStore_GetMediaHistoryPlaybackRows_ResponseParamsDataView::GetRowsDataView(
    mojo::ArrayDataView<MediaHistoryPlaybackRowDataView>* output) {
  auto pointer = data_->rows.Get();
  *output = mojo::ArrayDataView<MediaHistoryPlaybackRowDataView>(pointer, message_);
}




inline void MediaHistoryStore_GetMediaHistoryPlaybackSessionRows_ResponseParamsDataView::GetRowsDataView(
    mojo::ArrayDataView<MediaHistoryPlaybackSessionRowDataView>* output) {
  auto pointer = data_->rows.Get();
  *output = mojo::ArrayDataView<MediaHistoryPlaybackSessionRowDataView>(pointer, message_);
}

}  // namespace mojom
}  // namespace media_history

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // CHROME_BROWSER_MEDIA_HISTORY_MEDIA_HISTORY_STORE_MOJOM_PARAMS_DATA_H_